var citys = [
    {
        "adcode": "13",
        "name": "河北省",
        "s": [
            {
                "adcode": "1305",
                "name": "邢台市",
                "s": [
                    {
                        "adcode": "130599",
                        "name": "邢台市市本级"
                    },
                    {
                        "adcode": "130502",
                        "name": "桥东区"
                    },
                    {
                        "adcode": "130503",
                        "name": "桥西区"
                    },
                    {
                        "adcode": "130521",
                        "name": "邢台县"
                    },
                    {
                        "adcode": "130522",
                        "name": "临城县"
                    },
                    {
                        "adcode": "130523",
                        "name": "内丘县"
                    },
                    {
                        "adcode": "130524",
                        "name": "柏乡县"
                    },
                    {
                        "adcode": "130525",
                        "name": "隆尧县"
                    },
                    {
                        "adcode": "130526",
                        "name": "任县"
                    },
                    {
                        "adcode": "130527",
                        "name": "南和县"
                    },
                    {
                        "adcode": "130528",
                        "name": "宁晋县"
                    },
                    {
                        "adcode": "130529",
                        "name": "巨鹿县"
                    },
                    {
                        "adcode": "130530",
                        "name": "新河县"
                    },
                    {
                        "adcode": "130531",
                        "name": "广宗县"
                    },
                    {
                        "adcode": "130532",
                        "name": "平乡县"
                    },
                    {
                        "adcode": "130533",
                        "name": "威县"
                    },
                    {
                        "adcode": "130534",
                        "name": "清河县"
                    },
                    {
                        "adcode": "130535",
                        "name": "临西县"
                    },
                    {
                        "adcode": "130540",
                        "name": "高开区"
                    },
                    {
                        "adcode": "130541",
                        "name": "大曹庄"
                    },
                    {
                        "adcode": "130581",
                        "name": "南宫市"
                    },
                    {
                        "adcode": "130582",
                        "name": "沙河市"
                    },
                    {
                        "adcode": "130501",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "130571",
                        "name": "河北邢台经济开发区"
                    }
                ]
            },
            {
                "adcode": "1304",
                "name": "邯郸市",
                "s": [
                    {
                        "adcode": "130499",
                        "name": "邯郸市市本级"
                    },
                    {
                        "adcode": "130402",
                        "name": "邯山区"
                    },
                    {
                        "adcode": "130403",
                        "name": "丛台区"
                    },
                    {
                        "adcode": "130404",
                        "name": "复兴区"
                    },
                    {
                        "adcode": "130406",
                        "name": "峰峰矿区"
                    },
                    {
                        "adcode": "130421",
                        "name": "邯郸县"
                    },
                    {
                        "adcode": "130423",
                        "name": "临漳县"
                    },
                    {
                        "adcode": "130424",
                        "name": "成安县"
                    },
                    {
                        "adcode": "130425",
                        "name": "大名县"
                    },
                    {
                        "adcode": "130426",
                        "name": "涉县"
                    },
                    {
                        "adcode": "130427",
                        "name": "磁县"
                    },
                    {
                        "adcode": "130428",
                        "name": "肥乡县"
                    },
                    {
                        "adcode": "130429",
                        "name": "永年县"
                    },
                    {
                        "adcode": "130430",
                        "name": "邱县"
                    },
                    {
                        "adcode": "130431",
                        "name": "鸡泽县"
                    },
                    {
                        "adcode": "130432",
                        "name": "广平县"
                    },
                    {
                        "adcode": "130433",
                        "name": "馆陶县"
                    },
                    {
                        "adcode": "130434",
                        "name": "魏县"
                    },
                    {
                        "adcode": "130435",
                        "name": "曲周县"
                    },
                    {
                        "adcode": "130440",
                        "name": "开发区"
                    },
                    {
                        "adcode": "130441",
                        "name": "马头生态工业城"
                    },
                    {
                        "adcode": "130481",
                        "name": "武安市"
                    },
                    {
                        "adcode": "130401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "130408",
                        "name": "永年区"
                    },
                    {
                        "adcode": "130471",
                        "name": "邯郸经济技术开发区"
                    },
                    {
                        "adcode": "130407",
                        "name": "肥乡区"
                    },
                    {
                        "adcode": "130473",
                        "name": "邯郸冀南新区"
                    }
                ]
            },
            {
                "adcode": "1303",
                "name": "秦皇岛市",
                "s": [
                    {
                        "adcode": "130399",
                        "name": "秦皇岛市市本级"
                    },
                    {
                        "adcode": "130302",
                        "name": "海港区"
                    },
                    {
                        "adcode": "130303",
                        "name": "山海关区"
                    },
                    {
                        "adcode": "130304",
                        "name": "北戴河区"
                    },
                    {
                        "adcode": "130321",
                        "name": "青龙满族自治县"
                    },
                    {
                        "adcode": "130322",
                        "name": "昌黎县"
                    },
                    {
                        "adcode": "130323",
                        "name": "抚宁县"
                    },
                    {
                        "adcode": "130324",
                        "name": "卢龙县"
                    },
                    {
                        "adcode": "130340",
                        "name": "开发区"
                    },
                    {
                        "adcode": "130341",
                        "name": "北戴河新区"
                    },
                    {
                        "adcode": "130301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "130306",
                        "name": "抚宁区"
                    },
                    {
                        "adcode": "130371",
                        "name": "秦皇岛市经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "1302",
                "name": "唐山市",
                "s": [
                    {
                        "adcode": "130299",
                        "name": "唐山市市本级"
                    },
                    {
                        "adcode": "130202",
                        "name": "路南区"
                    },
                    {
                        "adcode": "130203",
                        "name": "路北区"
                    },
                    {
                        "adcode": "130204",
                        "name": "古冶区"
                    },
                    {
                        "adcode": "130205",
                        "name": "开平区"
                    },
                    {
                        "adcode": "130207",
                        "name": "丰南区"
                    },
                    {
                        "adcode": "130208",
                        "name": "丰润区"
                    },
                    {
                        "adcode": "130209",
                        "name": "曹妃甸区"
                    },
                    {
                        "adcode": "130223",
                        "name": "滦县"
                    },
                    {
                        "adcode": "130224",
                        "name": "滦南县"
                    },
                    {
                        "adcode": "130225",
                        "name": "乐亭县"
                    },
                    {
                        "adcode": "130227",
                        "name": "迁西县"
                    },
                    {
                        "adcode": "130229",
                        "name": "玉田县"
                    },
                    {
                        "adcode": "130230",
                        "name": "唐海县"
                    },
                    {
                        "adcode": "130240",
                        "name": "唐山高新技术开发区"
                    },
                    {
                        "adcode": "130241",
                        "name": "南堡开发区"
                    },
                    {
                        "adcode": "130242",
                        "name": "海港开发区"
                    },
                    {
                        "adcode": "130243",
                        "name": "芦台开发区"
                    },
                    {
                        "adcode": "130244",
                        "name": "汉沽开发区"
                    },
                    {
                        "adcode": "130245",
                        "name": "曹妃甸工业区"
                    },
                    {
                        "adcode": "130281",
                        "name": "遵化市"
                    },
                    {
                        "adcode": "130283",
                        "name": "迁安市"
                    },
                    {
                        "adcode": "130201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "130284",
                        "name": "滦州市"
                    },
                    {
                        "adcode": "130271",
                        "name": "唐山市芦台经济技术开发区"
                    },
                    {
                        "adcode": "130273",
                        "name": "唐山高新技术产业开发区"
                    },
                    {
                        "adcode": "130274",
                        "name": "河北唐山海港经济开发区"
                    }
                ]
            },
            {
                "adcode": "1301",
                "name": "石家庄市",
                "s": [
                    {
                        "adcode": "130199",
                        "name": "石家庄市市本级"
                    },
                    {
                        "adcode": "130102",
                        "name": "长安区"
                    },
                    {
                        "adcode": "130103",
                        "name": "桥东区"
                    },
                    {
                        "adcode": "130104",
                        "name": "桥西区"
                    },
                    {
                        "adcode": "130105",
                        "name": "新华区"
                    },
                    {
                        "adcode": "130107",
                        "name": "井陉矿区"
                    },
                    {
                        "adcode": "130108",
                        "name": "裕华区"
                    },
                    {
                        "adcode": "130121",
                        "name": "井陉县"
                    },
                    {
                        "adcode": "130123",
                        "name": "正定县"
                    },
                    {
                        "adcode": "130124",
                        "name": "栾城县"
                    },
                    {
                        "adcode": "130125",
                        "name": "行唐县"
                    },
                    {
                        "adcode": "130126",
                        "name": "灵寿县"
                    },
                    {
                        "adcode": "130127",
                        "name": "高邑县"
                    },
                    {
                        "adcode": "130128",
                        "name": "深泽县"
                    },
                    {
                        "adcode": "130129",
                        "name": "赞皇县"
                    },
                    {
                        "adcode": "130130",
                        "name": "无极县"
                    },
                    {
                        "adcode": "130131",
                        "name": "平山县"
                    },
                    {
                        "adcode": "130132",
                        "name": "元氏县"
                    },
                    {
                        "adcode": "130133",
                        "name": "赵县"
                    },
                    {
                        "adcode": "130140",
                        "name": "开发区"
                    },
                    {
                        "adcode": "130141",
                        "name": "正定新区"
                    },
                    {
                        "adcode": "130142",
                        "name": "石家庄循环化工园区"
                    },
                    {
                        "adcode": "130181",
                        "name": "辛集市"
                    },
                    {
                        "adcode": "130182",
                        "name": "藁城市"
                    },
                    {
                        "adcode": "130183",
                        "name": "晋州市"
                    },
                    {
                        "adcode": "130184",
                        "name": "新乐市"
                    },
                    {
                        "adcode": "130185",
                        "name": "鹿泉市"
                    },
                    {
                        "adcode": "130101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "130109",
                        "name": "藁城区"
                    },
                    {
                        "adcode": "130110",
                        "name": "鹿泉区"
                    },
                    {
                        "adcode": "130111",
                        "name": "栾城区"
                    },
                    {
                        "adcode": "130171",
                        "name": "石家庄高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "1311",
                "name": "衡水市",
                "s": [
                    {
                        "adcode": "131199",
                        "name": "衡水市市本级"
                    },
                    {
                        "adcode": "131102",
                        "name": "桃城区"
                    },
                    {
                        "adcode": "131121",
                        "name": "枣强县"
                    },
                    {
                        "adcode": "131122",
                        "name": "武邑县"
                    },
                    {
                        "adcode": "131123",
                        "name": "武强县"
                    },
                    {
                        "adcode": "131124",
                        "name": "饶阳县"
                    },
                    {
                        "adcode": "131125",
                        "name": "安平县"
                    },
                    {
                        "adcode": "131126",
                        "name": "故城县"
                    },
                    {
                        "adcode": "131127",
                        "name": "景县"
                    },
                    {
                        "adcode": "131128",
                        "name": "阜城县"
                    },
                    {
                        "adcode": "131140",
                        "name": "开发区"
                    },
                    {
                        "adcode": "131141",
                        "name": "滨湖新区"
                    },
                    {
                        "adcode": "131181",
                        "name": "冀州市"
                    },
                    {
                        "adcode": "131182",
                        "name": "深州市"
                    },
                    {
                        "adcode": "131101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "131103",
                        "name": "冀州区"
                    },
                    {
                        "adcode": "131172",
                        "name": "衡水滨湖新区"
                    }
                ]
            },
            {
                "adcode": "1310",
                "name": "廊坊市",
                "s": [
                    {
                        "adcode": "131099",
                        "name": "廊坊市市本级"
                    },
                    {
                        "adcode": "131002",
                        "name": "安次区"
                    },
                    {
                        "adcode": "131003",
                        "name": "广阳区"
                    },
                    {
                        "adcode": "131022",
                        "name": "固安县"
                    },
                    {
                        "adcode": "131023",
                        "name": "永清县"
                    },
                    {
                        "adcode": "131024",
                        "name": "香河县"
                    },
                    {
                        "adcode": "131025",
                        "name": "大城县"
                    },
                    {
                        "adcode": "131026",
                        "name": "文安县"
                    },
                    {
                        "adcode": "131028",
                        "name": "大厂回族自治县"
                    },
                    {
                        "adcode": "131040",
                        "name": "开发区"
                    },
                    {
                        "adcode": "131081",
                        "name": "霸州市"
                    },
                    {
                        "adcode": "131082",
                        "name": "三河市"
                    },
                    {
                        "adcode": "131001",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "131071",
                        "name": "廊坊经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "1309",
                "name": "沧州市",
                "s": [
                    {
                        "adcode": "130999",
                        "name": "沧州市市本级"
                    },
                    {
                        "adcode": "130902",
                        "name": "新华区"
                    },
                    {
                        "adcode": "130903",
                        "name": "运河区"
                    },
                    {
                        "adcode": "130921",
                        "name": "沧县"
                    },
                    {
                        "adcode": "130922",
                        "name": "青县"
                    },
                    {
                        "adcode": "130923",
                        "name": "东光县"
                    },
                    {
                        "adcode": "130924",
                        "name": "海兴县"
                    },
                    {
                        "adcode": "130925",
                        "name": "盐山县"
                    },
                    {
                        "adcode": "130926",
                        "name": "肃宁县"
                    },
                    {
                        "adcode": "130927",
                        "name": "南皮县"
                    },
                    {
                        "adcode": "130928",
                        "name": "吴桥县"
                    },
                    {
                        "adcode": "130929",
                        "name": "献县"
                    },
                    {
                        "adcode": "130930",
                        "name": "孟村回族自治县"
                    },
                    {
                        "adcode": "130940",
                        "name": "黄骅港开发区"
                    },
                    {
                        "adcode": "130941",
                        "name": "沧州临港经济技术开发区"
                    },
                    {
                        "adcode": "130942",
                        "name": "沧州市南大港管理区"
                    },
                    {
                        "adcode": "130943",
                        "name": "沧州经济技术开发区"
                    },
                    {
                        "adcode": "130944",
                        "name": "沧州高新技术产业开发区"
                    },
                    {
                        "adcode": "130981",
                        "name": "泊头市"
                    },
                    {
                        "adcode": "130982",
                        "name": "任丘市"
                    },
                    {
                        "adcode": "130983",
                        "name": "黄骅市"
                    },
                    {
                        "adcode": "130984",
                        "name": "河间市"
                    },
                    {
                        "adcode": "130901",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "130973",
                        "name": "沧州渤海新区"
                    },
                    {
                        "adcode": "130971",
                        "name": "河北沧州经济开发区"
                    }
                ]
            },
            {
                "adcode": "1308",
                "name": "承德市",
                "s": [
                    {
                        "adcode": "130899",
                        "name": "承德市市本级"
                    },
                    {
                        "adcode": "130802",
                        "name": "双桥区"
                    },
                    {
                        "adcode": "130803",
                        "name": "双滦区"
                    },
                    {
                        "adcode": "130804",
                        "name": "鹰手营子矿区"
                    },
                    {
                        "adcode": "130821",
                        "name": "承德县"
                    },
                    {
                        "adcode": "130822",
                        "name": "兴隆县"
                    },
                    {
                        "adcode": "130823",
                        "name": "平泉县"
                    },
                    {
                        "adcode": "130824",
                        "name": "滦平县"
                    },
                    {
                        "adcode": "130825",
                        "name": "隆化县"
                    },
                    {
                        "adcode": "130826",
                        "name": "丰宁满族自治县"
                    },
                    {
                        "adcode": "130827",
                        "name": "宽城满族自治县"
                    },
                    {
                        "adcode": "130828",
                        "name": "围场满族蒙古族自治县"
                    },
                    {
                        "adcode": "130840",
                        "name": "承德高新技术产业开发区"
                    },
                    {
                        "adcode": "130801",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "130881",
                        "name": "平泉市"
                    }
                ]
            },
            {
                "adcode": "1307",
                "name": "张家口市",
                "s": [
                    {
                        "adcode": "130799",
                        "name": "张家口市市本级"
                    },
                    {
                        "adcode": "130702",
                        "name": "桥东区"
                    },
                    {
                        "adcode": "130703",
                        "name": "桥西区"
                    },
                    {
                        "adcode": "130705",
                        "name": "宣化区"
                    },
                    {
                        "adcode": "130706",
                        "name": "下花园区"
                    },
                    {
                        "adcode": "130721",
                        "name": "宣化县"
                    },
                    {
                        "adcode": "130722",
                        "name": "张北县"
                    },
                    {
                        "adcode": "130723",
                        "name": "康保县"
                    },
                    {
                        "adcode": "130724",
                        "name": "沽源县"
                    },
                    {
                        "adcode": "130725",
                        "name": "尚义县"
                    },
                    {
                        "adcode": "130726",
                        "name": "蔚县"
                    },
                    {
                        "adcode": "130727",
                        "name": "阳原县"
                    },
                    {
                        "adcode": "130728",
                        "name": "怀安县"
                    },
                    {
                        "adcode": "130729",
                        "name": "万全县"
                    },
                    {
                        "adcode": "130730",
                        "name": "怀来县"
                    },
                    {
                        "adcode": "130731",
                        "name": "涿鹿县"
                    },
                    {
                        "adcode": "130732",
                        "name": "赤城县"
                    },
                    {
                        "adcode": "130733",
                        "name": "崇礼县"
                    },
                    {
                        "adcode": "130740",
                        "name": "高新区"
                    },
                    {
                        "adcode": "130741",
                        "name": "察北管理区"
                    },
                    {
                        "adcode": "130742",
                        "name": "塞北管理区"
                    },
                    {
                        "adcode": "130701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "130708",
                        "name": "万全区"
                    },
                    {
                        "adcode": "130709",
                        "name": "崇礼区"
                    }
                ]
            },
            {
                "adcode": "1306",
                "name": "保定市",
                "s": [
                    {
                        "adcode": "130699",
                        "name": "保定市市本级"
                    },
                    {
                        "adcode": "130602",
                        "name": "新市区"
                    },
                    {
                        "adcode": "130603",
                        "name": "北市区"
                    },
                    {
                        "adcode": "130604",
                        "name": "南市区"
                    },
                    {
                        "adcode": "130606",
                        "name": "莲池区"
                    },
                    {
                        "adcode": "130621",
                        "name": "满城县"
                    },
                    {
                        "adcode": "130622",
                        "name": "清苑县"
                    },
                    {
                        "adcode": "130623",
                        "name": "涞水县"
                    },
                    {
                        "adcode": "130624",
                        "name": "阜平县"
                    },
                    {
                        "adcode": "130625",
                        "name": "徐水县"
                    },
                    {
                        "adcode": "130626",
                        "name": "定兴县"
                    },
                    {
                        "adcode": "130627",
                        "name": "唐县"
                    },
                    {
                        "adcode": "130628",
                        "name": "高阳县"
                    },
                    {
                        "adcode": "130629",
                        "name": "容城县"
                    },
                    {
                        "adcode": "130630",
                        "name": "涞源县"
                    },
                    {
                        "adcode": "130631",
                        "name": "望都县"
                    },
                    {
                        "adcode": "130632",
                        "name": "安新县"
                    },
                    {
                        "adcode": "130633",
                        "name": "易县"
                    },
                    {
                        "adcode": "130634",
                        "name": "曲阳县"
                    },
                    {
                        "adcode": "130635",
                        "name": "蠡县"
                    },
                    {
                        "adcode": "130636",
                        "name": "顺平县"
                    },
                    {
                        "adcode": "130637",
                        "name": "博野县"
                    },
                    {
                        "adcode": "130638",
                        "name": "雄县"
                    },
                    {
                        "adcode": "130640",
                        "name": "白沟新城"
                    },
                    {
                        "adcode": "130641",
                        "name": "高新区"
                    },
                    {
                        "adcode": "130681",
                        "name": "涿州市"
                    },
                    {
                        "adcode": "130682",
                        "name": "定州市"
                    },
                    {
                        "adcode": "130683",
                        "name": "安国市"
                    },
                    {
                        "adcode": "130684",
                        "name": "高碑店市"
                    },
                    {
                        "adcode": "130601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "130672",
                        "name": "保定白沟新城"
                    },
                    {
                        "adcode": "130671",
                        "name": "保定高新技术产业开发区"
                    },
                    {
                        "adcode": "130609",
                        "name": "徐水区"
                    },
                    {
                        "adcode": "130608",
                        "name": "清苑区"
                    },
                    {
                        "adcode": "130607",
                        "name": "满城区"
                    },
                    {
                        "adcode": "130602",
                        "name": "竞秀区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "64",
        "name": "宁夏回族自治区",
        "s": [
            {
                "adcode": "6401",
                "name": "银川市",
                "s": [
                    {
                        "adcode": "640199",
                        "name": "银川市市本级"
                    },
                    {
                        "adcode": "640104",
                        "name": "兴庆区"
                    },
                    {
                        "adcode": "640105",
                        "name": "西夏区"
                    },
                    {
                        "adcode": "640106",
                        "name": "金凤区"
                    },
                    {
                        "adcode": "640121",
                        "name": "永宁县"
                    },
                    {
                        "adcode": "640122",
                        "name": "贺兰县"
                    },
                    {
                        "adcode": "640181",
                        "name": "灵武市"
                    },
                    {
                        "adcode": "640101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6403",
                "name": "吴忠市",
                "s": [
                    {
                        "adcode": "640399",
                        "name": "吴忠市市本级"
                    },
                    {
                        "adcode": "640302",
                        "name": "利通区"
                    },
                    {
                        "adcode": "640303",
                        "name": "红寺堡区"
                    },
                    {
                        "adcode": "640323",
                        "name": "盐池县"
                    },
                    {
                        "adcode": "640324",
                        "name": "同心县"
                    },
                    {
                        "adcode": "640381",
                        "name": "青铜峡市"
                    },
                    {
                        "adcode": "640340",
                        "name": "红寺堡开发区"
                    },
                    {
                        "adcode": "640301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6402",
                "name": "石嘴山市",
                "s": [
                    {
                        "adcode": "640299",
                        "name": "石嘴山市市本级"
                    },
                    {
                        "adcode": "640202",
                        "name": "大武口区"
                    },
                    {
                        "adcode": "640205",
                        "name": "惠农区"
                    },
                    {
                        "adcode": "640221",
                        "name": "平罗县"
                    },
                    {
                        "adcode": "640201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6405",
                "name": "中卫市",
                "s": [
                    {
                        "adcode": "640599",
                        "name": "中卫市市本级"
                    },
                    {
                        "adcode": "640502",
                        "name": "沙坡头区"
                    },
                    {
                        "adcode": "640521",
                        "name": "中宁县"
                    },
                    {
                        "adcode": "640522",
                        "name": "海原县"
                    },
                    {
                        "adcode": "640501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6404",
                "name": "固原市",
                "s": [
                    {
                        "adcode": "640499",
                        "name": "固原市市本级"
                    },
                    {
                        "adcode": "640402",
                        "name": "原州区"
                    },
                    {
                        "adcode": "640422",
                        "name": "西吉县"
                    },
                    {
                        "adcode": "640423",
                        "name": "隆德县"
                    },
                    {
                        "adcode": "640424",
                        "name": "泾源县"
                    },
                    {
                        "adcode": "640425",
                        "name": "彭阳县"
                    },
                    {
                        "adcode": "640401",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "22",
        "name": "吉林省",
        "s": [
            {
                "adcode": "2207",
                "name": "松原市",
                "s": [
                    {
                        "adcode": "220799",
                        "name": "松原市市本级"
                    },
                    {
                        "adcode": "220702",
                        "name": "宁江区"
                    },
                    {
                        "adcode": "220721",
                        "name": "前郭尔罗斯蒙古族自治县"
                    },
                    {
                        "adcode": "220722",
                        "name": "长岭县"
                    },
                    {
                        "adcode": "220723",
                        "name": "乾安县"
                    },
                    {
                        "adcode": "220724",
                        "name": "扶余县"
                    },
                    {
                        "adcode": "220701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "220781",
                        "name": "扶余市"
                    },
                    {
                        "adcode": "220771",
                        "name": "吉林松原经济开发区"
                    }
                ]
            },
            {
                "adcode": "2206",
                "name": "白山市",
                "s": [
                    {
                        "adcode": "220699",
                        "name": "白山市市本级"
                    },
                    {
                        "adcode": "220605",
                        "name": "江源区"
                    },
                    {
                        "adcode": "220621",
                        "name": "抚松县"
                    },
                    {
                        "adcode": "220622",
                        "name": "靖宇县"
                    },
                    {
                        "adcode": "220623",
                        "name": "长白朝鲜族自治县"
                    },
                    {
                        "adcode": "220681",
                        "name": "临江市"
                    },
                    {
                        "adcode": "220601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "220602",
                        "name": "浑江区"
                    }
                ]
            },
            {
                "adcode": "2205",
                "name": "通化市",
                "s": [
                    {
                        "adcode": "220599",
                        "name": "通化市市本级"
                    },
                    {
                        "adcode": "220502",
                        "name": "东昌区"
                    },
                    {
                        "adcode": "220503",
                        "name": "二道江区"
                    },
                    {
                        "adcode": "220521",
                        "name": "通化县"
                    },
                    {
                        "adcode": "220523",
                        "name": "辉南县"
                    },
                    {
                        "adcode": "220524",
                        "name": "柳河县"
                    },
                    {
                        "adcode": "220581",
                        "name": "梅河口市"
                    },
                    {
                        "adcode": "220582",
                        "name": "集安市"
                    },
                    {
                        "adcode": "220501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2204",
                "name": "辽源市",
                "s": [
                    {
                        "adcode": "220499",
                        "name": "辽源市市本级"
                    },
                    {
                        "adcode": "220402",
                        "name": "龙山区"
                    },
                    {
                        "adcode": "220403",
                        "name": "西安区"
                    },
                    {
                        "adcode": "220421",
                        "name": "东丰县"
                    },
                    {
                        "adcode": "220422",
                        "name": "东辽县"
                    },
                    {
                        "adcode": "220401",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2203",
                "name": "四平市",
                "s": [
                    {
                        "adcode": "220399",
                        "name": "四平市市本级"
                    },
                    {
                        "adcode": "220302",
                        "name": "铁西区"
                    },
                    {
                        "adcode": "220303",
                        "name": "铁东区"
                    },
                    {
                        "adcode": "220322",
                        "name": "梨树县"
                    },
                    {
                        "adcode": "220323",
                        "name": "伊通满族自治县"
                    },
                    {
                        "adcode": "220381",
                        "name": "公主岭市"
                    },
                    {
                        "adcode": "220382",
                        "name": "双辽市"
                    },
                    {
                        "adcode": "220301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2202",
                "name": "吉林市",
                "s": [
                    {
                        "adcode": "220299",
                        "name": "吉林市市本级"
                    },
                    {
                        "adcode": "220202",
                        "name": "昌邑区"
                    },
                    {
                        "adcode": "220203",
                        "name": "龙潭区"
                    },
                    {
                        "adcode": "220204",
                        "name": "船营区"
                    },
                    {
                        "adcode": "220211",
                        "name": "丰满区"
                    },
                    {
                        "adcode": "220221",
                        "name": "永吉县"
                    },
                    {
                        "adcode": "220281",
                        "name": "蛟河市"
                    },
                    {
                        "adcode": "220282",
                        "name": "桦甸市"
                    },
                    {
                        "adcode": "220283",
                        "name": "舒兰市"
                    },
                    {
                        "adcode": "220284",
                        "name": "磐石市"
                    },
                    {
                        "adcode": "220201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "220273",
                        "name": "吉林中国新加坡食品区"
                    }
                ]
            },
            {
                "adcode": "2224",
                "name": "延边朝鲜族自治州",
                "s": [
                    {
                        "adcode": "222499",
                        "name": "延边朝鲜族自治州州本级"
                    },
                    {
                        "adcode": "222401",
                        "name": "延吉市"
                    },
                    {
                        "adcode": "222402",
                        "name": "图们市"
                    },
                    {
                        "adcode": "222403",
                        "name": "敦化市"
                    },
                    {
                        "adcode": "222404",
                        "name": "珲春市"
                    },
                    {
                        "adcode": "222405",
                        "name": "龙井市"
                    },
                    {
                        "adcode": "222406",
                        "name": "和龙市"
                    },
                    {
                        "adcode": "222424",
                        "name": "汪清县"
                    },
                    {
                        "adcode": "222426",
                        "name": "安图县"
                    }
                ]
            },
            {
                "adcode": "2201",
                "name": "长春市",
                "s": [
                    {
                        "adcode": "220199",
                        "name": "长春市市本级"
                    },
                    {
                        "adcode": "220102",
                        "name": "南关区"
                    },
                    {
                        "adcode": "220103",
                        "name": "宽城区"
                    },
                    {
                        "adcode": "220104",
                        "name": "朝阳区"
                    },
                    {
                        "adcode": "220105",
                        "name": "二道区"
                    },
                    {
                        "adcode": "220106",
                        "name": "绿园区"
                    },
                    {
                        "adcode": "220112",
                        "name": "双阳区"
                    },
                    {
                        "adcode": "220122",
                        "name": "农安县"
                    },
                    {
                        "adcode": "220140",
                        "name": "开发区"
                    },
                    {
                        "adcode": "220181",
                        "name": "九台市"
                    },
                    {
                        "adcode": "220182",
                        "name": "榆树市"
                    },
                    {
                        "adcode": "220183",
                        "name": "德惠市"
                    },
                    {
                        "adcode": "220101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "220113",
                        "name": "九台区"
                    },
                    {
                        "adcode": "220174",
                        "name": "长春汽车经济技术开发区"
                    },
                    {
                        "adcode": "220172",
                        "name": "长春净月高新技术产业开发区"
                    },
                    {
                        "adcode": "220171",
                        "name": "长春经济技术开发区"
                    },
                    {
                        "adcode": "220173",
                        "name": "长春高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "2222",
                "name": "长白山管委会",
                "s": [
                    {
                        "adcode": "222299",
                        "name": "长白山管委会本级"
                    }
                ]
            },
            {
                "adcode": "2208",
                "name": "白城市",
                "s": [
                    {
                        "adcode": "220899",
                        "name": "白城市市本级"
                    },
                    {
                        "adcode": "220802",
                        "name": "洮北区"
                    },
                    {
                        "adcode": "220821",
                        "name": "镇赉县"
                    },
                    {
                        "adcode": "220822",
                        "name": "通榆县"
                    },
                    {
                        "adcode": "220881",
                        "name": "洮南市"
                    },
                    {
                        "adcode": "220882",
                        "name": "大安市"
                    },
                    {
                        "adcode": "220801",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "63",
        "name": "青海省",
        "s": [
            {
                "adcode": "6399",
                "name": "青海省省本级",
                "s": [
                    {
                        "adcode": "639901",
                        "name": "青海省省本级（省直）"
                    },
                    {
                        "adcode": "639903",
                        "name": "青海省省本级（三江集团）"
                    },
                    {
                        "adcode": "639904",
                        "name": "青海省省本级（监狱企业集团）"
                    }
                ]
            },
            {
                "adcode": "6322",
                "name": "海北藏族自治州",
                "s": [
                    {
                        "adcode": "632299",
                        "name": "海北藏族自治州州本级"
                    },
                    {
                        "adcode": "632221",
                        "name": "门源回族自治县"
                    },
                    {
                        "adcode": "632222",
                        "name": "祁连县"
                    },
                    {
                        "adcode": "632223",
                        "name": "海晏县"
                    },
                    {
                        "adcode": "632224",
                        "name": "刚察县"
                    }
                ]
            },
            {
                "adcode": "6321",
                "name": "海东地区",
                "s": [
                    {
                        "adcode": "632199",
                        "name": "海东地区本级"
                    },
                    {
                        "adcode": "632121",
                        "name": "平安县"
                    },
                    {
                        "adcode": "632122",
                        "name": "民和回族土族自治县"
                    },
                    {
                        "adcode": "632123",
                        "name": "乐都县"
                    },
                    {
                        "adcode": "632126",
                        "name": "互助土族自治县"
                    },
                    {
                        "adcode": "632127",
                        "name": "化隆回族自治县"
                    },
                    {
                        "adcode": "632128",
                        "name": "循化撒拉族自治县"
                    }
                ]
            },
            {
                "adcode": "6302",
                "name": "海东市",
                "s": [
                    {
                        "adcode": "630202",
                        "name": "乐都区"
                    },
                    {
                        "adcode": "630221",
                        "name": "平安县"
                    },
                    {
                        "adcode": "630222",
                        "name": "民和回族土族自治县"
                    },
                    {
                        "adcode": "630223",
                        "name": "互助土族自治县"
                    },
                    {
                        "adcode": "630224",
                        "name": "化隆回族自治县"
                    },
                    {
                        "adcode": "630225",
                        "name": "循化撒拉族自治县"
                    },
                    {
                        "adcode": "630203",
                        "name": "平安区"
                    }
                ]
            },
            {
                "adcode": "6301",
                "name": "西宁市",
                "s": [
                    {
                        "adcode": "630199",
                        "name": "西宁市市本级"
                    },
                    {
                        "adcode": "630102",
                        "name": "城东区"
                    },
                    {
                        "adcode": "630103",
                        "name": "城中区"
                    },
                    {
                        "adcode": "630104",
                        "name": "城西区"
                    },
                    {
                        "adcode": "630105",
                        "name": "城北区"
                    },
                    {
                        "adcode": "630121",
                        "name": "大通回族土族自治县"
                    },
                    {
                        "adcode": "630122",
                        "name": "湟中县"
                    },
                    {
                        "adcode": "630123",
                        "name": "湟源县"
                    },
                    {
                        "adcode": "630101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6323",
                "name": "黄南藏族自治州",
                "s": [
                    {
                        "adcode": "632399",
                        "name": "黄南藏族自治州州本级"
                    },
                    {
                        "adcode": "632321",
                        "name": "同仁县"
                    },
                    {
                        "adcode": "632322",
                        "name": "尖扎县"
                    },
                    {
                        "adcode": "632323",
                        "name": "泽库县"
                    },
                    {
                        "adcode": "632324",
                        "name": "河南蒙古族自治县"
                    },
                    {
                        "adcode": "632340",
                        "name": "李家峡"
                    }
                ]
            },
            {
                "adcode": "6326",
                "name": "果洛藏族自治州",
                "s": [
                    {
                        "adcode": "632699",
                        "name": "果洛藏族自治州州本级"
                    },
                    {
                        "adcode": "632621",
                        "name": "玛沁县"
                    },
                    {
                        "adcode": "632622",
                        "name": "班玛县"
                    },
                    {
                        "adcode": "632623",
                        "name": "甘德县"
                    },
                    {
                        "adcode": "632624",
                        "name": "达日县"
                    },
                    {
                        "adcode": "632625",
                        "name": "久治县"
                    },
                    {
                        "adcode": "632626",
                        "name": "玛多县"
                    }
                ]
            },
            {
                "adcode": "6325",
                "name": "海南藏族自治州",
                "s": [
                    {
                        "adcode": "632599",
                        "name": "海南藏族自治州州本级"
                    },
                    {
                        "adcode": "632521",
                        "name": "共和县"
                    },
                    {
                        "adcode": "632522",
                        "name": "同德县"
                    },
                    {
                        "adcode": "632523",
                        "name": "贵德县"
                    },
                    {
                        "adcode": "632524",
                        "name": "兴海县"
                    },
                    {
                        "adcode": "632525",
                        "name": "贵南县"
                    },
                    {
                        "adcode": "632540",
                        "name": "龙羊峡"
                    }
                ]
            },
            {
                "adcode": "6328",
                "name": "海西蒙古族藏族自治州",
                "s": [
                    {
                        "adcode": "632899",
                        "name": "海西蒙古族藏族自治州州本级"
                    },
                    {
                        "adcode": "632801",
                        "name": "格尔木市"
                    },
                    {
                        "adcode": "632802",
                        "name": "德令哈市"
                    },
                    {
                        "adcode": "632821",
                        "name": "乌兰县"
                    },
                    {
                        "adcode": "632822",
                        "name": "都兰县"
                    },
                    {
                        "adcode": "632823",
                        "name": "天峻县"
                    },
                    {
                        "adcode": "632840",
                        "name": "茫崖行委"
                    },
                    {
                        "adcode": "632841",
                        "name": "大柴旦行委"
                    },
                    {
                        "adcode": "632842",
                        "name": "冷湖行委"
                    },
                    {
                        "adcode": "632843",
                        "name": "省石油管理局"
                    },
                    {
                        "adcode": "632857",
                        "name": "大柴旦行政委员会"
                    },
                    {
                        "adcode": "632803",
                        "name": "茫崖市"
                    }
                ]
            },
            {
                "adcode": "6327",
                "name": "玉树藏族自治州",
                "s": [
                    {
                        "adcode": "632799",
                        "name": "玉树藏族自治州州本级"
                    },
                    {
                        "adcode": "632721",
                        "name": "玉树县"
                    },
                    {
                        "adcode": "632722",
                        "name": "杂多县"
                    },
                    {
                        "adcode": "632723",
                        "name": "称多县"
                    },
                    {
                        "adcode": "632724",
                        "name": "治多县"
                    },
                    {
                        "adcode": "632725",
                        "name": "囊谦县"
                    },
                    {
                        "adcode": "632726",
                        "name": "曲麻莱县"
                    },
                    {
                        "adcode": "632701",
                        "name": "玉树市"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "15",
        "name": "内蒙古自治区",
        "s": [
            {
                "adcode": "1503",
                "name": "乌海市",
                "s": [
                    {
                        "adcode": "150399",
                        "name": "乌海市市本级"
                    },
                    {
                        "adcode": "150302",
                        "name": "海勃湾区"
                    },
                    {
                        "adcode": "150303",
                        "name": "海南区"
                    },
                    {
                        "adcode": "150304",
                        "name": "乌达区"
                    },
                    {
                        "adcode": "150301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "1525",
                "name": "锡林郭勒盟",
                "s": [
                    {
                        "adcode": "152599",
                        "name": "锡林郭勒盟盟本级"
                    },
                    {
                        "adcode": "152501",
                        "name": "二连浩特市"
                    },
                    {
                        "adcode": "152502",
                        "name": "锡林浩特市"
                    },
                    {
                        "adcode": "152522",
                        "name": "阿巴嘎旗"
                    },
                    {
                        "adcode": "152523",
                        "name": "苏尼特左旗"
                    },
                    {
                        "adcode": "152524",
                        "name": "苏尼特右旗"
                    },
                    {
                        "adcode": "152525",
                        "name": "东乌珠穆沁旗"
                    },
                    {
                        "adcode": "152526",
                        "name": "西乌珠穆沁旗"
                    },
                    {
                        "adcode": "152527",
                        "name": "太仆寺旗"
                    },
                    {
                        "adcode": "152528",
                        "name": "镶黄旗"
                    },
                    {
                        "adcode": "152529",
                        "name": "正镶白旗"
                    },
                    {
                        "adcode": "152530",
                        "name": "正蓝旗"
                    },
                    {
                        "adcode": "152531",
                        "name": "多伦县"
                    },
                    {
                        "adcode": "152540",
                        "name": "乌拉盖开发区"
                    }
                ]
            },
            {
                "adcode": "1502",
                "name": "包头市",
                "s": [
                    {
                        "adcode": "150299",
                        "name": "包头市市本级"
                    },
                    {
                        "adcode": "150202",
                        "name": "东河区"
                    },
                    {
                        "adcode": "150203",
                        "name": "昆都仑区"
                    },
                    {
                        "adcode": "150204",
                        "name": "青山区"
                    },
                    {
                        "adcode": "150205",
                        "name": "石拐区"
                    },
                    {
                        "adcode": "150206",
                        "name": "白云鄂博矿区"
                    },
                    {
                        "adcode": "150207",
                        "name": "九原区"
                    },
                    {
                        "adcode": "150221",
                        "name": "土默特右旗"
                    },
                    {
                        "adcode": "150222",
                        "name": "固阳县"
                    },
                    {
                        "adcode": "150223",
                        "name": "达尔罕茂明安联合旗"
                    },
                    {
                        "adcode": "150240",
                        "name": "稀土高新技术产业开发区"
                    },
                    {
                        "adcode": "150201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "150271",
                        "name": "包头稀土高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "1501",
                "name": "呼和浩特市",
                "s": [
                    {
                        "adcode": "150199",
                        "name": "呼和浩特市市本级"
                    },
                    {
                        "adcode": "150102",
                        "name": "新城区"
                    },
                    {
                        "adcode": "150103",
                        "name": "回民区"
                    },
                    {
                        "adcode": "150104",
                        "name": "玉泉区"
                    },
                    {
                        "adcode": "150105",
                        "name": "赛罕区"
                    },
                    {
                        "adcode": "150121",
                        "name": "土默特左旗"
                    },
                    {
                        "adcode": "150122",
                        "name": "托克托县"
                    },
                    {
                        "adcode": "150123",
                        "name": "和林格尔县"
                    },
                    {
                        "adcode": "150124",
                        "name": "清水河县"
                    },
                    {
                        "adcode": "150125",
                        "name": "武川县"
                    },
                    {
                        "adcode": "150101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "150172",
                        "name": "呼和浩特经济技术开发区"
                    },
                    {
                        "adcode": "150171",
                        "name": "呼和浩特金海工业园区"
                    }
                ]
            },
            {
                "adcode": "1599",
                "name": "内蒙古自治区区本级",
                "s": [
                    {
                        "adcode": "159901",
                        "name": "内蒙古自治区区本级（区直）"
                    },
                    {
                        "adcode": "159903",
                        "name": "内蒙古自治区区本级（森工集团）"
                    },
                    {
                        "adcode": "159904",
                        "name": "内蒙古自治区区本级（煤炭）"
                    }
                ]
            },
            {
                "adcode": "1522",
                "name": "兴安盟",
                "s": [
                    {
                        "adcode": "152299",
                        "name": "兴安盟盟本级"
                    },
                    {
                        "adcode": "152201",
                        "name": "乌兰浩特市"
                    },
                    {
                        "adcode": "152202",
                        "name": "阿尔山市"
                    },
                    {
                        "adcode": "152221",
                        "name": "科尔沁右翼前旗"
                    },
                    {
                        "adcode": "152222",
                        "name": "科尔沁右翼中旗"
                    },
                    {
                        "adcode": "152223",
                        "name": "扎赉特旗"
                    },
                    {
                        "adcode": "152224",
                        "name": "突泉县"
                    }
                ]
            },
            {
                "adcode": "1531",
                "name": "二连浩特市",
                "s": [
                    {
                        "adcode": "153199",
                        "name": "二连浩特市市本级"
                    }
                ]
            },
            {
                "adcode": "1530",
                "name": "满洲里市",
                "s": [
                    {
                        "adcode": "153099",
                        "name": "满洲里市市本级"
                    }
                ]
            },
            {
                "adcode": "1509",
                "name": "乌兰察布市",
                "s": [
                    {
                        "adcode": "150999",
                        "name": "乌兰察布市市本级"
                    },
                    {
                        "adcode": "150902",
                        "name": "集宁区"
                    },
                    {
                        "adcode": "150921",
                        "name": "卓资县"
                    },
                    {
                        "adcode": "150922",
                        "name": "化德县"
                    },
                    {
                        "adcode": "150923",
                        "name": "商都县"
                    },
                    {
                        "adcode": "150924",
                        "name": "兴和县"
                    },
                    {
                        "adcode": "150925",
                        "name": "凉城县"
                    },
                    {
                        "adcode": "150926",
                        "name": "察哈尔右翼前旗"
                    },
                    {
                        "adcode": "150927",
                        "name": "察哈尔右翼中旗"
                    },
                    {
                        "adcode": "150928",
                        "name": "察哈尔右翼后旗"
                    },
                    {
                        "adcode": "150929",
                        "name": "四子王旗"
                    },
                    {
                        "adcode": "150940",
                        "name": "察哈尔工业园区"
                    },
                    {
                        "adcode": "150981",
                        "name": "丰镇市"
                    },
                    {
                        "adcode": "150901",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "1508",
                "name": "巴彦淖尔市",
                "s": [
                    {
                        "adcode": "150899",
                        "name": "巴彦淖尔市市本级"
                    },
                    {
                        "adcode": "150802",
                        "name": "临河区"
                    },
                    {
                        "adcode": "150821",
                        "name": "五原县"
                    },
                    {
                        "adcode": "150822",
                        "name": "磴口县"
                    },
                    {
                        "adcode": "150823",
                        "name": "乌拉特前旗"
                    },
                    {
                        "adcode": "150824",
                        "name": "乌拉特中旗"
                    },
                    {
                        "adcode": "150825",
                        "name": "乌拉特后旗"
                    },
                    {
                        "adcode": "150826",
                        "name": "杭锦后旗"
                    },
                    {
                        "adcode": "150801",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "1507",
                "name": "呼伦贝尔市",
                "s": [
                    {
                        "adcode": "150799",
                        "name": "呼伦贝尔市市本级"
                    },
                    {
                        "adcode": "150702",
                        "name": "海拉尔区"
                    },
                    {
                        "adcode": "150721",
                        "name": "阿荣旗"
                    },
                    {
                        "adcode": "150722",
                        "name": "莫力达瓦达斡尔族自治旗"
                    },
                    {
                        "adcode": "150723",
                        "name": "鄂伦春自治旗"
                    },
                    {
                        "adcode": "150724",
                        "name": "鄂温克族自治旗"
                    },
                    {
                        "adcode": "150725",
                        "name": "陈巴尔虎旗"
                    },
                    {
                        "adcode": "150726",
                        "name": "新巴尔虎左旗"
                    },
                    {
                        "adcode": "150727",
                        "name": "新巴尔虎右旗"
                    },
                    {
                        "adcode": "150740",
                        "name": "海拉尔农牧场"
                    },
                    {
                        "adcode": "150741",
                        "name": "大兴安岭农牧场"
                    },
                    {
                        "adcode": "150781",
                        "name": "满洲里市"
                    },
                    {
                        "adcode": "150782",
                        "name": "牙克石市"
                    },
                    {
                        "adcode": "150783",
                        "name": "扎兰屯市"
                    },
                    {
                        "adcode": "150784",
                        "name": "额尔古纳市"
                    },
                    {
                        "adcode": "150785",
                        "name": "根河市"
                    },
                    {
                        "adcode": "150701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "150703",
                        "name": "扎赉诺尔区"
                    }
                ]
            },
            {
                "adcode": "1529",
                "name": "阿拉善盟",
                "s": [
                    {
                        "adcode": "152999",
                        "name": "阿拉善盟盟本级"
                    },
                    {
                        "adcode": "152921",
                        "name": "阿拉善左旗"
                    },
                    {
                        "adcode": "152922",
                        "name": "阿拉善右旗"
                    },
                    {
                        "adcode": "152923",
                        "name": "额济纳旗"
                    },
                    {
                        "adcode": "152940",
                        "name": "阿拉善经济开发区"
                    },
                    {
                        "adcode": "152941",
                        "name": "腾格里经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "1506",
                "name": "鄂尔多斯市",
                "s": [
                    {
                        "adcode": "150699",
                        "name": "鄂尔多斯市市本级"
                    },
                    {
                        "adcode": "150602",
                        "name": "东胜区"
                    },
                    {
                        "adcode": "150621",
                        "name": "达拉特旗"
                    },
                    {
                        "adcode": "150622",
                        "name": "准格尔旗"
                    },
                    {
                        "adcode": "150623",
                        "name": "鄂托克前旗"
                    },
                    {
                        "adcode": "150624",
                        "name": "鄂托克旗"
                    },
                    {
                        "adcode": "150625",
                        "name": "杭锦旗"
                    },
                    {
                        "adcode": "150626",
                        "name": "乌审旗"
                    },
                    {
                        "adcode": "150627",
                        "name": "伊金霍洛旗"
                    },
                    {
                        "adcode": "150640",
                        "name": "康巴什新区"
                    },
                    {
                        "adcode": "150601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "150603",
                        "name": "康巴什区"
                    }
                ]
            },
            {
                "adcode": "1505",
                "name": "通辽市",
                "s": [
                    {
                        "adcode": "150599",
                        "name": "通辽市市本级"
                    },
                    {
                        "adcode": "150502",
                        "name": "科尔沁区"
                    },
                    {
                        "adcode": "150521",
                        "name": "科尔沁左翼中旗"
                    },
                    {
                        "adcode": "150522",
                        "name": "科尔沁左翼后旗"
                    },
                    {
                        "adcode": "150523",
                        "name": "开鲁县"
                    },
                    {
                        "adcode": "150524",
                        "name": "库伦旗"
                    },
                    {
                        "adcode": "150525",
                        "name": "奈曼旗"
                    },
                    {
                        "adcode": "150526",
                        "name": "扎鲁特旗"
                    },
                    {
                        "adcode": "150581",
                        "name": "霍林郭勒市"
                    },
                    {
                        "adcode": "150501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "1504",
                "name": "赤峰市",
                "s": [
                    {
                        "adcode": "150499",
                        "name": "赤峰市市本级"
                    },
                    {
                        "adcode": "150402",
                        "name": "红山区"
                    },
                    {
                        "adcode": "150403",
                        "name": "元宝山区"
                    },
                    {
                        "adcode": "150404",
                        "name": "松山区"
                    },
                    {
                        "adcode": "150421",
                        "name": "阿鲁科尔沁旗"
                    },
                    {
                        "adcode": "150422",
                        "name": "巴林左旗"
                    },
                    {
                        "adcode": "150423",
                        "name": "巴林右旗"
                    },
                    {
                        "adcode": "150424",
                        "name": "林西县"
                    },
                    {
                        "adcode": "150425",
                        "name": "克什克腾旗"
                    },
                    {
                        "adcode": "150426",
                        "name": "翁牛特旗"
                    },
                    {
                        "adcode": "150428",
                        "name": "喀喇沁旗"
                    },
                    {
                        "adcode": "150429",
                        "name": "宁城县"
                    },
                    {
                        "adcode": "150430",
                        "name": "敖汉旗"
                    },
                    {
                        "adcode": "150401",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "65",
        "name": "新疆维吾尔自治区",
        "s": [
            {
                "adcode": "6540",
                "name": "伊犁哈萨克自治州",
                "s": [
                    {
                        "adcode": "654099",
                        "name": "伊犁哈萨克自治州州本级"
                    },
                    {
                        "adcode": "654002",
                        "name": "伊宁市"
                    },
                    {
                        "adcode": "654003",
                        "name": "奎屯市"
                    },
                    {
                        "adcode": "654021",
                        "name": "伊宁县"
                    },
                    {
                        "adcode": "654022",
                        "name": "察布查尔锡伯自治县"
                    },
                    {
                        "adcode": "654023",
                        "name": "霍城县"
                    },
                    {
                        "adcode": "654024",
                        "name": "巩留县"
                    },
                    {
                        "adcode": "654025",
                        "name": "新源县"
                    },
                    {
                        "adcode": "654026",
                        "name": "昭苏县"
                    },
                    {
                        "adcode": "654027",
                        "name": "特克斯县"
                    },
                    {
                        "adcode": "654028",
                        "name": "尼勒克县"
                    },
                    {
                        "adcode": "654040",
                        "name": "霍尔果斯特殊经济开发区"
                    },
                    {
                        "adcode": "654004",
                        "name": "霍尔果斯市"
                    }
                ]
            },
            {
                "adcode": "6531",
                "name": "喀什地区",
                "s": [
                    {
                        "adcode": "653199",
                        "name": "喀什地区本级"
                    },
                    {
                        "adcode": "653101",
                        "name": "喀什市"
                    },
                    {
                        "adcode": "653121",
                        "name": "疏附县"
                    },
                    {
                        "adcode": "653122",
                        "name": "疏勒县"
                    },
                    {
                        "adcode": "653123",
                        "name": "英吉沙县"
                    },
                    {
                        "adcode": "653124",
                        "name": "泽普县"
                    },
                    {
                        "adcode": "653125",
                        "name": "莎车县"
                    },
                    {
                        "adcode": "653126",
                        "name": "叶城县"
                    },
                    {
                        "adcode": "653127",
                        "name": "麦盖提县"
                    },
                    {
                        "adcode": "653128",
                        "name": "岳普湖县"
                    },
                    {
                        "adcode": "653129",
                        "name": "伽师县"
                    },
                    {
                        "adcode": "653130",
                        "name": "巴楚县"
                    },
                    {
                        "adcode": "653131",
                        "name": "塔什库尔干塔吉克自治县"
                    }
                ]
            },
            {
                "adcode": "6542",
                "name": "塔城地区",
                "s": [
                    {
                        "adcode": "654299",
                        "name": "塔城地区本级"
                    },
                    {
                        "adcode": "654201",
                        "name": "塔城市"
                    },
                    {
                        "adcode": "654202",
                        "name": "乌苏市"
                    },
                    {
                        "adcode": "654221",
                        "name": "额敏县"
                    },
                    {
                        "adcode": "654223",
                        "name": "沙湾县"
                    },
                    {
                        "adcode": "654224",
                        "name": "托里县"
                    },
                    {
                        "adcode": "654225",
                        "name": "裕民县"
                    },
                    {
                        "adcode": "654226",
                        "name": "和布克赛尔蒙古自治县"
                    }
                ]
            },
            {
                "adcode": "6530",
                "name": "克孜勒苏柯尔克孜自治州",
                "s": [
                    {
                        "adcode": "653099",
                        "name": "克孜勒苏柯尔克孜自治州州本级"
                    },
                    {
                        "adcode": "653001",
                        "name": "阿图什市"
                    },
                    {
                        "adcode": "653022",
                        "name": "阿克陶县"
                    },
                    {
                        "adcode": "653023",
                        "name": "阿合奇县"
                    },
                    {
                        "adcode": "653024",
                        "name": "乌恰县"
                    }
                ]
            },
            {
                "adcode": "6599",
                "name": "新疆维吾尔自治区区本级",
                "s": [
                    {
                        "adcode": "659901",
                        "name": "新疆维吾尔自治区区本级（区直）"
                    },
                    {
                        "adcode": "659903",
                        "name": "乌鲁木齐铁路局"
                    },
                    {
                        "adcode": "659904",
                        "name": "新疆油田公司"
                    },
                    {
                        "adcode": "659905",
                        "name": "塔里木油田公司"
                    },
                    {
                        "adcode": "659906",
                        "name": "吐哈油田公司"
                    }
                ]
            },
            {
                "adcode": "6522",
                "name": "哈密地区",
                "s": [
                    {
                        "adcode": "652299",
                        "name": "哈密地区本级"
                    },
                    {
                        "adcode": "652201",
                        "name": "哈密市"
                    },
                    {
                        "adcode": "652222",
                        "name": "巴里坤哈萨克自治县"
                    },
                    {
                        "adcode": "652223",
                        "name": "伊吾县"
                    }
                ]
            },
            {
                "adcode": "6521",
                "name": "吐鲁番地区",
                "s": [
                    {
                        "adcode": "652199",
                        "name": "吐鲁番地区本级"
                    },
                    {
                        "adcode": "652101",
                        "name": "吐鲁番市"
                    },
                    {
                        "adcode": "652122",
                        "name": "鄯善县"
                    },
                    {
                        "adcode": "652123",
                        "name": "托克逊县"
                    }
                ]
            },
            {
                "adcode": "6532",
                "name": "和田地区",
                "s": [
                    {
                        "adcode": "653299",
                        "name": "和田地区本级"
                    },
                    {
                        "adcode": "653201",
                        "name": "和田市"
                    },
                    {
                        "adcode": "653221",
                        "name": "和田县"
                    },
                    {
                        "adcode": "653222",
                        "name": "墨玉县"
                    },
                    {
                        "adcode": "653223",
                        "name": "皮山县"
                    },
                    {
                        "adcode": "653224",
                        "name": "洛浦县"
                    },
                    {
                        "adcode": "653225",
                        "name": "策勒县"
                    },
                    {
                        "adcode": "653226",
                        "name": "于田县"
                    },
                    {
                        "adcode": "653227",
                        "name": "民丰县"
                    }
                ]
            },
            {
                "adcode": "6543",
                "name": "阿勒泰地区",
                "s": [
                    {
                        "adcode": "654399",
                        "name": "阿勒泰地区本级"
                    },
                    {
                        "adcode": "654301",
                        "name": "阿勒泰市"
                    },
                    {
                        "adcode": "654321",
                        "name": "布尔津县"
                    },
                    {
                        "adcode": "654322",
                        "name": "富蕴县"
                    },
                    {
                        "adcode": "654323",
                        "name": "福海县"
                    },
                    {
                        "adcode": "654324",
                        "name": "哈巴河县"
                    },
                    {
                        "adcode": "654325",
                        "name": "青河县"
                    },
                    {
                        "adcode": "654326",
                        "name": "吉木乃县"
                    }
                ]
            },
            {
                "adcode": "6590",
                "name": "自治区直辖县级行政单位",
                "s": [
                    {
                        "adcode": "659002",
                        "name": "阿拉尔市"
                    },
                    {
                        "adcode": "659003",
                        "name": "图木舒克市"
                    },
                    {
                        "adcode": "659004",
                        "name": "五家渠市"
                    },
                    {
                        "adcode": "659001",
                        "name": "石河子市"
                    },
                    {
                        "adcode": "659004",
                        "name": "五家渠市"
                    },
                    {
                        "adcode": "659003",
                        "name": "图木舒克市"
                    },
                    {
                        "adcode": "659002",
                        "name": "阿拉尔市"
                    }
                ]
            },
            {
                "adcode": "6502",
                "name": "克拉玛依市",
                "s": [
                    {
                        "adcode": "650299",
                        "name": "克拉玛依市市本级"
                    },
                    {
                        "adcode": "650202",
                        "name": "独山子区"
                    },
                    {
                        "adcode": "650203",
                        "name": "克拉玛依区"
                    },
                    {
                        "adcode": "650204",
                        "name": "白碱滩区"
                    },
                    {
                        "adcode": "650205",
                        "name": "乌尔禾区"
                    },
                    {
                        "adcode": "650201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6501",
                "name": "乌鲁木齐市",
                "s": [
                    {
                        "adcode": "650199",
                        "name": "乌鲁木齐市市本级"
                    },
                    {
                        "adcode": "650102",
                        "name": "天山区"
                    },
                    {
                        "adcode": "650103",
                        "name": "沙依巴克区"
                    },
                    {
                        "adcode": "650104",
                        "name": "新市区"
                    },
                    {
                        "adcode": "650105",
                        "name": "水磨沟区"
                    },
                    {
                        "adcode": "650106",
                        "name": "头屯河区"
                    },
                    {
                        "adcode": "650107",
                        "name": "达坂城区"
                    },
                    {
                        "adcode": "650109",
                        "name": "米东区"
                    },
                    {
                        "adcode": "650121",
                        "name": "乌鲁木齐县"
                    },
                    {
                        "adcode": "650140",
                        "name": "经济技术开发区"
                    },
                    {
                        "adcode": "650101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "650171",
                        "name": "乌鲁木齐经济技术开发区"
                    },
                    {
                        "adcode": "650172",
                        "name": "乌鲁木齐高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "6523",
                "name": "昌吉回族自治州",
                "s": [
                    {
                        "adcode": "652399",
                        "name": "昌吉回族自治州州本级"
                    },
                    {
                        "adcode": "652301",
                        "name": "昌吉市"
                    },
                    {
                        "adcode": "652302",
                        "name": "阜康市"
                    },
                    {
                        "adcode": "652323",
                        "name": "呼图壁县"
                    },
                    {
                        "adcode": "652324",
                        "name": "玛纳斯县"
                    },
                    {
                        "adcode": "652325",
                        "name": "奇台县"
                    },
                    {
                        "adcode": "652327",
                        "name": "吉木萨尔县"
                    },
                    {
                        "adcode": "652328",
                        "name": "木垒哈萨克自治县"
                    }
                ]
            },
            {
                "adcode": "6504",
                "name": "吐鲁番市",
                "s": [
                    {
                        "adcode": "650422",
                        "name": "托克逊县"
                    },
                    {
                        "adcode": "650421",
                        "name": "鄯善县"
                    },
                    {
                        "adcode": "650402",
                        "name": "高昌区"
                    }
                ]
            },
            {
                "adcode": "6528",
                "name": "巴音郭楞蒙古自治州",
                "s": [
                    {
                        "adcode": "652899",
                        "name": "巴音郭楞蒙古自治州州本级"
                    },
                    {
                        "adcode": "652801",
                        "name": "库尔勒市"
                    },
                    {
                        "adcode": "652822",
                        "name": "轮台县"
                    },
                    {
                        "adcode": "652823",
                        "name": "尉犁县"
                    },
                    {
                        "adcode": "652824",
                        "name": "若羌县"
                    },
                    {
                        "adcode": "652825",
                        "name": "且末县"
                    },
                    {
                        "adcode": "652826",
                        "name": "焉耆回族自治县"
                    },
                    {
                        "adcode": "652827",
                        "name": "和静县"
                    },
                    {
                        "adcode": "652828",
                        "name": "和硕县"
                    },
                    {
                        "adcode": "652829",
                        "name": "博湖县"
                    },
                    {
                        "adcode": "652840",
                        "name": "库尔勒经济开发区"
                    }
                ]
            },
            {
                "adcode": "6527",
                "name": "博尔塔拉蒙古自治州",
                "s": [
                    {
                        "adcode": "652799",
                        "name": "博尔塔拉蒙古自治州州本级"
                    },
                    {
                        "adcode": "652701",
                        "name": "博乐市"
                    },
                    {
                        "adcode": "652702",
                        "name": "阿拉山口市"
                    },
                    {
                        "adcode": "652722",
                        "name": "精河县"
                    },
                    {
                        "adcode": "652723",
                        "name": "温泉县"
                    }
                ]
            },
            {
                "adcode": "6505",
                "name": "哈密市",
                "s": [
                    {
                        "adcode": "650522",
                        "name": "伊吾县"
                    },
                    {
                        "adcode": "650502",
                        "name": "伊州区"
                    },
                    {
                        "adcode": "650521",
                        "name": "巴里坤哈萨克自治县"
                    }
                ]
            },
            {
                "adcode": "6529",
                "name": "阿克苏地区",
                "s": [
                    {
                        "adcode": "652999",
                        "name": "阿克苏地区本级"
                    },
                    {
                        "adcode": "652901",
                        "name": "阿克苏市"
                    },
                    {
                        "adcode": "652922",
                        "name": "温宿县"
                    },
                    {
                        "adcode": "652923",
                        "name": "库车县"
                    },
                    {
                        "adcode": "652924",
                        "name": "沙雅县"
                    },
                    {
                        "adcode": "652925",
                        "name": "新和县"
                    },
                    {
                        "adcode": "652926",
                        "name": "拜城县"
                    },
                    {
                        "adcode": "652927",
                        "name": "乌什县"
                    },
                    {
                        "adcode": "652928",
                        "name": "阿瓦提县"
                    },
                    {
                        "adcode": "652929",
                        "name": "柯坪县"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "43",
        "name": "湖南省",
        "s": [
            {
                "adcode": "4331",
                "name": "湘西土家族苗族自治州",
                "s": [
                    {
                        "adcode": "433199",
                        "name": "湘西土家族苗族自治州州本级"
                    },
                    {
                        "adcode": "433101",
                        "name": "吉首市"
                    },
                    {
                        "adcode": "433122",
                        "name": "泸溪县"
                    },
                    {
                        "adcode": "433123",
                        "name": "凤凰县"
                    },
                    {
                        "adcode": "433124",
                        "name": "花垣县"
                    },
                    {
                        "adcode": "433125",
                        "name": "保靖县"
                    },
                    {
                        "adcode": "433126",
                        "name": "古丈县"
                    },
                    {
                        "adcode": "433127",
                        "name": "永顺县"
                    },
                    {
                        "adcode": "433130",
                        "name": "龙山县"
                    }
                ]
            },
            {
                "adcode": "4310",
                "name": "郴州市",
                "s": [
                    {
                        "adcode": "431099",
                        "name": "郴州市市本级"
                    },
                    {
                        "adcode": "431002",
                        "name": "北湖区"
                    },
                    {
                        "adcode": "431003",
                        "name": "苏仙区"
                    },
                    {
                        "adcode": "431021",
                        "name": "桂阳县"
                    },
                    {
                        "adcode": "431022",
                        "name": "宜章县"
                    },
                    {
                        "adcode": "431023",
                        "name": "永兴县"
                    },
                    {
                        "adcode": "431024",
                        "name": "嘉禾县"
                    },
                    {
                        "adcode": "431025",
                        "name": "临武县"
                    },
                    {
                        "adcode": "431026",
                        "name": "汝城县"
                    },
                    {
                        "adcode": "431027",
                        "name": "桂东县"
                    },
                    {
                        "adcode": "431028",
                        "name": "安仁县"
                    },
                    {
                        "adcode": "431040",
                        "name": "郴州高新技术产业园区"
                    },
                    {
                        "adcode": "431081",
                        "name": "资兴市"
                    },
                    {
                        "adcode": "431001",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4311",
                "name": "永州市",
                "s": [
                    {
                        "adcode": "431199",
                        "name": "永州市市本级"
                    },
                    {
                        "adcode": "431102",
                        "name": "零陵区"
                    },
                    {
                        "adcode": "431103",
                        "name": "冷水滩区"
                    },
                    {
                        "adcode": "431121",
                        "name": "祁阳县"
                    },
                    {
                        "adcode": "431122",
                        "name": "东安县"
                    },
                    {
                        "adcode": "431123",
                        "name": "双牌县"
                    },
                    {
                        "adcode": "431124",
                        "name": "道县"
                    },
                    {
                        "adcode": "431125",
                        "name": "江永县"
                    },
                    {
                        "adcode": "431126",
                        "name": "宁远县"
                    },
                    {
                        "adcode": "431127",
                        "name": "蓝山县"
                    },
                    {
                        "adcode": "431128",
                        "name": "新田县"
                    },
                    {
                        "adcode": "431129",
                        "name": "江华瑶族自治县"
                    },
                    {
                        "adcode": "431140",
                        "name": "回龙圩区"
                    },
                    {
                        "adcode": "431141",
                        "name": "金洞管理区"
                    },
                    {
                        "adcode": "431101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4309",
                "name": "益阳市",
                "s": [
                    {
                        "adcode": "430999",
                        "name": "益阳市市本级"
                    },
                    {
                        "adcode": "430902",
                        "name": "资阳区"
                    },
                    {
                        "adcode": "430903",
                        "name": "赫山区"
                    },
                    {
                        "adcode": "430921",
                        "name": "南县"
                    },
                    {
                        "adcode": "430922",
                        "name": "桃江县"
                    },
                    {
                        "adcode": "430923",
                        "name": "安化县"
                    },
                    {
                        "adcode": "430940",
                        "name": "大通湖区"
                    },
                    {
                        "adcode": "430981",
                        "name": "沅江市"
                    },
                    {
                        "adcode": "430901",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "430972",
                        "name": "湖南益阳高新技术产业园区"
                    },
                    {
                        "adcode": "430971",
                        "name": "益阳市大通湖管理区"
                    }
                ]
            },
            {
                "adcode": "4301",
                "name": "长沙市",
                "s": [
                    {
                        "adcode": "430199",
                        "name": "长沙市市本级"
                    },
                    {
                        "adcode": "430102",
                        "name": "芙蓉区"
                    },
                    {
                        "adcode": "430103",
                        "name": "天心区"
                    },
                    {
                        "adcode": "430104",
                        "name": "岳麓区"
                    },
                    {
                        "adcode": "430105",
                        "name": "开福区"
                    },
                    {
                        "adcode": "430111",
                        "name": "雨花区"
                    },
                    {
                        "adcode": "430121",
                        "name": "长沙县"
                    },
                    {
                        "adcode": "430122",
                        "name": "望城县"
                    },
                    {
                        "adcode": "430124",
                        "name": "宁乡县"
                    },
                    {
                        "adcode": "430181",
                        "name": "浏阳市"
                    },
                    {
                        "adcode": "430101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "430112",
                        "name": "望城区"
                    },
                    {
                        "adcode": "430182",
                        "name": "宁乡市"
                    }
                ]
            },
            {
                "adcode": "4312",
                "name": "怀化市",
                "s": [
                    {
                        "adcode": "431299",
                        "name": "怀化市市本级"
                    },
                    {
                        "adcode": "431202",
                        "name": "鹤城区"
                    },
                    {
                        "adcode": "431221",
                        "name": "中方县"
                    },
                    {
                        "adcode": "431222",
                        "name": "沅陵县"
                    },
                    {
                        "adcode": "431223",
                        "name": "辰溪县"
                    },
                    {
                        "adcode": "431224",
                        "name": "溆浦县"
                    },
                    {
                        "adcode": "431225",
                        "name": "会同县"
                    },
                    {
                        "adcode": "431226",
                        "name": "麻阳苗族自治县"
                    },
                    {
                        "adcode": "431227",
                        "name": "新晃侗族自治县"
                    },
                    {
                        "adcode": "431228",
                        "name": "芷江侗族自治县"
                    },
                    {
                        "adcode": "431229",
                        "name": "靖州苗族侗族自治县"
                    },
                    {
                        "adcode": "431230",
                        "name": "通道侗族自治县"
                    },
                    {
                        "adcode": "431240",
                        "name": "洪江区"
                    },
                    {
                        "adcode": "431281",
                        "name": "洪江市"
                    },
                    {
                        "adcode": "431201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "431271",
                        "name": "怀化市洪江管理区"
                    }
                ]
            },
            {
                "adcode": "4302",
                "name": "株洲市",
                "s": [
                    {
                        "adcode": "430299",
                        "name": "株洲市市本级"
                    },
                    {
                        "adcode": "430202",
                        "name": "荷塘区"
                    },
                    {
                        "adcode": "430203",
                        "name": "芦淞区"
                    },
                    {
                        "adcode": "430204",
                        "name": "石峰区"
                    },
                    {
                        "adcode": "430211",
                        "name": "天元区"
                    },
                    {
                        "adcode": "430221",
                        "name": "株洲县"
                    },
                    {
                        "adcode": "430223",
                        "name": "攸县"
                    },
                    {
                        "adcode": "430224",
                        "name": "茶陵县"
                    },
                    {
                        "adcode": "430225",
                        "name": "炎陵县"
                    },
                    {
                        "adcode": "430281",
                        "name": "醴陵市"
                    },
                    {
                        "adcode": "430240",
                        "name": "云龙示范区"
                    },
                    {
                        "adcode": "430201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "430212",
                        "name": "渌口区"
                    }
                ]
            },
            {
                "adcode": "4313",
                "name": "娄底市",
                "s": [
                    {
                        "adcode": "431399",
                        "name": "娄底市市本级"
                    },
                    {
                        "adcode": "431302",
                        "name": "娄星区"
                    },
                    {
                        "adcode": "431321",
                        "name": "双峰县"
                    },
                    {
                        "adcode": "431322",
                        "name": "新化县"
                    },
                    {
                        "adcode": "431381",
                        "name": "冷水江市"
                    },
                    {
                        "adcode": "431382",
                        "name": "涟源市"
                    },
                    {
                        "adcode": "431301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4303",
                "name": "湘潭市",
                "s": [
                    {
                        "adcode": "430399",
                        "name": "湘潭市市本级"
                    },
                    {
                        "adcode": "430302",
                        "name": "雨湖区"
                    },
                    {
                        "adcode": "430304",
                        "name": "岳塘区"
                    },
                    {
                        "adcode": "430321",
                        "name": "湘潭县"
                    },
                    {
                        "adcode": "430340",
                        "name": "高新区"
                    },
                    {
                        "adcode": "430341",
                        "name": "湘潭经济技术开发区"
                    },
                    {
                        "adcode": "430381",
                        "name": "湘乡市"
                    },
                    {
                        "adcode": "430382",
                        "name": "韶山市"
                    },
                    {
                        "adcode": "430301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "430371",
                        "name": "湖南湘潭高新技术产业园区"
                    },
                    {
                        "adcode": "430373",
                        "name": "湘潭九华示范区"
                    }
                ]
            },
            {
                "adcode": "4304",
                "name": "衡阳市",
                "s": [
                    {
                        "adcode": "430499",
                        "name": "衡阳市市本级"
                    },
                    {
                        "adcode": "430405",
                        "name": "珠晖区"
                    },
                    {
                        "adcode": "430406",
                        "name": "雁峰区"
                    },
                    {
                        "adcode": "430407",
                        "name": "石鼓区"
                    },
                    {
                        "adcode": "430408",
                        "name": "蒸湘区"
                    },
                    {
                        "adcode": "430412",
                        "name": "南岳区"
                    },
                    {
                        "adcode": "430421",
                        "name": "衡阳县"
                    },
                    {
                        "adcode": "430422",
                        "name": "衡南县"
                    },
                    {
                        "adcode": "430423",
                        "name": "衡山县"
                    },
                    {
                        "adcode": "430424",
                        "name": "衡东县"
                    },
                    {
                        "adcode": "430426",
                        "name": "祁东县"
                    },
                    {
                        "adcode": "430481",
                        "name": "耒阳市"
                    },
                    {
                        "adcode": "430482",
                        "name": "常宁市"
                    },
                    {
                        "adcode": "430401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "430472",
                        "name": "湖南衡阳高新技术产业园区"
                    }
                ]
            },
            {
                "adcode": "4305",
                "name": "邵阳市",
                "s": [
                    {
                        "adcode": "430599",
                        "name": "邵阳市市本级"
                    },
                    {
                        "adcode": "430502",
                        "name": "双清区"
                    },
                    {
                        "adcode": "430503",
                        "name": "大祥区"
                    },
                    {
                        "adcode": "430511",
                        "name": "北塔区"
                    },
                    {
                        "adcode": "430521",
                        "name": "邵东县"
                    },
                    {
                        "adcode": "430522",
                        "name": "新邵县"
                    },
                    {
                        "adcode": "430523",
                        "name": "邵阳县"
                    },
                    {
                        "adcode": "430524",
                        "name": "隆回县"
                    },
                    {
                        "adcode": "430525",
                        "name": "洞口县"
                    },
                    {
                        "adcode": "430527",
                        "name": "绥宁县"
                    },
                    {
                        "adcode": "430528",
                        "name": "新宁县"
                    },
                    {
                        "adcode": "430529",
                        "name": "城步苗族自治县"
                    },
                    {
                        "adcode": "430581",
                        "name": "武冈市"
                    },
                    {
                        "adcode": "430501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4306",
                "name": "岳阳市",
                "s": [
                    {
                        "adcode": "430699",
                        "name": "岳阳市市本级"
                    },
                    {
                        "adcode": "430602",
                        "name": "岳阳楼区"
                    },
                    {
                        "adcode": "430603",
                        "name": "云溪区"
                    },
                    {
                        "adcode": "430611",
                        "name": "君山区"
                    },
                    {
                        "adcode": "430621",
                        "name": "岳阳县"
                    },
                    {
                        "adcode": "430623",
                        "name": "华容县"
                    },
                    {
                        "adcode": "430624",
                        "name": "湘阴县"
                    },
                    {
                        "adcode": "430626",
                        "name": "平江县"
                    },
                    {
                        "adcode": "430640",
                        "name": "开发区"
                    },
                    {
                        "adcode": "430641",
                        "name": "屈原区"
                    },
                    {
                        "adcode": "430642",
                        "name": "南湖旅游度假区"
                    },
                    {
                        "adcode": "430681",
                        "name": "汨罗市"
                    },
                    {
                        "adcode": "430682",
                        "name": "临湘市"
                    },
                    {
                        "adcode": "430601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "430671",
                        "name": "岳阳市屈原管理区"
                    }
                ]
            },
            {
                "adcode": "4307",
                "name": "常德市",
                "s": [
                    {
                        "adcode": "430799",
                        "name": "常德市市本级"
                    },
                    {
                        "adcode": "430702",
                        "name": "武陵区"
                    },
                    {
                        "adcode": "430703",
                        "name": "鼎城区"
                    },
                    {
                        "adcode": "430721",
                        "name": "安乡县"
                    },
                    {
                        "adcode": "430722",
                        "name": "汉寿县"
                    },
                    {
                        "adcode": "430723",
                        "name": "澧县"
                    },
                    {
                        "adcode": "430724",
                        "name": "临澧县"
                    },
                    {
                        "adcode": "430725",
                        "name": "桃源县"
                    },
                    {
                        "adcode": "430726",
                        "name": "石门县"
                    },
                    {
                        "adcode": "430740",
                        "name": "西洞庭管理区"
                    },
                    {
                        "adcode": "430741",
                        "name": "西湖区"
                    },
                    {
                        "adcode": "430781",
                        "name": "津市市"
                    },
                    {
                        "adcode": "430701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "430771",
                        "name": "常德市西洞庭管理区"
                    }
                ]
            },
            {
                "adcode": "4308",
                "name": "张家界市",
                "s": [
                    {
                        "adcode": "430899",
                        "name": "张家界市市本级"
                    },
                    {
                        "adcode": "430802",
                        "name": "永定区"
                    },
                    {
                        "adcode": "430811",
                        "name": "武陵源区"
                    },
                    {
                        "adcode": "430821",
                        "name": "慈利县"
                    },
                    {
                        "adcode": "430822",
                        "name": "桑植县"
                    },
                    {
                        "adcode": "430801",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "52",
        "name": "贵州省",
        "s": [
            {
                "adcode": "5222",
                "name": "铜仁地区",
                "s": [
                    {
                        "adcode": "522299",
                        "name": "铜仁地区本级"
                    },
                    {
                        "adcode": "522201",
                        "name": "铜仁市"
                    },
                    {
                        "adcode": "522222",
                        "name": "江口县"
                    },
                    {
                        "adcode": "522223",
                        "name": "玉屏侗族自治县"
                    },
                    {
                        "adcode": "522224",
                        "name": "石阡县"
                    },
                    {
                        "adcode": "522225",
                        "name": "思南县"
                    },
                    {
                        "adcode": "522226",
                        "name": "印江土家族苗族自治县"
                    },
                    {
                        "adcode": "522227",
                        "name": "德江县"
                    },
                    {
                        "adcode": "522228",
                        "name": "沿河土家族自治县"
                    },
                    {
                        "adcode": "522229",
                        "name": "松桃苗族自治县"
                    },
                    {
                        "adcode": "522230",
                        "name": "万山特区"
                    }
                ]
            },
            {
                "adcode": "5201",
                "name": "贵阳市",
                "s": [
                    {
                        "adcode": "520199",
                        "name": "贵阳市市本级"
                    },
                    {
                        "adcode": "520102",
                        "name": "南明区"
                    },
                    {
                        "adcode": "520103",
                        "name": "云岩区"
                    },
                    {
                        "adcode": "520111",
                        "name": "花溪区"
                    },
                    {
                        "adcode": "520112",
                        "name": "乌当区"
                    },
                    {
                        "adcode": "520113",
                        "name": "白云区"
                    },
                    {
                        "adcode": "520114",
                        "name": "小河区"
                    },
                    {
                        "adcode": "520121",
                        "name": "开阳县"
                    },
                    {
                        "adcode": "520122",
                        "name": "息烽县"
                    },
                    {
                        "adcode": "520123",
                        "name": "修文县"
                    },
                    {
                        "adcode": "520181",
                        "name": "清镇市"
                    },
                    {
                        "adcode": "520115",
                        "name": "观山湖区"
                    },
                    {
                        "adcode": "520101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5223",
                "name": "黔西南布依族苗族自治州",
                "s": [
                    {
                        "adcode": "522399",
                        "name": "黔西南布依族苗族自治州州本级"
                    },
                    {
                        "adcode": "522301",
                        "name": "兴义市"
                    },
                    {
                        "adcode": "522322",
                        "name": "兴仁县"
                    },
                    {
                        "adcode": "522323",
                        "name": "普安县"
                    },
                    {
                        "adcode": "522324",
                        "name": "晴隆县"
                    },
                    {
                        "adcode": "522325",
                        "name": "贞丰县"
                    },
                    {
                        "adcode": "522326",
                        "name": "望谟县"
                    },
                    {
                        "adcode": "522327",
                        "name": "册亨县"
                    },
                    {
                        "adcode": "522328",
                        "name": "安龙县"
                    },
                    {
                        "adcode": "522340",
                        "name": "义龙新区"
                    },
                    {
                        "adcode": "522302",
                        "name": "兴仁市"
                    }
                ]
            },
            {
                "adcode": "5202",
                "name": "六盘水市",
                "s": [
                    {
                        "adcode": "520299",
                        "name": "六盘水市市本级"
                    },
                    {
                        "adcode": "520201",
                        "name": "钟山区"
                    },
                    {
                        "adcode": "520203",
                        "name": "六枝特区"
                    },
                    {
                        "adcode": "520221",
                        "name": "水城县"
                    },
                    {
                        "adcode": "520222",
                        "name": "盘县"
                    },
                    {
                        "adcode": "520240",
                        "name": "钟山经济开发区"
                    },
                    {
                        "adcode": "520281",
                        "name": "盘州市"
                    }
                ]
            },
            {
                "adcode": "5224",
                "name": "毕节地区",
                "s": [
                    {
                        "adcode": "522499",
                        "name": "毕节地区本级"
                    },
                    {
                        "adcode": "522401",
                        "name": "毕节市"
                    },
                    {
                        "adcode": "522422",
                        "name": "大方县"
                    },
                    {
                        "adcode": "522423",
                        "name": "黔西县"
                    },
                    {
                        "adcode": "522424",
                        "name": "金沙县"
                    },
                    {
                        "adcode": "522425",
                        "name": "织金县"
                    },
                    {
                        "adcode": "522426",
                        "name": "纳雍县"
                    },
                    {
                        "adcode": "522427",
                        "name": "威宁彝族回族苗族自治县"
                    },
                    {
                        "adcode": "522428",
                        "name": "赫章县"
                    },
                    {
                        "adcode": "522440",
                        "name": "百里杜鹃管理区"
                    }
                ]
            },
            {
                "adcode": "5203",
                "name": "遵义市",
                "s": [
                    {
                        "adcode": "520399",
                        "name": "遵义市市本级"
                    },
                    {
                        "adcode": "520302",
                        "name": "红花岗区"
                    },
                    {
                        "adcode": "520303",
                        "name": "汇川区"
                    },
                    {
                        "adcode": "520321",
                        "name": "遵义县"
                    },
                    {
                        "adcode": "520322",
                        "name": "桐梓县"
                    },
                    {
                        "adcode": "520323",
                        "name": "绥阳县"
                    },
                    {
                        "adcode": "520324",
                        "name": "正安县"
                    },
                    {
                        "adcode": "520325",
                        "name": "道真仡佬族苗族自治县"
                    },
                    {
                        "adcode": "520326",
                        "name": "务川仡佬族苗族自治县"
                    },
                    {
                        "adcode": "520327",
                        "name": "凤冈县"
                    },
                    {
                        "adcode": "520328",
                        "name": "湄潭县"
                    },
                    {
                        "adcode": "520329",
                        "name": "余庆县"
                    },
                    {
                        "adcode": "520330",
                        "name": "习水县"
                    },
                    {
                        "adcode": "520381",
                        "name": "赤水市"
                    },
                    {
                        "adcode": "520382",
                        "name": "仁怀市"
                    },
                    {
                        "adcode": "520301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "520304",
                        "name": "播州区"
                    }
                ]
            },
            {
                "adcode": "5204",
                "name": "安顺市",
                "s": [
                    {
                        "adcode": "520499",
                        "name": "安顺市市本级"
                    },
                    {
                        "adcode": "520402",
                        "name": "西秀区"
                    },
                    {
                        "adcode": "520421",
                        "name": "平坝县"
                    },
                    {
                        "adcode": "520422",
                        "name": "普定县"
                    },
                    {
                        "adcode": "520423",
                        "name": "镇宁布依族苗族自治县"
                    },
                    {
                        "adcode": "520424",
                        "name": "关岭布依族苗族自治县"
                    },
                    {
                        "adcode": "520425",
                        "name": "紫云苗族布依族自治县"
                    },
                    {
                        "adcode": "520440",
                        "name": "经济技术开发区"
                    },
                    {
                        "adcode": "520441",
                        "name": "黄果树管委会"
                    },
                    {
                        "adcode": "520401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "520403",
                        "name": "平坝区"
                    }
                ]
            },
            {
                "adcode": "5226",
                "name": "黔东南苗族侗族自治州",
                "s": [
                    {
                        "adcode": "522699",
                        "name": "黔东南苗族侗族自治州州本级"
                    },
                    {
                        "adcode": "522601",
                        "name": "凯里市"
                    },
                    {
                        "adcode": "522622",
                        "name": "黄平县"
                    },
                    {
                        "adcode": "522623",
                        "name": "施秉县"
                    },
                    {
                        "adcode": "522624",
                        "name": "三穗县"
                    },
                    {
                        "adcode": "522625",
                        "name": "镇远县"
                    },
                    {
                        "adcode": "522626",
                        "name": "岑巩县"
                    },
                    {
                        "adcode": "522627",
                        "name": "天柱县"
                    },
                    {
                        "adcode": "522628",
                        "name": "锦屏县"
                    },
                    {
                        "adcode": "522629",
                        "name": "剑河县"
                    },
                    {
                        "adcode": "522630",
                        "name": "台江县"
                    },
                    {
                        "adcode": "522631",
                        "name": "黎平县"
                    },
                    {
                        "adcode": "522632",
                        "name": "榕江县"
                    },
                    {
                        "adcode": "522633",
                        "name": "从江县"
                    },
                    {
                        "adcode": "522634",
                        "name": "雷山县"
                    },
                    {
                        "adcode": "522635",
                        "name": "麻江县"
                    },
                    {
                        "adcode": "522636",
                        "name": "丹寨县"
                    },
                    {
                        "adcode": "522640",
                        "name": "凯里经济开发区"
                    }
                ]
            },
            {
                "adcode": "5205",
                "name": "毕节市",
                "s": [
                    {
                        "adcode": "520599",
                        "name": "毕节市本级"
                    },
                    {
                        "adcode": "520502",
                        "name": "七星关区"
                    },
                    {
                        "adcode": "520521",
                        "name": "大方县"
                    },
                    {
                        "adcode": "520522",
                        "name": "黔西县"
                    },
                    {
                        "adcode": "520523",
                        "name": "金沙县"
                    },
                    {
                        "adcode": "520524",
                        "name": "织金县"
                    },
                    {
                        "adcode": "520525",
                        "name": "纳雍县"
                    },
                    {
                        "adcode": "520526",
                        "name": "威宁彝族回族苗族自治县"
                    },
                    {
                        "adcode": "520527",
                        "name": "赫章县"
                    },
                    {
                        "adcode": "520540",
                        "name": "百里杜鹃风景名胜区"
                    },
                    {
                        "adcode": "520541",
                        "name": "毕节经济开发区"
                    },
                    {
                        "adcode": "520501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5227",
                "name": "黔南布依族苗族自治州",
                "s": [
                    {
                        "adcode": "522799",
                        "name": "黔南布依族苗族自治州州本级"
                    },
                    {
                        "adcode": "522701",
                        "name": "都匀市"
                    },
                    {
                        "adcode": "522702",
                        "name": "福泉市"
                    },
                    {
                        "adcode": "522722",
                        "name": "荔波县"
                    },
                    {
                        "adcode": "522723",
                        "name": "贵定县"
                    },
                    {
                        "adcode": "522725",
                        "name": "瓮安县"
                    },
                    {
                        "adcode": "522726",
                        "name": "独山县"
                    },
                    {
                        "adcode": "522727",
                        "name": "平塘县"
                    },
                    {
                        "adcode": "522728",
                        "name": "罗甸县"
                    },
                    {
                        "adcode": "522729",
                        "name": "长顺县"
                    },
                    {
                        "adcode": "522730",
                        "name": "龙里县"
                    },
                    {
                        "adcode": "522731",
                        "name": "惠水县"
                    },
                    {
                        "adcode": "522732",
                        "name": "三都水族自治县"
                    },
                    {
                        "adcode": "522740",
                        "name": "都匀经济开发区"
                    }
                ]
            },
            {
                "adcode": "5206",
                "name": "铜仁市",
                "s": [
                    {
                        "adcode": "520699",
                        "name": "铜仁市市本级"
                    },
                    {
                        "adcode": "520602",
                        "name": "碧江区"
                    },
                    {
                        "adcode": "520603",
                        "name": "万山区"
                    },
                    {
                        "adcode": "520621",
                        "name": "江口县"
                    },
                    {
                        "adcode": "520622",
                        "name": "玉屏侗族自治县"
                    },
                    {
                        "adcode": "520623",
                        "name": "石阡县"
                    },
                    {
                        "adcode": "520624",
                        "name": "思南县"
                    },
                    {
                        "adcode": "520625",
                        "name": "印江土家族苗族自治县"
                    },
                    {
                        "adcode": "520626",
                        "name": "德江县"
                    },
                    {
                        "adcode": "520627",
                        "name": "沿河土家族自治县"
                    },
                    {
                        "adcode": "520628",
                        "name": "松桃苗族自治县"
                    },
                    {
                        "adcode": "520640",
                        "name": "大龙开发区"
                    },
                    {
                        "adcode": "520601",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5270",
                "name": "贵安新区",
                "s": [
                    {
                        "adcode": "527099",
                        "name": "贵安新区本级"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "23",
        "name": "黑龙江省",
        "s": [
            {
                "adcode": "2306",
                "name": "大庆市",
                "s": [
                    {
                        "adcode": "230699",
                        "name": "大庆市市本级"
                    },
                    {
                        "adcode": "230602",
                        "name": "萨尔图区"
                    },
                    {
                        "adcode": "230603",
                        "name": "龙凤区"
                    },
                    {
                        "adcode": "230604",
                        "name": "让胡路区"
                    },
                    {
                        "adcode": "230605",
                        "name": "红岗区"
                    },
                    {
                        "adcode": "230606",
                        "name": "大同区"
                    },
                    {
                        "adcode": "230621",
                        "name": "肇州县"
                    },
                    {
                        "adcode": "230622",
                        "name": "肇源县"
                    },
                    {
                        "adcode": "230623",
                        "name": "林甸县"
                    },
                    {
                        "adcode": "230624",
                        "name": "杜尔伯特蒙古族自治县"
                    },
                    {
                        "adcode": "230601",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2328",
                "name": "省森工地区",
                "s": [
                    {
                        "adcode": "232899",
                        "name": "省森工地区本级"
                    },
                    {
                        "adcode": "232801",
                        "name": "牡丹江森工地区"
                    },
                    {
                        "adcode": "232802",
                        "name": "松花江森工地区"
                    },
                    {
                        "adcode": "232803",
                        "name": "合江森工地区"
                    }
                ]
            },
            {
                "adcode": "2305",
                "name": "双鸭山市",
                "s": [
                    {
                        "adcode": "230599",
                        "name": "双鸭市市本级"
                    },
                    {
                        "adcode": "230502",
                        "name": "尖山区"
                    },
                    {
                        "adcode": "230503",
                        "name": "岭东区"
                    },
                    {
                        "adcode": "230505",
                        "name": "四方台区"
                    },
                    {
                        "adcode": "230506",
                        "name": "宝山区"
                    },
                    {
                        "adcode": "230521",
                        "name": "集贤县"
                    },
                    {
                        "adcode": "230522",
                        "name": "友谊县"
                    },
                    {
                        "adcode": "230523",
                        "name": "宝清县"
                    },
                    {
                        "adcode": "230524",
                        "name": "饶河县"
                    },
                    {
                        "adcode": "230501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2327",
                "name": "大兴安岭地区",
                "s": [
                    {
                        "adcode": "232799",
                        "name": "大兴安岭地区本级"
                    },
                    {
                        "adcode": "232701",
                        "name": "加格达奇区"
                    },
                    {
                        "adcode": "232702",
                        "name": "松岭区"
                    },
                    {
                        "adcode": "232703",
                        "name": "新林区"
                    },
                    {
                        "adcode": "232704",
                        "name": "呼中区"
                    },
                    {
                        "adcode": "232721",
                        "name": "呼玛县"
                    },
                    {
                        "adcode": "232722",
                        "name": "塔河县"
                    },
                    {
                        "adcode": "232723",
                        "name": "漠河县"
                    },
                    {
                        "adcode": "232740",
                        "name": "加格达奇林业局"
                    },
                    {
                        "adcode": "232741",
                        "name": "十八站林业局"
                    },
                    {
                        "adcode": "232742",
                        "name": "图强林业局"
                    },
                    {
                        "adcode": "232743",
                        "name": "阿木尔林业局"
                    },
                    {
                        "adcode": "232744",
                        "name": "韩家园林业局"
                    },
                    {
                        "adcode": "232745",
                        "name": "林管局农工商联合"
                    },
                    {
                        "adcode": "232701",
                        "name": "漠河市"
                    }
                ]
            },
            {
                "adcode": "2304",
                "name": "鹤岗市",
                "s": [
                    {
                        "adcode": "230499",
                        "name": "鹤岗市市本级"
                    },
                    {
                        "adcode": "230402",
                        "name": "向阳区"
                    },
                    {
                        "adcode": "230403",
                        "name": "工农区"
                    },
                    {
                        "adcode": "230404",
                        "name": "南山区"
                    },
                    {
                        "adcode": "230405",
                        "name": "兴安区"
                    },
                    {
                        "adcode": "230406",
                        "name": "东山区"
                    },
                    {
                        "adcode": "230407",
                        "name": "兴山区"
                    },
                    {
                        "adcode": "230421",
                        "name": "萝北县"
                    },
                    {
                        "adcode": "230422",
                        "name": "绥滨县"
                    },
                    {
                        "adcode": "230401",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2303",
                "name": "鸡西市",
                "s": [
                    {
                        "adcode": "230399",
                        "name": "鸡西市市本级"
                    },
                    {
                        "adcode": "230302",
                        "name": "鸡冠区"
                    },
                    {
                        "adcode": "230303",
                        "name": "恒山区"
                    },
                    {
                        "adcode": "230304",
                        "name": "滴道区"
                    },
                    {
                        "adcode": "230305",
                        "name": "梨树区"
                    },
                    {
                        "adcode": "230306",
                        "name": "城子河区"
                    },
                    {
                        "adcode": "230307",
                        "name": "麻山区"
                    },
                    {
                        "adcode": "230321",
                        "name": "鸡东县"
                    },
                    {
                        "adcode": "230381",
                        "name": "虎林市"
                    },
                    {
                        "adcode": "230382",
                        "name": "密山市"
                    },
                    {
                        "adcode": "230301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2302",
                "name": "齐齐哈尔市",
                "s": [
                    {
                        "adcode": "230299",
                        "name": "齐齐哈尔市市本级"
                    },
                    {
                        "adcode": "230202",
                        "name": "龙沙区"
                    },
                    {
                        "adcode": "230203",
                        "name": "建华区"
                    },
                    {
                        "adcode": "230204",
                        "name": "铁锋区"
                    },
                    {
                        "adcode": "230205",
                        "name": "昂昂溪区"
                    },
                    {
                        "adcode": "230206",
                        "name": "富拉尔基区"
                    },
                    {
                        "adcode": "230207",
                        "name": "碾子山区"
                    },
                    {
                        "adcode": "230208",
                        "name": "梅里斯达斡尔族区"
                    },
                    {
                        "adcode": "230221",
                        "name": "龙江县"
                    },
                    {
                        "adcode": "230223",
                        "name": "依安县"
                    },
                    {
                        "adcode": "230224",
                        "name": "泰来县"
                    },
                    {
                        "adcode": "230225",
                        "name": "甘南县"
                    },
                    {
                        "adcode": "230227",
                        "name": "富裕县"
                    },
                    {
                        "adcode": "230229",
                        "name": "克山县"
                    },
                    {
                        "adcode": "230230",
                        "name": "克东县"
                    },
                    {
                        "adcode": "230231",
                        "name": "拜泉县"
                    },
                    {
                        "adcode": "230281",
                        "name": "讷河市"
                    },
                    {
                        "adcode": "230201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2301",
                "name": "哈尔滨市",
                "s": [
                    {
                        "adcode": "230199",
                        "name": "哈尔滨市市本级"
                    },
                    {
                        "adcode": "230102",
                        "name": "道里区"
                    },
                    {
                        "adcode": "230103",
                        "name": "南岗区"
                    },
                    {
                        "adcode": "230104",
                        "name": "道外区"
                    },
                    {
                        "adcode": "230108",
                        "name": "平房区"
                    },
                    {
                        "adcode": "230109",
                        "name": "松北区"
                    },
                    {
                        "adcode": "230110",
                        "name": "香坊区"
                    },
                    {
                        "adcode": "230111",
                        "name": "呼兰区"
                    },
                    {
                        "adcode": "230112",
                        "name": "阿城区"
                    },
                    {
                        "adcode": "230123",
                        "name": "依兰县"
                    },
                    {
                        "adcode": "230124",
                        "name": "方正县"
                    },
                    {
                        "adcode": "230125",
                        "name": "宾县"
                    },
                    {
                        "adcode": "230126",
                        "name": "巴彦县"
                    },
                    {
                        "adcode": "230127",
                        "name": "木兰县"
                    },
                    {
                        "adcode": "230128",
                        "name": "通河县"
                    },
                    {
                        "adcode": "230129",
                        "name": "延寿县"
                    },
                    {
                        "adcode": "230182",
                        "name": "双城市"
                    },
                    {
                        "adcode": "230183",
                        "name": "尚志市"
                    },
                    {
                        "adcode": "230184",
                        "name": "五常市"
                    },
                    {
                        "adcode": "230101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "230113",
                        "name": "双城区"
                    }
                ]
            },
            {
                "adcode": "2312",
                "name": "绥化市",
                "s": [
                    {
                        "adcode": "231299",
                        "name": "绥化市市本级"
                    },
                    {
                        "adcode": "231202",
                        "name": "北林区"
                    },
                    {
                        "adcode": "231221",
                        "name": "望奎县"
                    },
                    {
                        "adcode": "231222",
                        "name": "兰西县"
                    },
                    {
                        "adcode": "231223",
                        "name": "青冈县"
                    },
                    {
                        "adcode": "231224",
                        "name": "庆安县"
                    },
                    {
                        "adcode": "231225",
                        "name": "明水县"
                    },
                    {
                        "adcode": "231226",
                        "name": "绥棱县"
                    },
                    {
                        "adcode": "231281",
                        "name": "安达市"
                    },
                    {
                        "adcode": "231282",
                        "name": "肇东市"
                    },
                    {
                        "adcode": "231283",
                        "name": "海伦市"
                    },
                    {
                        "adcode": "231201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2399",
                "name": "黑龙江省省本级",
                "s": [
                    {
                        "adcode": "239903",
                        "name": "黑龙江省省本级（哈尔滨铁路局）"
                    },
                    {
                        "adcode": "239904",
                        "name": "黑龙江省省本级（大庆油田）"
                    }
                ]
            },
            {
                "adcode": "2311",
                "name": "黑河市",
                "s": [
                    {
                        "adcode": "231199",
                        "name": "黑河市市本级"
                    },
                    {
                        "adcode": "231102",
                        "name": "爱辉区"
                    },
                    {
                        "adcode": "231121",
                        "name": "嫩江县"
                    },
                    {
                        "adcode": "231123",
                        "name": "逊克县"
                    },
                    {
                        "adcode": "231124",
                        "name": "孙吴县"
                    },
                    {
                        "adcode": "231181",
                        "name": "北安市"
                    },
                    {
                        "adcode": "231182",
                        "name": "五大连池市"
                    },
                    {
                        "adcode": "231101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2310",
                "name": "牡丹江市",
                "s": [
                    {
                        "adcode": "231099",
                        "name": "牡丹江市市本级"
                    },
                    {
                        "adcode": "231002",
                        "name": "东安区"
                    },
                    {
                        "adcode": "231003",
                        "name": "阳明区"
                    },
                    {
                        "adcode": "231004",
                        "name": "爱民区"
                    },
                    {
                        "adcode": "231005",
                        "name": "西安区"
                    },
                    {
                        "adcode": "231024",
                        "name": "东宁县"
                    },
                    {
                        "adcode": "231025",
                        "name": "林口县"
                    },
                    {
                        "adcode": "231081",
                        "name": "绥芬河市"
                    },
                    {
                        "adcode": "231083",
                        "name": "海林市"
                    },
                    {
                        "adcode": "231084",
                        "name": "宁安市"
                    },
                    {
                        "adcode": "231085",
                        "name": "穆棱市"
                    },
                    {
                        "adcode": "231001",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "231086",
                        "name": "东宁市"
                    },
                    {
                        "adcode": "231071",
                        "name": "牡丹江经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "2309",
                "name": "七台河市",
                "s": [
                    {
                        "adcode": "230999",
                        "name": "七台河市市本级"
                    },
                    {
                        "adcode": "230902",
                        "name": "新兴区"
                    },
                    {
                        "adcode": "230903",
                        "name": "桃山区"
                    },
                    {
                        "adcode": "230904",
                        "name": "茄子河区"
                    },
                    {
                        "adcode": "230921",
                        "name": "勃利县"
                    },
                    {
                        "adcode": "230901",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2308",
                "name": "佳木斯市",
                "s": [
                    {
                        "adcode": "230899",
                        "name": "佳木斯市市本级"
                    },
                    {
                        "adcode": "230803",
                        "name": "向阳区"
                    },
                    {
                        "adcode": "230804",
                        "name": "前进区"
                    },
                    {
                        "adcode": "230805",
                        "name": "东风区"
                    },
                    {
                        "adcode": "230811",
                        "name": "郊区"
                    },
                    {
                        "adcode": "230822",
                        "name": "桦南县"
                    },
                    {
                        "adcode": "230826",
                        "name": "桦川县"
                    },
                    {
                        "adcode": "230828",
                        "name": "汤原县"
                    },
                    {
                        "adcode": "230833",
                        "name": "抚远县"
                    },
                    {
                        "adcode": "230881",
                        "name": "同江市"
                    },
                    {
                        "adcode": "230882",
                        "name": "富锦市"
                    },
                    {
                        "adcode": "230883",
                        "name": "抚远市"
                    },
                    {
                        "adcode": "230801",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2307",
                "name": "伊春市",
                "s": [
                    {
                        "adcode": "230799",
                        "name": "伊春市市本级"
                    },
                    {
                        "adcode": "230702",
                        "name": "伊春区"
                    },
                    {
                        "adcode": "230703",
                        "name": "南岔区"
                    },
                    {
                        "adcode": "230704",
                        "name": "友好区"
                    },
                    {
                        "adcode": "230705",
                        "name": "西林区"
                    },
                    {
                        "adcode": "230706",
                        "name": "翠峦区"
                    },
                    {
                        "adcode": "230707",
                        "name": "新青区"
                    },
                    {
                        "adcode": "230708",
                        "name": "美溪区"
                    },
                    {
                        "adcode": "230709",
                        "name": "金山屯区"
                    },
                    {
                        "adcode": "230710",
                        "name": "五营区"
                    },
                    {
                        "adcode": "230711",
                        "name": "乌马河区"
                    },
                    {
                        "adcode": "230712",
                        "name": "汤旺河区"
                    },
                    {
                        "adcode": "230713",
                        "name": "带岭区"
                    },
                    {
                        "adcode": "230714",
                        "name": "乌伊岭区"
                    },
                    {
                        "adcode": "230715",
                        "name": "红星区"
                    },
                    {
                        "adcode": "230716",
                        "name": "上甘岭区"
                    },
                    {
                        "adcode": "230722",
                        "name": "嘉荫县"
                    },
                    {
                        "adcode": "230781",
                        "name": "铁力市"
                    },
                    {
                        "adcode": "230701",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2329",
                "name": "省农垦总局",
                "s": [
                    {
                        "adcode": "232999",
                        "name": "省农垦总局本级"
                    },
                    {
                        "adcode": "232901",
                        "name": "农垦总局直属地区"
                    },
                    {
                        "adcode": "232902",
                        "name": "农垦宝泉岭分局"
                    },
                    {
                        "adcode": "232903",
                        "name": "农垦红兴隆分局"
                    },
                    {
                        "adcode": "232904",
                        "name": "农垦建三江分局"
                    },
                    {
                        "adcode": "232905",
                        "name": "农垦牡丹江分局"
                    },
                    {
                        "adcode": "232906",
                        "name": "农垦北安分局"
                    },
                    {
                        "adcode": "232907",
                        "name": "农垦九三分局"
                    },
                    {
                        "adcode": "232908",
                        "name": "农垦齐齐哈尔分局"
                    },
                    {
                        "adcode": "232909",
                        "name": "农垦绥化分局"
                    },
                    {
                        "adcode": "232910",
                        "name": "农垦哈尔滨分局"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "53",
        "name": "云南省",
        "s": [
            {
                "adcode": "5331",
                "name": "德宏傣族景颇族自治州",
                "s": [
                    {
                        "adcode": "533199",
                        "name": "德宏傣族景颇族自治州州本级"
                    },
                    {
                        "adcode": "533102",
                        "name": "瑞丽市"
                    },
                    {
                        "adcode": "533103",
                        "name": "芒市"
                    },
                    {
                        "adcode": "533122",
                        "name": "梁河县"
                    },
                    {
                        "adcode": "533123",
                        "name": "盈江县"
                    },
                    {
                        "adcode": "533124",
                        "name": "陇川县"
                    }
                ]
            },
            {
                "adcode": "5333",
                "name": "怒江傈僳族自治州",
                "s": [
                    {
                        "adcode": "533399",
                        "name": "怒江傈僳族自治州州本级"
                    },
                    {
                        "adcode": "533321",
                        "name": "泸水县"
                    },
                    {
                        "adcode": "533323",
                        "name": "福贡县"
                    },
                    {
                        "adcode": "533324",
                        "name": "贡山独龙族怒族自治县"
                    },
                    {
                        "adcode": "533325",
                        "name": "兰坪白族普米族自治县"
                    },
                    {
                        "adcode": "533301",
                        "name": "泸水市"
                    }
                ]
            },
            {
                "adcode": "5301",
                "name": "昆明市",
                "s": [
                    {
                        "adcode": "530199",
                        "name": "昆明市市本级"
                    },
                    {
                        "adcode": "530102",
                        "name": "五华区"
                    },
                    {
                        "adcode": "530103",
                        "name": "盘龙区"
                    },
                    {
                        "adcode": "530111",
                        "name": "官渡区"
                    },
                    {
                        "adcode": "530112",
                        "name": "西山区"
                    },
                    {
                        "adcode": "530113",
                        "name": "东川区"
                    },
                    {
                        "adcode": "530114",
                        "name": "呈贡区"
                    },
                    {
                        "adcode": "530121",
                        "name": "呈贡县"
                    },
                    {
                        "adcode": "530122",
                        "name": "晋宁县"
                    },
                    {
                        "adcode": "530124",
                        "name": "富民县"
                    },
                    {
                        "adcode": "530125",
                        "name": "宜良县"
                    },
                    {
                        "adcode": "530126",
                        "name": "石林彝族自治县"
                    },
                    {
                        "adcode": "530127",
                        "name": "嵩明县"
                    },
                    {
                        "adcode": "530128",
                        "name": "禄劝彝族苗族自治县"
                    },
                    {
                        "adcode": "530129",
                        "name": "寻甸回族彝族自治县"
                    },
                    {
                        "adcode": "530140",
                        "name": "昆明滇池国家旅游度假区"
                    },
                    {
                        "adcode": "530141",
                        "name": "昆明阳宗海风景名胜区"
                    },
                    {
                        "adcode": "530142",
                        "name": "昆明经济技术开发区"
                    },
                    {
                        "adcode": "530143",
                        "name": "昆明高新技术产业开发区"
                    },
                    {
                        "adcode": "530144",
                        "name": "昆明倘甸产业园区和轿子山旅游开发区"
                    },
                    {
                        "adcode": "530181",
                        "name": "安宁市"
                    },
                    {
                        "adcode": "530101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "530115",
                        "name": "晋宁区"
                    }
                ]
            },
            {
                "adcode": "5323",
                "name": "楚雄彝族自治州",
                "s": [
                    {
                        "adcode": "532399",
                        "name": "楚雄彝族自治州州本级"
                    },
                    {
                        "adcode": "532301",
                        "name": "楚雄市"
                    },
                    {
                        "adcode": "532322",
                        "name": "双柏县"
                    },
                    {
                        "adcode": "532323",
                        "name": "牟定县"
                    },
                    {
                        "adcode": "532324",
                        "name": "南华县"
                    },
                    {
                        "adcode": "532325",
                        "name": "姚安县"
                    },
                    {
                        "adcode": "532326",
                        "name": "大姚县"
                    },
                    {
                        "adcode": "532327",
                        "name": "永仁县"
                    },
                    {
                        "adcode": "532328",
                        "name": "元谋县"
                    },
                    {
                        "adcode": "532329",
                        "name": "武定县"
                    },
                    {
                        "adcode": "532331",
                        "name": "禄丰县"
                    }
                ]
            },
            {
                "adcode": "5334",
                "name": "迪庆藏族自治州",
                "s": [
                    {
                        "adcode": "533499",
                        "name": "迪庆藏族自治州州本级"
                    },
                    {
                        "adcode": "533421",
                        "name": "香格里拉县"
                    },
                    {
                        "adcode": "533422",
                        "name": "德钦县"
                    },
                    {
                        "adcode": "533423",
                        "name": "维西傈僳族自治县"
                    },
                    {
                        "adcode": "533401",
                        "name": "香格里拉市"
                    }
                ]
            },
            {
                "adcode": "5303",
                "name": "曲靖市",
                "s": [
                    {
                        "adcode": "530399",
                        "name": "曲靖市市本级"
                    },
                    {
                        "adcode": "530302",
                        "name": "麒麟区"
                    },
                    {
                        "adcode": "530321",
                        "name": "马龙县"
                    },
                    {
                        "adcode": "530322",
                        "name": "陆良县"
                    },
                    {
                        "adcode": "530323",
                        "name": "师宗县"
                    },
                    {
                        "adcode": "530324",
                        "name": "罗平县"
                    },
                    {
                        "adcode": "530325",
                        "name": "富源县"
                    },
                    {
                        "adcode": "530326",
                        "name": "会泽县"
                    },
                    {
                        "adcode": "530328",
                        "name": "沾益县"
                    },
                    {
                        "adcode": "530381",
                        "name": "宣威市"
                    },
                    {
                        "adcode": "530301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "530303",
                        "name": "沾益区"
                    },
                    {
                        "adcode": "530304",
                        "name": "马龙区"
                    }
                ]
            },
            {
                "adcode": "5325",
                "name": "红河哈尼族彝族自治州",
                "s": [
                    {
                        "adcode": "532599",
                        "name": "红河哈尼族彝族自治州州本级"
                    },
                    {
                        "adcode": "532501",
                        "name": "个旧市"
                    },
                    {
                        "adcode": "532502",
                        "name": "开远市"
                    },
                    {
                        "adcode": "532503",
                        "name": "蒙自市"
                    },
                    {
                        "adcode": "532522",
                        "name": "蒙自县"
                    },
                    {
                        "adcode": "532523",
                        "name": "屏边苗族自治县"
                    },
                    {
                        "adcode": "532524",
                        "name": "建水县"
                    },
                    {
                        "adcode": "532525",
                        "name": "石屏县"
                    },
                    {
                        "adcode": "532526",
                        "name": "弥勒县"
                    },
                    {
                        "adcode": "532527",
                        "name": "泸西县"
                    },
                    {
                        "adcode": "532528",
                        "name": "元阳县"
                    },
                    {
                        "adcode": "532529",
                        "name": "红河县"
                    },
                    {
                        "adcode": "532530",
                        "name": "金平苗族瑶族傣族自治县"
                    },
                    {
                        "adcode": "532531",
                        "name": "绿春县"
                    },
                    {
                        "adcode": "532532",
                        "name": "河口瑶族自治县"
                    },
                    {
                        "adcode": "532504",
                        "name": "弥勒市"
                    }
                ]
            },
            {
                "adcode": "5304",
                "name": "玉溪市",
                "s": [
                    {
                        "adcode": "530499",
                        "name": "玉溪市市本级"
                    },
                    {
                        "adcode": "530402",
                        "name": "红塔区"
                    },
                    {
                        "adcode": "530421",
                        "name": "江川县"
                    },
                    {
                        "adcode": "530422",
                        "name": "澄江县"
                    },
                    {
                        "adcode": "530423",
                        "name": "通海县"
                    },
                    {
                        "adcode": "530424",
                        "name": "华宁县"
                    },
                    {
                        "adcode": "530425",
                        "name": "易门县"
                    },
                    {
                        "adcode": "530426",
                        "name": "峨山彝族自治县"
                    },
                    {
                        "adcode": "530427",
                        "name": "新平彝族傣族自治县"
                    },
                    {
                        "adcode": "530428",
                        "name": "元江哈尼族彝族傣族自治县"
                    },
                    {
                        "adcode": "530401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "530403",
                        "name": "江川区"
                    }
                ]
            },
            {
                "adcode": "5326",
                "name": "文山壮族苗族自治州",
                "s": [
                    {
                        "adcode": "532699",
                        "name": "文山壮族苗族自治州州本级"
                    },
                    {
                        "adcode": "532601",
                        "name": "文山市"
                    },
                    {
                        "adcode": "532621",
                        "name": "文山县"
                    },
                    {
                        "adcode": "532622",
                        "name": "砚山县"
                    },
                    {
                        "adcode": "532623",
                        "name": "西畴县"
                    },
                    {
                        "adcode": "532624",
                        "name": "麻栗坡县"
                    },
                    {
                        "adcode": "532625",
                        "name": "马关县"
                    },
                    {
                        "adcode": "532626",
                        "name": "丘北县"
                    },
                    {
                        "adcode": "532627",
                        "name": "广南县"
                    },
                    {
                        "adcode": "532628",
                        "name": "富宁县"
                    }
                ]
            },
            {
                "adcode": "5305",
                "name": "保山市",
                "s": [
                    {
                        "adcode": "530599",
                        "name": "保山市市本级"
                    },
                    {
                        "adcode": "530502",
                        "name": "隆阳区"
                    },
                    {
                        "adcode": "530521",
                        "name": "施甸县"
                    },
                    {
                        "adcode": "530522",
                        "name": "腾冲县"
                    },
                    {
                        "adcode": "530523",
                        "name": "龙陵县"
                    },
                    {
                        "adcode": "530524",
                        "name": "昌宁县"
                    },
                    {
                        "adcode": "530501",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "530581",
                        "name": "腾冲市"
                    }
                ]
            },
            {
                "adcode": "5306",
                "name": "昭通市",
                "s": [
                    {
                        "adcode": "530699",
                        "name": "昭通市市本级"
                    },
                    {
                        "adcode": "530602",
                        "name": "昭阳区"
                    },
                    {
                        "adcode": "530621",
                        "name": "鲁甸县"
                    },
                    {
                        "adcode": "530622",
                        "name": "巧家县"
                    },
                    {
                        "adcode": "530623",
                        "name": "盐津县"
                    },
                    {
                        "adcode": "530624",
                        "name": "大关县"
                    },
                    {
                        "adcode": "530625",
                        "name": "永善县"
                    },
                    {
                        "adcode": "530626",
                        "name": "绥江县"
                    },
                    {
                        "adcode": "530627",
                        "name": "镇雄县"
                    },
                    {
                        "adcode": "530628",
                        "name": "彝良县"
                    },
                    {
                        "adcode": "530629",
                        "name": "威信县"
                    },
                    {
                        "adcode": "530630",
                        "name": "水富县"
                    },
                    {
                        "adcode": "530601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "530681",
                        "name": "水富市"
                    }
                ]
            },
            {
                "adcode": "5328",
                "name": "西双版纳傣族自治州",
                "s": [
                    {
                        "adcode": "532899",
                        "name": "西双版纳傣族自治州州本级"
                    },
                    {
                        "adcode": "532801",
                        "name": "景洪市"
                    },
                    {
                        "adcode": "532822",
                        "name": "勐海县"
                    },
                    {
                        "adcode": "532823",
                        "name": "勐腊县"
                    }
                ]
            },
            {
                "adcode": "5307",
                "name": "丽江市",
                "s": [
                    {
                        "adcode": "530799",
                        "name": "丽江市市本级"
                    },
                    {
                        "adcode": "530702",
                        "name": "古城区"
                    },
                    {
                        "adcode": "530721",
                        "name": "玉龙纳西族自治县"
                    },
                    {
                        "adcode": "530722",
                        "name": "永胜县"
                    },
                    {
                        "adcode": "530723",
                        "name": "华坪县"
                    },
                    {
                        "adcode": "530724",
                        "name": "宁蒗彝族自治县"
                    },
                    {
                        "adcode": "530701",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5329",
                "name": "大理白族自治州",
                "s": [
                    {
                        "adcode": "532999",
                        "name": "大理白族自治州州本级"
                    },
                    {
                        "adcode": "532901",
                        "name": "大理市"
                    },
                    {
                        "adcode": "532922",
                        "name": "漾濞彝族自治县"
                    },
                    {
                        "adcode": "532923",
                        "name": "祥云县"
                    },
                    {
                        "adcode": "532924",
                        "name": "宾川县"
                    },
                    {
                        "adcode": "532925",
                        "name": "弥渡县"
                    },
                    {
                        "adcode": "532926",
                        "name": "南涧彝族自治县"
                    },
                    {
                        "adcode": "532927",
                        "name": "巍山彝族回族自治县"
                    },
                    {
                        "adcode": "532928",
                        "name": "永平县"
                    },
                    {
                        "adcode": "532929",
                        "name": "云龙县"
                    },
                    {
                        "adcode": "532930",
                        "name": "洱源县"
                    },
                    {
                        "adcode": "532931",
                        "name": "剑川县"
                    },
                    {
                        "adcode": "532932",
                        "name": "鹤庆县"
                    }
                ]
            },
            {
                "adcode": "5308",
                "name": "普洱市",
                "s": [
                    {
                        "adcode": "530899",
                        "name": "普洱市市本级"
                    },
                    {
                        "adcode": "530802",
                        "name": "思茅区"
                    },
                    {
                        "adcode": "530821",
                        "name": "宁洱哈尼族彝族自治县"
                    },
                    {
                        "adcode": "530822",
                        "name": "墨江哈尼族自治县"
                    },
                    {
                        "adcode": "530823",
                        "name": "景东彝族自治县"
                    },
                    {
                        "adcode": "530824",
                        "name": "景谷傣族彝族自治县"
                    },
                    {
                        "adcode": "530825",
                        "name": "镇沅彝族哈尼族拉祜族自治县"
                    },
                    {
                        "adcode": "530826",
                        "name": "江城哈尼族彝族自治县"
                    },
                    {
                        "adcode": "530827",
                        "name": "孟连傣族拉祜族佤族自治县"
                    },
                    {
                        "adcode": "530828",
                        "name": "澜沧拉祜族自治县"
                    },
                    {
                        "adcode": "530829",
                        "name": "西盟佤族自治县"
                    },
                    {
                        "adcode": "530801",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5309",
                "name": "临沧市",
                "s": [
                    {
                        "adcode": "530999",
                        "name": "临沧市市本级"
                    },
                    {
                        "adcode": "530902",
                        "name": "临翔区"
                    },
                    {
                        "adcode": "530921",
                        "name": "凤庆县"
                    },
                    {
                        "adcode": "530922",
                        "name": "云县"
                    },
                    {
                        "adcode": "530923",
                        "name": "永德县"
                    },
                    {
                        "adcode": "530924",
                        "name": "镇康县"
                    },
                    {
                        "adcode": "530925",
                        "name": "双江拉祜族佤族布朗族傣族自治县"
                    },
                    {
                        "adcode": "530926",
                        "name": "耿马傣族佤族自治县"
                    },
                    {
                        "adcode": "530927",
                        "name": "沧源佤族自治县"
                    },
                    {
                        "adcode": "530901",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "99",
        "name": "其他",
        "s": [
            {
                "adcode": "9900",
                "name": "保加利亚",
                "s": [
                    {
                        "adcode": "990359",
                        "name": "保加利亚"
                    },
                    {
                        "adcode": "990000",
                        "name": "塞尔维亚"
                    },
                    {
                        "adcode": "990213",
                        "name": "阿尔及利亚"
                    },
                    {
                        "adcode": "990045",
                        "name": "丹麦"
                    },
                    {
                        "adcode": "990098",
                        "name": "伊朗"
                    },
                    {
                        "adcode": "990965",
                        "name": "科威特"
                    },
                    {
                        "adcode": "990265",
                        "name": "马拉维"
                    },
                    {
                        "adcode": "990327",
                        "name": "哈萨克斯坦"
                    },
                    {
                        "adcode": "990000",
                        "name": "东帝汶"
                    },
                    {
                        "adcode": "990233",
                        "name": "乌兹别克斯坦"
                    },
                    {
                        "adcode": "990964",
                        "name": "伊拉克"
                    },
                    {
                        "adcode": "990000",
                        "name": "其它"
                    },
                    {
                        "adcode": "990091",
                        "name": "印度"
                    },
                    {
                        "adcode": "990062",
                        "name": "印度尼西亚"
                    },
                    {
                        "adcode": "990090",
                        "name": "土耳其"
                    },
                    {
                        "adcode": "990992",
                        "name": "塔吉克斯坦"
                    },
                    {
                        "adcode": "990880",
                        "name": "孟加拉国"
                    },
                    {
                        "adcode": "990977",
                        "name": "尼泊尔"
                    },
                    {
                        "adcode": "990092",
                        "name": "巴基斯坦"
                    },
                    {
                        "adcode": "990094",
                        "name": "斯里兰卡"
                    },
                    {
                        "adcode": "990065",
                        "name": "新加坡"
                    },
                    {
                        "adcode": "990081",
                        "name": "日本"
                    },
                    {
                        "adcode": "990855",
                        "name": "柬埔寨"
                    },
                    {
                        "adcode": "990966",
                        "name": "沙特阿拉伯"
                    },
                    {
                        "adcode": "990066",
                        "name": "泰国"
                    },
                    {
                        "adcode": "990095",
                        "name": "缅甸"
                    },
                    {
                        "adcode": "990856",
                        "name": "老挝"
                    },
                    {
                        "adcode": "990063",
                        "name": "菲律宾"
                    },
                    {
                        "adcode": "990084",
                        "name": "越南"
                    },
                    {
                        "adcode": "990093",
                        "name": "阿富汗"
                    },
                    {
                        "adcode": "990971",
                        "name": "阿拉伯联合酋长国"
                    },
                    {
                        "adcode": "990968",
                        "name": "阿曼"
                    },
                    {
                        "adcode": "990082",
                        "name": "韩国"
                    },
                    {
                        "adcode": "990060",
                        "name": "马来西亚"
                    },
                    {
                        "adcode": "990000",
                        "name": "其它"
                    },
                    {
                        "adcode": "990000",
                        "name": "其它"
                    },
                    {
                        "adcode": "990064",
                        "name": "新西兰"
                    },
                    {
                        "adcode": "990061",
                        "name": "澳大利亚"
                    },
                    {
                        "adcode": "990380",
                        "name": "乌克兰"
                    },
                    {
                        "adcode": "990000",
                        "name": "其它"
                    },
                    {
                        "adcode": "990036",
                        "name": "匈牙利"
                    },
                    {
                        "adcode": "990357",
                        "name": "塞浦路斯"
                    },
                    {
                        "adcode": "990043",
                        "name": "奥地利"
                    },
                    {
                        "adcode": "990030",
                        "name": "希腊"
                    },
                    {
                        "adcode": "990049",
                        "name": "德国"
                    },
                    {
                        "adcode": "990039",
                        "name": "意大利"
                    },
                    {
                        "adcode": "990033",
                        "name": "法国"
                    },
                    {
                        "adcode": "990353",
                        "name": "爱尔兰"
                    },
                    {
                        "adcode": "990041",
                        "name": "瑞士"
                    },
                    {
                        "adcode": "990044",
                        "name": "英国"
                    },
                    {
                        "adcode": "990031",
                        "name": "荷兰"
                    },
                    {
                        "adcode": "990351",
                        "name": "葡萄牙"
                    },
                    {
                        "adcode": "990034",
                        "name": "西班牙"
                    },
                    {
                        "adcode": "990335",
                        "name": "阿尔巴尼亚"
                    },
                    {
                        "adcode": "990000",
                        "name": "其它"
                    },
                    {
                        "adcode": "990002",
                        "name": "加拿大"
                    },
                    {
                        "adcode": "990053",
                        "name": "古巴"
                    },
                    {
                        "adcode": "990595",
                        "name": "巴拉圭"
                    },
                    {
                        "adcode": "990055",
                        "name": "巴西"
                    },
                    {
                        "adcode": "990056",
                        "name": "智利"
                    },
                    {
                        "adcode": "990001",
                        "name": "美国"
                    },
                    {
                        "adcode": "990054",
                        "name": "阿根廷"
                    },
                    {
                        "adcode": "990000",
                        "name": "阿鲁巴"
                    },
                    {
                        "adcode": "990256",
                        "name": "乌干达"
                    },
                    {
                        "adcode": "990000",
                        "name": "其它"
                    },
                    {
                        "adcode": "990242",
                        "name": "刚果"
                    },
                    {
                        "adcode": "990027",
                        "name": "南非"
                    },
                    {
                        "adcode": "990255",
                        "name": "坦桑尼亚"
                    },
                    {
                        "adcode": "990020",
                        "name": "埃及"
                    },
                    {
                        "adcode": "990251",
                        "name": "埃塞俄比亚"
                    },
                    {
                        "adcode": "990244",
                        "name": "安哥拉"
                    },
                    {
                        "adcode": "990234",
                        "name": "尼日利亚"
                    },
                    {
                        "adcode": "990212",
                        "name": "摩洛哥"
                    },
                    {
                        "adcode": "990263",
                        "name": "津巴布韦"
                    },
                    {
                        "adcode": "990254",
                        "name": "肯尼亚"
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": "民主刚果"
                    },
                    {
                        "adcode": "991876",
                        "name": "牙买加"
                    },
                    {
                        "adcode": "990235",
                        "name": "乍得"
                    },
                    {
                        "adcode": "990277",
                        "name": "加纳"
                    },
                    {
                        "adcode": "991246",
                        "name": "巴巴多斯"
                    },
                    {
                        "adcode": "990230",
                        "name": "毛里求斯"
                    },
                    {
                        "adcode": "990046",
                        "name": "瑞典"
                    },
                    {
                        "adcode": "990223",
                        "name": "马里"
                    },
                    {
                        "adcode": "990267",
                        "name": "博茨瓦纳"
                    },
                    {
                        "adcode": "990371",
                        "name": "拉脱维亚"
                    },
                    {
                        "adcode": "990228",
                        "name": "多哥"
                    },
                    {
                        "adcode": "990000",
                        "name": "帕劳"
                    },
                    {
                        "adcode": "990673",
                        "name": "文莱"
                    },
                    {
                        "adcode": "990974",
                        "name": "卡塔尔"
                    },
                    {
                        "adcode": "990962",
                        "name": "约旦"
                    },
                    {
                        "adcode": "990260",
                        "name": "赞比亚"
                    },
                    {
                        "adcode": "991242",
                        "name": "巴哈马"
                    },
                    {
                        "adcode": "990972",
                        "name": "以色列"
                    },
                    {
                        "adcode": "990679",
                        "name": "斐济"
                    },
                    {
                        "adcode": "990032",
                        "name": "比利时"
                    },
                    {
                        "adcode": "990000",
                        "name": "安圭拉"
                    },
                    {
                        "adcode": "990058",
                        "name": "委内瑞拉"
                    },
                    {
                        "adcode": "990007",
                        "name": "俄罗斯"
                    },
                    {
                        "adcode": "990358",
                        "name": "芬兰"
                    },
                    {
                        "adcode": "990221",
                        "name": "塞内加尔"
                    },
                    {
                        "adcode": "990047",
                        "name": "挪威"
                    },
                    {
                        "adcode": "990225",
                        "name": "科特迪瓦"
                    },
                    {
                        "adcode": "990040",
                        "name": "罗马尼亚"
                    },
                    {
                        "adcode": "990224",
                        "name": "几内亚"
                    },
                    {
                        "adcode": "990675",
                        "name": "巴布亚新几内亚"
                    },
                    {
                        "adcode": "990960",
                        "name": "马尔代夫"
                    },
                    {
                        "adcode": "990000",
                        "name": "毛里塔尼亚"
                    },
                    {
                        "adcode": "990375",
                        "name": "白俄罗斯"
                    },
                    {
                        "adcode": "990237",
                        "name": "喀麦隆"
                    },
                    {
                        "adcode": "990052",
                        "name": "墨西哥"
                    },
                    {
                        "adcode": "990258",
                        "name": "莫桑比克"
                    },
                    {
                        "adcode": "990000",
                        "name": "南乔治亚"
                    },
                    {
                        "adcode": "990226",
                        "name": "布基纳法索"
                    },
                    {
                        "adcode": "990373",
                        "name": "摩尔多瓦"
                    },
                    {
                        "adcode": "990048",
                        "name": "波兰"
                    },
                    {
                        "adcode": "990000",
                        "name": "奥兰群岛"
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990257",
                        "name": "布隆迪"
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    },
                    {
                        "adcode": "990000",
                        "name": ""
                    }
                ]
            }
        ]
    },
    {
        "adcode": "31",
        "name": "上海市",
        "s": [
            {
                "adcode": "310151",
                "name": "崇明区",
                "s": [
                    {
                        "adcode": "310151",
                        "name": "崇明区"
                    },
                    {
                        "adcode": "310230101",
                        "name": "城桥镇"
                    },
                    {
                        "adcode": "310230102",
                        "name": "堡镇"
                    },
                    {
                        "adcode": "310230103",
                        "name": "新河镇"
                    },
                    {
                        "adcode": "310230104",
                        "name": "庙镇"
                    },
                    {
                        "adcode": "310230106",
                        "name": "竖新镇"
                    },
                    {
                        "adcode": "310230107",
                        "name": "向化镇"
                    },
                    {
                        "adcode": "310230109",
                        "name": "三星镇"
                    },
                    {
                        "adcode": "310230113",
                        "name": "港沿镇"
                    },
                    {
                        "adcode": "310230114",
                        "name": "中兴镇"
                    },
                    {
                        "adcode": "310230115",
                        "name": "陈家镇"
                    },
                    {
                        "adcode": "310230116",
                        "name": "绿华镇"
                    },
                    {
                        "adcode": "310230118",
                        "name": "港西镇"
                    },
                    {
                        "adcode": "310230119",
                        "name": "建设镇"
                    },
                    {
                        "adcode": "310230121",
                        "name": "新海镇"
                    },
                    {
                        "adcode": "310230122",
                        "name": "东平镇"
                    },
                    {
                        "adcode": "310230123",
                        "name": "长兴镇"
                    },
                    {
                        "adcode": "310230201",
                        "name": "新村乡"
                    },
                    {
                        "adcode": "310230203",
                        "name": "横沙乡"
                    },
                    {
                        "adcode": "310230409",
                        "name": "前卫农场"
                    },
                    {
                        "adcode": "310230410",
                        "name": "东平林场"
                    },
                    {
                        "adcode": "310230501",
                        "name": "上实现代农业园区"
                    }
                ]
            },
            {
                "adcode": "310120",
                "name": "奉贤区",
                "s": [
                    {
                        "adcode": "310120101",
                        "name": "南桥镇"
                    },
                    {
                        "adcode": "310120102",
                        "name": "奉城镇"
                    },
                    {
                        "adcode": "310120104",
                        "name": "庄行镇"
                    },
                    {
                        "adcode": "310120106",
                        "name": "金汇镇"
                    },
                    {
                        "adcode": "310120109",
                        "name": "四团镇"
                    },
                    {
                        "adcode": "310120111",
                        "name": "青村镇"
                    },
                    {
                        "adcode": "310120118",
                        "name": "柘林镇"
                    },
                    {
                        "adcode": "310120123",
                        "name": "海湾镇"
                    },
                    {
                        "adcode": "310120501",
                        "name": "奉浦社区"
                    },
                    {
                        "adcode": "310120503",
                        "name": "上海市奉贤区海湾旅游区"
                    },
                    {
                        "adcode": "310120504",
                        "name": "金海社区"
                    },
                    {
                        "adcode": "310120505",
                        "name": "上海海港综合经济开发区"
                    },
                    {
                        "adcode": "310120",
                        "name": "奉贤区"
                    }
                ]
            },
            {
                "adcode": "310110",
                "name": "杨浦区",
                "s": [
                    {
                        "adcode": "310110001",
                        "name": "定海路街道"
                    },
                    {
                        "adcode": "310110006",
                        "name": "平凉路街道"
                    },
                    {
                        "adcode": "310110008",
                        "name": "江浦路街道"
                    },
                    {
                        "adcode": "310110009",
                        "name": "四平路街道"
                    },
                    {
                        "adcode": "310110012",
                        "name": "控江路街道"
                    },
                    {
                        "adcode": "310110013",
                        "name": "长白新村街道"
                    },
                    {
                        "adcode": "310110015",
                        "name": "延吉新村街道"
                    },
                    {
                        "adcode": "310110016",
                        "name": "殷行街道"
                    },
                    {
                        "adcode": "310110018",
                        "name": "大桥街道"
                    },
                    {
                        "adcode": "310110019",
                        "name": "五角场街道"
                    },
                    {
                        "adcode": "310110020",
                        "name": "新江湾城街道"
                    },
                    {
                        "adcode": "310110101",
                        "name": "五角场镇"
                    },
                    {
                        "adcode": "310110",
                        "name": "杨浦区"
                    }
                ]
            },
            {
                "adcode": "310101",
                "name": "黄浦区",
                "s": [
                    {
                        "adcode": "310101002",
                        "name": "南京东路街道"
                    },
                    {
                        "adcode": "310101013",
                        "name": "外滩街道"
                    },
                    {
                        "adcode": "310101015",
                        "name": "半淞园路街道"
                    },
                    {
                        "adcode": "310101017",
                        "name": "小东门街道"
                    },
                    {
                        "adcode": "310101018",
                        "name": "豫园街道"
                    },
                    {
                        "adcode": "310101019",
                        "name": "老西门街道"
                    },
                    {
                        "adcode": "310101020",
                        "name": "五里桥街道"
                    },
                    {
                        "adcode": "310101021",
                        "name": "打浦桥街道"
                    },
                    {
                        "adcode": "310101022",
                        "name": "淮海中路街道"
                    },
                    {
                        "adcode": "310101023",
                        "name": "瑞金二路街道"
                    },
                    {
                        "adcode": "310101",
                        "name": "黄浦区"
                    }
                ]
            },
            {
                "adcode": "310112",
                "name": "闵行区",
                "s": [
                    {
                        "adcode": "310112001",
                        "name": "江川路街道"
                    },
                    {
                        "adcode": "310112006",
                        "name": "古美街道"
                    },
                    {
                        "adcode": "310112008",
                        "name": "新虹街道"
                    },
                    {
                        "adcode": "310112101",
                        "name": "莘庄镇"
                    },
                    {
                        "adcode": "310112102",
                        "name": "七宝镇"
                    },
                    {
                        "adcode": "310112103",
                        "name": "颛桥镇"
                    },
                    {
                        "adcode": "310112106",
                        "name": "华漕镇"
                    },
                    {
                        "adcode": "310112107",
                        "name": "虹桥镇"
                    },
                    {
                        "adcode": "310112108",
                        "name": "梅陇镇"
                    },
                    {
                        "adcode": "310112110",
                        "name": "吴泾镇"
                    },
                    {
                        "adcode": "310112112",
                        "name": "马桥镇"
                    },
                    {
                        "adcode": "310112114",
                        "name": "浦江镇"
                    },
                    {
                        "adcode": "310112501",
                        "name": "莘庄工业区"
                    },
                    {
                        "adcode": "310112",
                        "name": "闵行区"
                    }
                ]
            },
            {
                "adcode": "310113",
                "name": "宝山区",
                "s": [
                    {
                        "adcode": "310113003",
                        "name": "友谊路街道"
                    },
                    {
                        "adcode": "310113007",
                        "name": "吴淞街道"
                    },
                    {
                        "adcode": "310113008",
                        "name": "张庙街道"
                    },
                    {
                        "adcode": "310113101",
                        "name": "罗店镇"
                    },
                    {
                        "adcode": "310113102",
                        "name": "大场镇"
                    },
                    {
                        "adcode": "310113103",
                        "name": "杨行镇"
                    },
                    {
                        "adcode": "310113104",
                        "name": "月浦镇"
                    },
                    {
                        "adcode": "310113106",
                        "name": "罗泾镇"
                    },
                    {
                        "adcode": "310113109",
                        "name": "顾村镇"
                    },
                    {
                        "adcode": "310113111",
                        "name": "高境镇"
                    },
                    {
                        "adcode": "310113112",
                        "name": "庙行镇"
                    },
                    {
                        "adcode": "310113113",
                        "name": "淞南镇"
                    },
                    {
                        "adcode": "310113501",
                        "name": "宝山城市工业园区"
                    },
                    {
                        "adcode": "310113",
                        "name": "宝山区"
                    }
                ]
            },
            {
                "adcode": "310114",
                "name": "嘉定区",
                "s": [
                    {
                        "adcode": "310114001",
                        "name": "新成路街道"
                    },
                    {
                        "adcode": "310114002",
                        "name": "真新街道"
                    },
                    {
                        "adcode": "310114003",
                        "name": "菊园新区管委会"
                    },
                    {
                        "adcode": "310114004",
                        "name": "嘉定镇街道"
                    },
                    {
                        "adcode": "310114102",
                        "name": "南翔镇"
                    },
                    {
                        "adcode": "310114103",
                        "name": "安亭镇"
                    },
                    {
                        "adcode": "310114106",
                        "name": "马陆镇"
                    },
                    {
                        "adcode": "310114109",
                        "name": "徐行镇"
                    },
                    {
                        "adcode": "310114111",
                        "name": "华亭镇"
                    },
                    {
                        "adcode": "310114114",
                        "name": "外冈镇"
                    },
                    {
                        "adcode": "310114118",
                        "name": "江桥镇"
                    },
                    {
                        "adcode": "310114501",
                        "name": "嘉定工业区"
                    },
                    {
                        "adcode": "310114",
                        "name": "嘉定区"
                    }
                ]
            },
            {
                "adcode": "310103",
                "name": "卢湾区",
                "s": [
                    {
                        "adcode": "310103",
                        "name": "卢湾区"
                    }
                ]
            },
            {
                "adcode": "310104",
                "name": "徐汇区",
                "s": [
                    {
                        "adcode": "310104003",
                        "name": "天平路街道"
                    },
                    {
                        "adcode": "310104004",
                        "name": "湖南路街道"
                    },
                    {
                        "adcode": "310104007",
                        "name": "斜土路街道"
                    },
                    {
                        "adcode": "310104008",
                        "name": "枫林路街道"
                    },
                    {
                        "adcode": "310104010",
                        "name": "长桥街道"
                    },
                    {
                        "adcode": "310104011",
                        "name": "田林街道"
                    },
                    {
                        "adcode": "310104012",
                        "name": "虹梅路街道"
                    },
                    {
                        "adcode": "310104013",
                        "name": "康健新村街道"
                    },
                    {
                        "adcode": "310104014",
                        "name": "徐家汇街道"
                    },
                    {
                        "adcode": "310104015",
                        "name": "凌云路街道"
                    },
                    {
                        "adcode": "310104016",
                        "name": "龙华街道"
                    },
                    {
                        "adcode": "310104017",
                        "name": "漕河泾街道"
                    },
                    {
                        "adcode": "310104103",
                        "name": "华泾镇"
                    },
                    {
                        "adcode": "310104501",
                        "name": "漕河泾新兴技术开发区"
                    },
                    {
                        "adcode": "310104",
                        "name": "徐汇区"
                    }
                ]
            },
            {
                "adcode": "310115",
                "name": "浦东新区",
                "s": [
                    {
                        "adcode": "310115004",
                        "name": "潍坊新村街道"
                    },
                    {
                        "adcode": "310115005",
                        "name": "陆家嘴街道"
                    },
                    {
                        "adcode": "310115007",
                        "name": "周家渡街道"
                    },
                    {
                        "adcode": "310115008",
                        "name": "塘桥街道"
                    },
                    {
                        "adcode": "310115009",
                        "name": "上钢新村街道"
                    },
                    {
                        "adcode": "310115010",
                        "name": "南码头路街道"
                    },
                    {
                        "adcode": "310115011",
                        "name": "沪东新村街道"
                    },
                    {
                        "adcode": "310115012",
                        "name": "金杨新村街道"
                    },
                    {
                        "adcode": "310115013",
                        "name": "洋泾街道"
                    },
                    {
                        "adcode": "310115014",
                        "name": "浦兴路街道"
                    },
                    {
                        "adcode": "310115015",
                        "name": "东明路街道"
                    },
                    {
                        "adcode": "310115016",
                        "name": "花木街道"
                    },
                    {
                        "adcode": "310115103",
                        "name": "川沙新镇"
                    },
                    {
                        "adcode": "310115104",
                        "name": "高桥镇"
                    },
                    {
                        "adcode": "310115105",
                        "name": "北蔡镇"
                    },
                    {
                        "adcode": "310115110",
                        "name": "合庆镇"
                    },
                    {
                        "adcode": "310115114",
                        "name": "唐镇"
                    },
                    {
                        "adcode": "310115117",
                        "name": "曹路镇"
                    },
                    {
                        "adcode": "310115120",
                        "name": "金桥镇"
                    },
                    {
                        "adcode": "310115121",
                        "name": "高行镇"
                    },
                    {
                        "adcode": "310115123",
                        "name": "高东镇"
                    },
                    {
                        "adcode": "310115125",
                        "name": "张江镇"
                    },
                    {
                        "adcode": "310115130",
                        "name": "三林镇"
                    },
                    {
                        "adcode": "310115131",
                        "name": "惠南镇"
                    },
                    {
                        "adcode": "310115132",
                        "name": "周浦镇"
                    },
                    {
                        "adcode": "310115133",
                        "name": "新场镇"
                    },
                    {
                        "adcode": "310115134",
                        "name": "大团镇"
                    },
                    {
                        "adcode": "310115136",
                        "name": "康桥镇"
                    },
                    {
                        "adcode": "310115137",
                        "name": "航头镇"
                    },
                    {
                        "adcode": "310115139",
                        "name": "祝桥镇"
                    },
                    {
                        "adcode": "310115140",
                        "name": "泥城镇"
                    },
                    {
                        "adcode": "310115141",
                        "name": "宣桥镇"
                    },
                    {
                        "adcode": "310115142",
                        "name": "书院镇"
                    },
                    {
                        "adcode": "310115143",
                        "name": "万祥镇"
                    },
                    {
                        "adcode": "310115144",
                        "name": "老港镇"
                    },
                    {
                        "adcode": "310115145",
                        "name": "南汇新城镇"
                    },
                    {
                        "adcode": "310115401",
                        "name": "芦潮港农场"
                    },
                    {
                        "adcode": "310115402",
                        "name": "东海农场"
                    },
                    {
                        "adcode": "310115403",
                        "name": "朝阳农场"
                    },
                    {
                        "adcode": "310115501",
                        "name": "外高桥保税区"
                    },
                    {
                        "adcode": "310115502",
                        "name": "金桥经济技术开发区"
                    },
                    {
                        "adcode": "310115503",
                        "name": "张江高科技园区"
                    },
                    {
                        "adcode": "310115",
                        "name": "浦东新区"
                    }
                ]
            },
            {
                "adcode": "310105",
                "name": "长宁区",
                "s": [
                    {
                        "adcode": "310105001",
                        "name": "华阳路街道"
                    },
                    {
                        "adcode": "310105002",
                        "name": "江苏路街道"
                    },
                    {
                        "adcode": "310105004",
                        "name": "新华路街道"
                    },
                    {
                        "adcode": "310105005",
                        "name": "周家桥街道"
                    },
                    {
                        "adcode": "310105006",
                        "name": "天山路街道"
                    },
                    {
                        "adcode": "310105008",
                        "name": "仙霞新村街道"
                    },
                    {
                        "adcode": "310105009",
                        "name": "虹桥街道"
                    },
                    {
                        "adcode": "310105010",
                        "name": "程家桥街道"
                    },
                    {
                        "adcode": "310105011",
                        "name": "北新泾街道"
                    },
                    {
                        "adcode": "310105102",
                        "name": "新泾镇"
                    },
                    {
                        "adcode": "310105",
                        "name": "长宁区"
                    }
                ]
            },
            {
                "adcode": "310116",
                "name": "金山区",
                "s": [
                    {
                        "adcode": "310116001",
                        "name": "石化街道"
                    },
                    {
                        "adcode": "310116101",
                        "name": "朱泾镇"
                    },
                    {
                        "adcode": "310116102",
                        "name": "枫泾镇"
                    },
                    {
                        "adcode": "310116103",
                        "name": "张堰镇"
                    },
                    {
                        "adcode": "310116104",
                        "name": "亭林镇"
                    },
                    {
                        "adcode": "310116105",
                        "name": "吕巷镇"
                    },
                    {
                        "adcode": "310116107",
                        "name": "廊下镇"
                    },
                    {
                        "adcode": "310116109",
                        "name": "金山卫镇"
                    },
                    {
                        "adcode": "310116112",
                        "name": "漕泾镇"
                    },
                    {
                        "adcode": "310116113",
                        "name": "山阳镇"
                    },
                    {
                        "adcode": "310116503",
                        "name": "金山工业区"
                    },
                    {
                        "adcode": "310116",
                        "name": "金山区"
                    }
                ]
            },
            {
                "adcode": "310106",
                "name": "静安区",
                "s": [
                    {
                        "adcode": "310106006",
                        "name": "江宁路街道"
                    },
                    {
                        "adcode": "310106011",
                        "name": "石门二路街道"
                    },
                    {
                        "adcode": "310106012",
                        "name": "南京西路街道"
                    },
                    {
                        "adcode": "310106013",
                        "name": "静安寺街道"
                    },
                    {
                        "adcode": "310106014",
                        "name": "曹家渡街道"
                    },
                    {
                        "adcode": "310106",
                        "name": "静安区"
                    }
                ]
            },
            {
                "adcode": "310117",
                "name": "松江区",
                "s": [
                    {
                        "adcode": "310117001",
                        "name": "岳阳街道"
                    },
                    {
                        "adcode": "310117002",
                        "name": "永丰街道"
                    },
                    {
                        "adcode": "310117003",
                        "name": "方松街道"
                    },
                    {
                        "adcode": "310117004",
                        "name": "中山街道"
                    },
                    {
                        "adcode": "310117102",
                        "name": "泗泾镇"
                    },
                    {
                        "adcode": "310117103",
                        "name": "佘山镇"
                    },
                    {
                        "adcode": "310117104",
                        "name": "车墩镇"
                    },
                    {
                        "adcode": "310117105",
                        "name": "新桥镇"
                    },
                    {
                        "adcode": "310117106",
                        "name": "洞泾镇"
                    },
                    {
                        "adcode": "310117107",
                        "name": "九亭镇"
                    },
                    {
                        "adcode": "310117109",
                        "name": "泖港镇"
                    },
                    {
                        "adcode": "310117116",
                        "name": "石湖荡镇"
                    },
                    {
                        "adcode": "310117117",
                        "name": "新浜镇"
                    },
                    {
                        "adcode": "310117120",
                        "name": "叶榭镇"
                    },
                    {
                        "adcode": "310117121",
                        "name": "小昆山镇"
                    },
                    {
                        "adcode": "310117501",
                        "name": "松江工业区"
                    },
                    {
                        "adcode": "310117504",
                        "name": "佘山度假区"
                    },
                    {
                        "adcode": "310117507",
                        "name": "上海松江出口加工区"
                    },
                    {
                        "adcode": "310117",
                        "name": "松江区"
                    }
                ]
            },
            {
                "adcode": "310107",
                "name": "普陀区",
                "s": [
                    {
                        "adcode": "310107005",
                        "name": "曹杨新村街道"
                    },
                    {
                        "adcode": "310107014",
                        "name": "长风新村街道"
                    },
                    {
                        "adcode": "310107015",
                        "name": "长寿路街道"
                    },
                    {
                        "adcode": "310107016",
                        "name": "甘泉路街道"
                    },
                    {
                        "adcode": "310107017",
                        "name": "石泉路街道"
                    },
                    {
                        "adcode": "310107020",
                        "name": "宜川路街道"
                    },
                    {
                        "adcode": "310107101",
                        "name": "真如镇"
                    },
                    {
                        "adcode": "310107102",
                        "name": "长征镇"
                    },
                    {
                        "adcode": "310107103",
                        "name": "桃浦镇"
                    },
                    {
                        "adcode": "310107",
                        "name": "普陀区"
                    }
                ]
            },
            {
                "adcode": "310118",
                "name": "青浦区",
                "s": [
                    {
                        "adcode": "310118001",
                        "name": "夏阳街道"
                    },
                    {
                        "adcode": "310118002",
                        "name": "盈浦街道"
                    },
                    {
                        "adcode": "310118003",
                        "name": "香花桥街道"
                    },
                    {
                        "adcode": "310118102",
                        "name": "朱家角镇"
                    },
                    {
                        "adcode": "310118103",
                        "name": "练塘镇"
                    },
                    {
                        "adcode": "310118104",
                        "name": "金泽镇"
                    },
                    {
                        "adcode": "310118105",
                        "name": "赵巷镇"
                    },
                    {
                        "adcode": "310118106",
                        "name": "徐泾镇"
                    },
                    {
                        "adcode": "310118107",
                        "name": "华新镇"
                    },
                    {
                        "adcode": "310118109",
                        "name": "重固镇"
                    },
                    {
                        "adcode": "310118110",
                        "name": "白鹤镇"
                    },
                    {
                        "adcode": "310118",
                        "name": "青浦区"
                    }
                ]
            },
            {
                "adcode": "310108",
                "name": "闸北区",
                "s": [
                    {
                        "adcode": "310108001",
                        "name": "天目西路街道"
                    },
                    {
                        "adcode": "310108006",
                        "name": "北站街道"
                    },
                    {
                        "adcode": "310108007",
                        "name": "宝山路街道"
                    },
                    {
                        "adcode": "310108012",
                        "name": "共和新路街道"
                    },
                    {
                        "adcode": "310108013",
                        "name": "大宁路街道"
                    },
                    {
                        "adcode": "310108014",
                        "name": "彭浦新村街道"
                    },
                    {
                        "adcode": "310108015",
                        "name": "临汾路街道"
                    },
                    {
                        "adcode": "310108016",
                        "name": "芷江西路街道"
                    },
                    {
                        "adcode": "310108101",
                        "name": "彭浦镇"
                    },
                    {
                        "adcode": "310108",
                        "name": "闸北区"
                    }
                ]
            },
            {
                "adcode": "310119",
                "name": "南汇区",
                "s": [
                    {
                        "adcode": "310119",
                        "name": "南汇区"
                    }
                ]
            },
            {
                "adcode": "310109",
                "name": "虹口区",
                "s": [
                    {
                        "adcode": "310109009",
                        "name": "欧阳路街道"
                    },
                    {
                        "adcode": "310109010",
                        "name": "曲阳路街道"
                    },
                    {
                        "adcode": "310109011",
                        "name": "广中路街道"
                    },
                    {
                        "adcode": "310109014",
                        "name": "嘉兴路街道"
                    },
                    {
                        "adcode": "310109016",
                        "name": "凉城新村街道"
                    },
                    {
                        "adcode": "310109017",
                        "name": "四川北路街道"
                    },
                    {
                        "adcode": "310109018",
                        "name": "提篮桥街道"
                    },
                    {
                        "adcode": "310109019",
                        "name": "江湾镇街道"
                    },
                    {
                        "adcode": "310109",
                        "name": "虹口区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "33",
        "name": "浙江省",
        "s": [
            {
                "adcode": "3307",
                "name": "金华市",
                "s": [
                    {
                        "adcode": "330799",
                        "name": "金华市市本级"
                    },
                    {
                        "adcode": "330702",
                        "name": "婺城区"
                    },
                    {
                        "adcode": "330703",
                        "name": "金东区"
                    },
                    {
                        "adcode": "330723",
                        "name": "武义县"
                    },
                    {
                        "adcode": "330726",
                        "name": "浦江县"
                    },
                    {
                        "adcode": "330727",
                        "name": "磐安县"
                    },
                    {
                        "adcode": "330781",
                        "name": "兰溪市"
                    },
                    {
                        "adcode": "330782",
                        "name": "义乌市"
                    },
                    {
                        "adcode": "330783",
                        "name": "东阳市"
                    },
                    {
                        "adcode": "330784",
                        "name": "永康市"
                    },
                    {
                        "adcode": "330701",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3306",
                "name": "绍兴市",
                "s": [
                    {
                        "adcode": "330699",
                        "name": "绍兴市市本级"
                    },
                    {
                        "adcode": "330602",
                        "name": "越城区"
                    },
                    {
                        "adcode": "330621",
                        "name": "绍兴县"
                    },
                    {
                        "adcode": "330624",
                        "name": "新昌县"
                    },
                    {
                        "adcode": "330681",
                        "name": "诸暨市"
                    },
                    {
                        "adcode": "330682",
                        "name": "上虞市"
                    },
                    {
                        "adcode": "330683",
                        "name": "嵊州市"
                    },
                    {
                        "adcode": "330601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "330603",
                        "name": "柯桥区"
                    },
                    {
                        "adcode": "330604",
                        "name": "上虞区"
                    }
                ]
            },
            {
                "adcode": "3305",
                "name": "湖州市",
                "s": [
                    {
                        "adcode": "330599",
                        "name": "湖州市市本级"
                    },
                    {
                        "adcode": "330502",
                        "name": "吴兴区"
                    },
                    {
                        "adcode": "330503",
                        "name": "南浔区"
                    },
                    {
                        "adcode": "330521",
                        "name": "德清县"
                    },
                    {
                        "adcode": "330522",
                        "name": "长兴县"
                    },
                    {
                        "adcode": "330523",
                        "name": "安吉县"
                    },
                    {
                        "adcode": "330501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3304",
                "name": "嘉兴市",
                "s": [
                    {
                        "adcode": "330499",
                        "name": "嘉兴市市本级"
                    },
                    {
                        "adcode": "330402",
                        "name": "南湖区"
                    },
                    {
                        "adcode": "330411",
                        "name": "秀洲区"
                    },
                    {
                        "adcode": "330421",
                        "name": "嘉善县"
                    },
                    {
                        "adcode": "330424",
                        "name": "海盐县"
                    },
                    {
                        "adcode": "330481",
                        "name": "海宁市"
                    },
                    {
                        "adcode": "330482",
                        "name": "平湖市"
                    },
                    {
                        "adcode": "330483",
                        "name": "桐乡市"
                    },
                    {
                        "adcode": "330401",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3303",
                "name": "温州市",
                "s": [
                    {
                        "adcode": "330399",
                        "name": "温州市市本级"
                    },
                    {
                        "adcode": "330302",
                        "name": "鹿城区"
                    },
                    {
                        "adcode": "330303",
                        "name": "龙湾区"
                    },
                    {
                        "adcode": "330304",
                        "name": "瓯海区"
                    },
                    {
                        "adcode": "330322",
                        "name": "洞头县"
                    },
                    {
                        "adcode": "330324",
                        "name": "永嘉县"
                    },
                    {
                        "adcode": "330326",
                        "name": "平阳县"
                    },
                    {
                        "adcode": "330327",
                        "name": "苍南县"
                    },
                    {
                        "adcode": "330328",
                        "name": "文成县"
                    },
                    {
                        "adcode": "330329",
                        "name": "泰顺县"
                    },
                    {
                        "adcode": "330340",
                        "name": "开发区"
                    },
                    {
                        "adcode": "330381",
                        "name": "瑞安市"
                    },
                    {
                        "adcode": "330382",
                        "name": "乐清市"
                    },
                    {
                        "adcode": "330301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "330305",
                        "name": "洞头区"
                    },
                    {
                        "adcode": "330371",
                        "name": "温州经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "3302",
                "name": "宁波市",
                "s": [
                    {
                        "adcode": "330299",
                        "name": "宁波市市本级"
                    },
                    {
                        "adcode": "330203",
                        "name": "海曙区"
                    },
                    {
                        "adcode": "330204",
                        "name": "江东区"
                    },
                    {
                        "adcode": "330205",
                        "name": "江北区"
                    },
                    {
                        "adcode": "330206",
                        "name": "北仑区"
                    },
                    {
                        "adcode": "330211",
                        "name": "镇海区"
                    },
                    {
                        "adcode": "330212",
                        "name": "鄞州区"
                    },
                    {
                        "adcode": "330225",
                        "name": "象山县"
                    },
                    {
                        "adcode": "330226",
                        "name": "宁海县"
                    },
                    {
                        "adcode": "330240",
                        "name": "东钱湖区"
                    },
                    {
                        "adcode": "330241",
                        "name": "开发区"
                    },
                    {
                        "adcode": "330242",
                        "name": "保税区"
                    },
                    {
                        "adcode": "330243",
                        "name": "大榭开发区"
                    },
                    {
                        "adcode": "330244",
                        "name": "科技院区"
                    },
                    {
                        "adcode": "330281",
                        "name": "余姚市"
                    },
                    {
                        "adcode": "330282",
                        "name": "慈溪市"
                    },
                    {
                        "adcode": "330283",
                        "name": "奉化市"
                    },
                    {
                        "adcode": "330201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "330213",
                        "name": "奉化区"
                    }
                ]
            },
            {
                "adcode": "3301",
                "name": "杭州市",
                "s": [
                    {
                        "adcode": "330114",
                        "name": "钱塘区"
                    },
                    {
                        "adcode": "330199",
                        "name": "杭州市市本级"
                    },
                    {
                        "adcode": "330102",
                        "name": "上城区"
                    },
                    {
                        "adcode": "330103",
                        "name": "下城区"
                    },
                    {
                        "adcode": "330104",
                        "name": "江干区"
                    },
                    {
                        "adcode": "330105",
                        "name": "拱墅区"
                    },
                    {
                        "adcode": "330106",
                        "name": "西湖区"
                    },
                    {
                        "adcode": "330108",
                        "name": "滨江区"
                    },
                    {
                        "adcode": "330109",
                        "name": "萧山区"
                    },
                    {
                        "adcode": "330110",
                        "name": "余杭区"
                    },
                    {
                        "adcode": "330122",
                        "name": "桐庐县"
                    },
                    {
                        "adcode": "330127",
                        "name": "淳安县"
                    },
                    {
                        "adcode": "330140",
                        "name": "大江东产业集聚区"
                    },
                    {
                        "adcode": "330141",
                        "name": "杭州市经济开发区"
                    },
                    {
                        "adcode": "330182",
                        "name": "建德市"
                    },
                    {
                        "adcode": "330183",
                        "name": "富阳市"
                    },
                    {
                        "adcode": "330185",
                        "name": "临安市"
                    },
                    {
                        "adcode": "330101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "330112",
                        "name": "临安区"
                    },
                    {
                        "adcode": "330111",
                        "name": "富阳区"
                    }
                ]
            },
            {
                "adcode": "3311",
                "name": "丽水市",
                "s": [
                    {
                        "adcode": "331199",
                        "name": "丽水市市本级"
                    },
                    {
                        "adcode": "331102",
                        "name": "莲都区"
                    },
                    {
                        "adcode": "331121",
                        "name": "青田县"
                    },
                    {
                        "adcode": "331122",
                        "name": "缙云县"
                    },
                    {
                        "adcode": "331123",
                        "name": "遂昌县"
                    },
                    {
                        "adcode": "331124",
                        "name": "松阳县"
                    },
                    {
                        "adcode": "331125",
                        "name": "云和县"
                    },
                    {
                        "adcode": "331126",
                        "name": "庆元县"
                    },
                    {
                        "adcode": "331127",
                        "name": "景宁畲族自治县"
                    },
                    {
                        "adcode": "331181",
                        "name": "龙泉市"
                    },
                    {
                        "adcode": "331101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3310",
                "name": "台州市",
                "s": [
                    {
                        "adcode": "331099",
                        "name": "台州市市本级"
                    },
                    {
                        "adcode": "331002",
                        "name": "椒江区"
                    },
                    {
                        "adcode": "331003",
                        "name": "黄岩区"
                    },
                    {
                        "adcode": "331004",
                        "name": "路桥区"
                    },
                    {
                        "adcode": "331021",
                        "name": "玉环县"
                    },
                    {
                        "adcode": "331022",
                        "name": "三门县"
                    },
                    {
                        "adcode": "331023",
                        "name": "天台县"
                    },
                    {
                        "adcode": "331024",
                        "name": "仙居县"
                    },
                    {
                        "adcode": "331081",
                        "name": "温岭市"
                    },
                    {
                        "adcode": "331082",
                        "name": "临海市"
                    },
                    {
                        "adcode": "331001",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "331083",
                        "name": "玉环市"
                    }
                ]
            },
            {
                "adcode": "3309",
                "name": "舟山市",
                "s": [
                    {
                        "adcode": "330999",
                        "name": "舟山市市本级"
                    },
                    {
                        "adcode": "330902",
                        "name": "定海区"
                    },
                    {
                        "adcode": "330903",
                        "name": "普陀区"
                    },
                    {
                        "adcode": "330921",
                        "name": "岱山县"
                    },
                    {
                        "adcode": "330922",
                        "name": "嵊泗县"
                    },
                    {
                        "adcode": "330901",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3308",
                "name": "衢州市",
                "s": [
                    {
                        "adcode": "330899",
                        "name": "衢州市市本级"
                    },
                    {
                        "adcode": "330802",
                        "name": "柯城区"
                    },
                    {
                        "adcode": "330803",
                        "name": "衢江区"
                    },
                    {
                        "adcode": "330822",
                        "name": "常山县"
                    },
                    {
                        "adcode": "330824",
                        "name": "开化县"
                    },
                    {
                        "adcode": "330825",
                        "name": "龙游县"
                    },
                    {
                        "adcode": "330881",
                        "name": "江山市"
                    },
                    {
                        "adcode": "330801",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "34",
        "name": "安徽省",
        "s": [
            {
                "adcode": "3406",
                "name": "淮北市",
                "s": [
                    {
                        "adcode": "340699",
                        "name": "淮北市市本级"
                    },
                    {
                        "adcode": "340602",
                        "name": "杜集区"
                    },
                    {
                        "adcode": "340603",
                        "name": "相山区"
                    },
                    {
                        "adcode": "340604",
                        "name": "烈山区"
                    },
                    {
                        "adcode": "340621",
                        "name": "濉溪县"
                    },
                    {
                        "adcode": "340601",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3417",
                "name": "池州市",
                "s": [
                    {
                        "adcode": "341799",
                        "name": "池州市市本级"
                    },
                    {
                        "adcode": "341702",
                        "name": "贵池区"
                    },
                    {
                        "adcode": "341721",
                        "name": "东至县"
                    },
                    {
                        "adcode": "341722",
                        "name": "石台县"
                    },
                    {
                        "adcode": "341723",
                        "name": "青阳县"
                    },
                    {
                        "adcode": "341740",
                        "name": "九华山风景区"
                    },
                    {
                        "adcode": "341701",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3405",
                "name": "马鞍山市",
                "s": [
                    {
                        "adcode": "340599",
                        "name": "马鞍山市市本级"
                    },
                    {
                        "adcode": "340502",
                        "name": "金家庄区"
                    },
                    {
                        "adcode": "340503",
                        "name": "花山区"
                    },
                    {
                        "adcode": "340504",
                        "name": "雨山区"
                    },
                    {
                        "adcode": "340506",
                        "name": "博望区"
                    },
                    {
                        "adcode": "340521",
                        "name": "当涂县"
                    },
                    {
                        "adcode": "340522",
                        "name": "含山县"
                    },
                    {
                        "adcode": "340523",
                        "name": "和县"
                    },
                    {
                        "adcode": "340501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3416",
                "name": "亳州市",
                "s": [
                    {
                        "adcode": "341699",
                        "name": "亳州市市本级"
                    },
                    {
                        "adcode": "341602",
                        "name": "谯城区"
                    },
                    {
                        "adcode": "341621",
                        "name": "涡阳县"
                    },
                    {
                        "adcode": "341622",
                        "name": "蒙城县"
                    },
                    {
                        "adcode": "341623",
                        "name": "利辛县"
                    },
                    {
                        "adcode": "341601",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3404",
                "name": "淮南市",
                "s": [
                    {
                        "adcode": "340499",
                        "name": "淮南市市本级"
                    },
                    {
                        "adcode": "340402",
                        "name": "大通区"
                    },
                    {
                        "adcode": "340403",
                        "name": "田家庵区"
                    },
                    {
                        "adcode": "340404",
                        "name": "谢家集区"
                    },
                    {
                        "adcode": "340405",
                        "name": "八公山区"
                    },
                    {
                        "adcode": "340406",
                        "name": "潘集区"
                    },
                    {
                        "adcode": "340421",
                        "name": "凤台县"
                    },
                    {
                        "adcode": "340422",
                        "name": "寿县"
                    },
                    {
                        "adcode": "340401",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3415",
                "name": "六安市",
                "s": [
                    {
                        "adcode": "341599",
                        "name": "六安市市本级"
                    },
                    {
                        "adcode": "341502",
                        "name": "金安区"
                    },
                    {
                        "adcode": "341503",
                        "name": "裕安区"
                    },
                    {
                        "adcode": "341504",
                        "name": "叶集区"
                    },
                    {
                        "adcode": "341521",
                        "name": "寿县"
                    },
                    {
                        "adcode": "341522",
                        "name": "霍邱县"
                    },
                    {
                        "adcode": "341523",
                        "name": "舒城县"
                    },
                    {
                        "adcode": "341524",
                        "name": "金寨县"
                    },
                    {
                        "adcode": "341525",
                        "name": "霍山县"
                    },
                    {
                        "adcode": "341540",
                        "name": "叶集改革发展实验区"
                    },
                    {
                        "adcode": "341501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3403",
                "name": "蚌埠市",
                "s": [
                    {
                        "adcode": "340399",
                        "name": "蚌埠市市本级"
                    },
                    {
                        "adcode": "340302",
                        "name": "龙子湖区"
                    },
                    {
                        "adcode": "340303",
                        "name": "蚌山区"
                    },
                    {
                        "adcode": "340304",
                        "name": "禹会区"
                    },
                    {
                        "adcode": "340311",
                        "name": "淮上区"
                    },
                    {
                        "adcode": "340321",
                        "name": "怀远县"
                    },
                    {
                        "adcode": "340322",
                        "name": "五河县"
                    },
                    {
                        "adcode": "340323",
                        "name": "固镇县"
                    },
                    {
                        "adcode": "340340",
                        "name": "蚌埠经济开发区"
                    },
                    {
                        "adcode": "340341",
                        "name": "蚌埠高新技术产业开发区"
                    },
                    {
                        "adcode": "340301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "340372",
                        "name": "蚌埠市经济开发区"
                    },
                    {
                        "adcode": "340371",
                        "name": "蚌埠市高新技术开发区"
                    }
                ]
            },
            {
                "adcode": "3414",
                "name": "巢湖市",
                "s": [
                    {
                        "adcode": "341499",
                        "name": "巢湖市市本级"
                    },
                    {
                        "adcode": "341402",
                        "name": "居巢区"
                    },
                    {
                        "adcode": "341421",
                        "name": "庐江县"
                    },
                    {
                        "adcode": "341422",
                        "name": "无为县"
                    },
                    {
                        "adcode": "341423",
                        "name": "含山县"
                    },
                    {
                        "adcode": "341424",
                        "name": "和县"
                    }
                ]
            },
            {
                "adcode": "3402",
                "name": "芜湖市",
                "s": [
                    {
                        "adcode": "340299",
                        "name": "芜湖市市本级"
                    },
                    {
                        "adcode": "340202",
                        "name": "镜湖区"
                    },
                    {
                        "adcode": "340203",
                        "name": "弋江区"
                    },
                    {
                        "adcode": "340207",
                        "name": "鸠江区"
                    },
                    {
                        "adcode": "340208",
                        "name": "三山区"
                    },
                    {
                        "adcode": "340221",
                        "name": "芜湖县"
                    },
                    {
                        "adcode": "340222",
                        "name": "繁昌县"
                    },
                    {
                        "adcode": "340223",
                        "name": "南陵县"
                    },
                    {
                        "adcode": "340225",
                        "name": "无为县"
                    },
                    {
                        "adcode": "340240",
                        "name": "芜湖经济技术开发区"
                    },
                    {
                        "adcode": "340201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3413",
                "name": "宿州市",
                "s": [
                    {
                        "adcode": "341399",
                        "name": "宿州市市本级"
                    },
                    {
                        "adcode": "341302",
                        "name": "埇桥区"
                    },
                    {
                        "adcode": "341321",
                        "name": "砀山县"
                    },
                    {
                        "adcode": "341322",
                        "name": "萧县"
                    },
                    {
                        "adcode": "341323",
                        "name": "灵璧县"
                    },
                    {
                        "adcode": "341324",
                        "name": "泗县"
                    },
                    {
                        "adcode": "341301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "341372",
                        "name": "宿州经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "3401",
                "name": "合肥市",
                "s": [
                    {
                        "adcode": "340199",
                        "name": "合肥市市本级"
                    },
                    {
                        "adcode": "340102",
                        "name": "瑶海区"
                    },
                    {
                        "adcode": "340103",
                        "name": "庐阳区"
                    },
                    {
                        "adcode": "340104",
                        "name": "蜀山区"
                    },
                    {
                        "adcode": "340111",
                        "name": "包河区"
                    },
                    {
                        "adcode": "340121",
                        "name": "长丰县"
                    },
                    {
                        "adcode": "340122",
                        "name": "肥东县"
                    },
                    {
                        "adcode": "340123",
                        "name": "肥西县"
                    },
                    {
                        "adcode": "340124",
                        "name": "庐江县"
                    },
                    {
                        "adcode": "340140",
                        "name": "高新技术产业开发区"
                    },
                    {
                        "adcode": "340141",
                        "name": "经济技术开发区"
                    },
                    {
                        "adcode": "340142",
                        "name": "新站综合开发实验区"
                    },
                    {
                        "adcode": "340181",
                        "name": "巢湖市"
                    },
                    {
                        "adcode": "340101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "340173",
                        "name": "合肥新站高新技术产业开发区"
                    },
                    {
                        "adcode": "340172",
                        "name": "合肥经济技术开发区"
                    },
                    {
                        "adcode": "340171",
                        "name": "合肥高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "3412",
                "name": "阜阳市",
                "s": [
                    {
                        "adcode": "341299",
                        "name": "阜阳市市本级"
                    },
                    {
                        "adcode": "341202",
                        "name": "颍州区"
                    },
                    {
                        "adcode": "341203",
                        "name": "颍东区"
                    },
                    {
                        "adcode": "341204",
                        "name": "颍泉区"
                    },
                    {
                        "adcode": "341221",
                        "name": "临泉县"
                    },
                    {
                        "adcode": "341222",
                        "name": "太和县"
                    },
                    {
                        "adcode": "341225",
                        "name": "阜南县"
                    },
                    {
                        "adcode": "341226",
                        "name": "颍上县"
                    },
                    {
                        "adcode": "341282",
                        "name": "界首市"
                    },
                    {
                        "adcode": "341201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "341271",
                        "name": "阜阳合肥现代产业园区"
                    },
                    {
                        "adcode": "341272",
                        "name": "阜阳经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "3411",
                "name": "滁州市",
                "s": [
                    {
                        "adcode": "341199",
                        "name": "滁州市市本级"
                    },
                    {
                        "adcode": "341102",
                        "name": "琅琊区"
                    },
                    {
                        "adcode": "341103",
                        "name": "南谯区"
                    },
                    {
                        "adcode": "341122",
                        "name": "来安县"
                    },
                    {
                        "adcode": "341124",
                        "name": "全椒县"
                    },
                    {
                        "adcode": "341125",
                        "name": "定远县"
                    },
                    {
                        "adcode": "341126",
                        "name": "凤阳县"
                    },
                    {
                        "adcode": "341181",
                        "name": "天长市"
                    },
                    {
                        "adcode": "341182",
                        "name": "明光市"
                    },
                    {
                        "adcode": "341101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3410",
                "name": "黄山市",
                "s": [
                    {
                        "adcode": "341099",
                        "name": "黄山市市本级"
                    },
                    {
                        "adcode": "341002",
                        "name": "屯溪区"
                    },
                    {
                        "adcode": "341003",
                        "name": "黄山区"
                    },
                    {
                        "adcode": "341004",
                        "name": "徽州区"
                    },
                    {
                        "adcode": "341021",
                        "name": "歙县"
                    },
                    {
                        "adcode": "341022",
                        "name": "休宁县"
                    },
                    {
                        "adcode": "341023",
                        "name": "黟县"
                    },
                    {
                        "adcode": "341024",
                        "name": "祁门县"
                    },
                    {
                        "adcode": "341001",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3408",
                "name": "安庆市",
                "s": [
                    {
                        "adcode": "340882",
                        "name": "潜山市"
                    },
                    {
                        "adcode": "340899",
                        "name": "安庆市市本级"
                    },
                    {
                        "adcode": "340802",
                        "name": "迎江区"
                    },
                    {
                        "adcode": "340803",
                        "name": "大观区"
                    },
                    {
                        "adcode": "340811",
                        "name": "宜秀区"
                    },
                    {
                        "adcode": "340822",
                        "name": "怀宁县"
                    },
                    {
                        "adcode": "340823",
                        "name": "枞阳县"
                    },
                    {
                        "adcode": "340824",
                        "name": "潜山县"
                    },
                    {
                        "adcode": "340825",
                        "name": "太湖县"
                    },
                    {
                        "adcode": "340826",
                        "name": "宿松县"
                    },
                    {
                        "adcode": "340827",
                        "name": "望江县"
                    },
                    {
                        "adcode": "340828",
                        "name": "岳西县"
                    },
                    {
                        "adcode": "340881",
                        "name": "桐城市"
                    },
                    {
                        "adcode": "340840",
                        "name": "安庆经济技术开发区"
                    },
                    {
                        "adcode": "340801",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "340871",
                        "name": "安徽安庆经济开发区"
                    }
                ]
            },
            {
                "adcode": "3407",
                "name": "铜陵市",
                "s": [
                    {
                        "adcode": "340799",
                        "name": "铜陵市市本级"
                    },
                    {
                        "adcode": "340702",
                        "name": "铜官山区"
                    },
                    {
                        "adcode": "340703",
                        "name": "狮子山区"
                    },
                    {
                        "adcode": "340705",
                        "name": "铜官区"
                    },
                    {
                        "adcode": "340706",
                        "name": "义安区"
                    },
                    {
                        "adcode": "340711",
                        "name": "郊区"
                    },
                    {
                        "adcode": "340721",
                        "name": "铜陵县"
                    },
                    {
                        "adcode": "340722",
                        "name": "枞阳县"
                    },
                    {
                        "adcode": "340701",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3418",
                "name": "宣城市",
                "s": [
                    {
                        "adcode": "341899",
                        "name": "宣城市市本级"
                    },
                    {
                        "adcode": "341802",
                        "name": "宣州区"
                    },
                    {
                        "adcode": "341821",
                        "name": "郎溪县"
                    },
                    {
                        "adcode": "341822",
                        "name": "广德县"
                    },
                    {
                        "adcode": "341823",
                        "name": "泾县"
                    },
                    {
                        "adcode": "341824",
                        "name": "绩溪县"
                    },
                    {
                        "adcode": "341825",
                        "name": "旌德县"
                    },
                    {
                        "adcode": "341881",
                        "name": "宁国市"
                    },
                    {
                        "adcode": "341801",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "35",
        "name": "福建省",
        "s": [
            {
                "adcode": "3505",
                "name": "泉州市",
                "s": [
                    {
                        "adcode": "350599",
                        "name": "泉州市市本级"
                    },
                    {
                        "adcode": "350502",
                        "name": "鲤城区"
                    },
                    {
                        "adcode": "350503",
                        "name": "丰泽区"
                    },
                    {
                        "adcode": "350504",
                        "name": "洛江区"
                    },
                    {
                        "adcode": "350505",
                        "name": "泉港区"
                    },
                    {
                        "adcode": "350521",
                        "name": "惠安县"
                    },
                    {
                        "adcode": "350524",
                        "name": "安溪县"
                    },
                    {
                        "adcode": "350525",
                        "name": "永春县"
                    },
                    {
                        "adcode": "350526",
                        "name": "德化县"
                    },
                    {
                        "adcode": "350527",
                        "name": "金门县"
                    },
                    {
                        "adcode": "350540",
                        "name": "泉州台商投资区"
                    },
                    {
                        "adcode": "350581",
                        "name": "石狮市"
                    },
                    {
                        "adcode": "350582",
                        "name": "晋江市"
                    },
                    {
                        "adcode": "350583",
                        "name": "南安市"
                    },
                    {
                        "adcode": "350501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3504",
                "name": "三明市",
                "s": [
                    {
                        "adcode": "350499",
                        "name": "三明市市本级"
                    },
                    {
                        "adcode": "350402",
                        "name": "梅列区"
                    },
                    {
                        "adcode": "350403",
                        "name": "三元区"
                    },
                    {
                        "adcode": "350421",
                        "name": "明溪县"
                    },
                    {
                        "adcode": "350423",
                        "name": "清流县"
                    },
                    {
                        "adcode": "350424",
                        "name": "宁化县"
                    },
                    {
                        "adcode": "350425",
                        "name": "大田县"
                    },
                    {
                        "adcode": "350426",
                        "name": "尤溪县"
                    },
                    {
                        "adcode": "350427",
                        "name": "沙县"
                    },
                    {
                        "adcode": "350428",
                        "name": "将乐县"
                    },
                    {
                        "adcode": "350429",
                        "name": "泰宁县"
                    },
                    {
                        "adcode": "350430",
                        "name": "建宁县"
                    },
                    {
                        "adcode": "350481",
                        "name": "永安市"
                    },
                    {
                        "adcode": "350401",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3503",
                "name": "莆田市",
                "s": [
                    {
                        "adcode": "350399",
                        "name": "莆田市市本级"
                    },
                    {
                        "adcode": "350302",
                        "name": "城厢区（市直属）"
                    },
                    {
                        "adcode": "350303",
                        "name": "涵江区"
                    },
                    {
                        "adcode": "350304",
                        "name": "荔城区"
                    },
                    {
                        "adcode": "350305",
                        "name": "秀屿区"
                    },
                    {
                        "adcode": "350322",
                        "name": "仙游县"
                    },
                    {
                        "adcode": "350340",
                        "name": "湄洲岛"
                    },
                    {
                        "adcode": "350341",
                        "name": "湄洲湾北岸"
                    },
                    {
                        "adcode": "350301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "350302",
                        "name": "城厢区"
                    }
                ]
            },
            {
                "adcode": "3502",
                "name": "厦门市",
                "s": [
                    {
                        "adcode": "350299",
                        "name": "厦门市市本级"
                    },
                    {
                        "adcode": "350203",
                        "name": "思明区"
                    },
                    {
                        "adcode": "350205",
                        "name": "海沧区"
                    },
                    {
                        "adcode": "350206",
                        "name": "湖里区"
                    },
                    {
                        "adcode": "350211",
                        "name": "集美区"
                    },
                    {
                        "adcode": "350212",
                        "name": "同安区"
                    },
                    {
                        "adcode": "350213",
                        "name": "翔安区"
                    },
                    {
                        "adcode": "350201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3501",
                "name": "福州市",
                "s": [
                    {
                        "adcode": "350199",
                        "name": "福州市市本级"
                    },
                    {
                        "adcode": "350102",
                        "name": "鼓楼区"
                    },
                    {
                        "adcode": "350103",
                        "name": "台江区"
                    },
                    {
                        "adcode": "350104",
                        "name": "仓山区"
                    },
                    {
                        "adcode": "350111",
                        "name": "晋安区"
                    },
                    {
                        "adcode": "350121",
                        "name": "闽侯县"
                    },
                    {
                        "adcode": "350122",
                        "name": "连江县"
                    },
                    {
                        "adcode": "350123",
                        "name": "罗源县"
                    },
                    {
                        "adcode": "350124",
                        "name": "闽清县"
                    },
                    {
                        "adcode": "350125",
                        "name": "永泰县"
                    },
                    {
                        "adcode": "350128",
                        "name": "平潭县"
                    },
                    {
                        "adcode": "350181",
                        "name": "福清市"
                    },
                    {
                        "adcode": "350182",
                        "name": "长乐市"
                    },
                    {
                        "adcode": "350101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "350105",
                        "name": "马尾区"
                    },
                    {
                        "adcode": "350112",
                        "name": "长乐区"
                    }
                ]
            },
            {
                "adcode": "3509",
                "name": "宁德市",
                "s": [
                    {
                        "adcode": "350999",
                        "name": "宁德市市本级"
                    },
                    {
                        "adcode": "350902",
                        "name": "蕉城区"
                    },
                    {
                        "adcode": "350921",
                        "name": "霞浦县"
                    },
                    {
                        "adcode": "350922",
                        "name": "古田县"
                    },
                    {
                        "adcode": "350923",
                        "name": "屏南县"
                    },
                    {
                        "adcode": "350924",
                        "name": "寿宁县"
                    },
                    {
                        "adcode": "350925",
                        "name": "周宁县"
                    },
                    {
                        "adcode": "350926",
                        "name": "柘荣县"
                    },
                    {
                        "adcode": "350981",
                        "name": "福安市"
                    },
                    {
                        "adcode": "350982",
                        "name": "福鼎市"
                    },
                    {
                        "adcode": "350901",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3508",
                "name": "龙岩市",
                "s": [
                    {
                        "adcode": "350899",
                        "name": "龙岩市市本级"
                    },
                    {
                        "adcode": "350802",
                        "name": "新罗区"
                    },
                    {
                        "adcode": "350821",
                        "name": "长汀县"
                    },
                    {
                        "adcode": "350822",
                        "name": "永定县"
                    },
                    {
                        "adcode": "350823",
                        "name": "上杭县"
                    },
                    {
                        "adcode": "350824",
                        "name": "武平县"
                    },
                    {
                        "adcode": "350825",
                        "name": "连城县"
                    },
                    {
                        "adcode": "350881",
                        "name": "漳平市"
                    },
                    {
                        "adcode": "350801",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "350803",
                        "name": "永定区"
                    }
                ]
            },
            {
                "adcode": "3507",
                "name": "南平市",
                "s": [
                    {
                        "adcode": "350799",
                        "name": "南平市市本级"
                    },
                    {
                        "adcode": "350702",
                        "name": "延平区"
                    },
                    {
                        "adcode": "350721",
                        "name": "顺昌县"
                    },
                    {
                        "adcode": "350722",
                        "name": "浦城县"
                    },
                    {
                        "adcode": "350723",
                        "name": "光泽县"
                    },
                    {
                        "adcode": "350724",
                        "name": "松溪县"
                    },
                    {
                        "adcode": "350725",
                        "name": "政和县"
                    },
                    {
                        "adcode": "350781",
                        "name": "邵武市"
                    },
                    {
                        "adcode": "350782",
                        "name": "武夷山市"
                    },
                    {
                        "adcode": "350783",
                        "name": "建瓯市"
                    },
                    {
                        "adcode": "350784",
                        "name": "建阳市"
                    },
                    {
                        "adcode": "350701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "350703",
                        "name": "建阳区"
                    }
                ]
            },
            {
                "adcode": "3506",
                "name": "漳州市",
                "s": [
                    {
                        "adcode": "350699",
                        "name": "漳州市市本级"
                    },
                    {
                        "adcode": "350602",
                        "name": "芗城区"
                    },
                    {
                        "adcode": "350603",
                        "name": "龙文区"
                    },
                    {
                        "adcode": "350622",
                        "name": "云霄县"
                    },
                    {
                        "adcode": "350623",
                        "name": "漳浦县"
                    },
                    {
                        "adcode": "350624",
                        "name": "诏安县"
                    },
                    {
                        "adcode": "350625",
                        "name": "长泰县"
                    },
                    {
                        "adcode": "350626",
                        "name": "东山县"
                    },
                    {
                        "adcode": "350627",
                        "name": "南靖县"
                    },
                    {
                        "adcode": "350628",
                        "name": "平和县"
                    },
                    {
                        "adcode": "350629",
                        "name": "华安县"
                    },
                    {
                        "adcode": "350640",
                        "name": "常山开发区"
                    },
                    {
                        "adcode": "350681",
                        "name": "龙海市"
                    },
                    {
                        "adcode": "350641",
                        "name": "漳州招商局经济技术开发区"
                    },
                    {
                        "adcode": "350642",
                        "name": "漳州台商投资区"
                    },
                    {
                        "adcode": "350601",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "54",
        "name": "西藏自治区",
        "s": [
            {
                "adcode": "5421",
                "name": "昌都地区",
                "s": [
                    {
                        "adcode": "542199",
                        "name": "昌都地区本级"
                    },
                    {
                        "adcode": "542121",
                        "name": "昌都县"
                    },
                    {
                        "adcode": "542122",
                        "name": "江达县"
                    },
                    {
                        "adcode": "542123",
                        "name": "贡觉县"
                    },
                    {
                        "adcode": "542124",
                        "name": "类乌齐县"
                    },
                    {
                        "adcode": "542125",
                        "name": "丁青县"
                    },
                    {
                        "adcode": "542126",
                        "name": "察雅县"
                    },
                    {
                        "adcode": "542127",
                        "name": "八宿县"
                    },
                    {
                        "adcode": "542128",
                        "name": "左贡县"
                    },
                    {
                        "adcode": "542129",
                        "name": "芒康县"
                    },
                    {
                        "adcode": "542132",
                        "name": "洛隆县"
                    },
                    {
                        "adcode": "542133",
                        "name": "边坝县"
                    }
                ]
            },
            {
                "adcode": "5422",
                "name": "山南地区",
                "s": [
                    {
                        "adcode": "542299",
                        "name": "山南地区本级"
                    },
                    {
                        "adcode": "542221",
                        "name": "乃东县"
                    },
                    {
                        "adcode": "542222",
                        "name": "扎囊县"
                    },
                    {
                        "adcode": "542223",
                        "name": "贡嘎县"
                    },
                    {
                        "adcode": "542224",
                        "name": "桑日县"
                    },
                    {
                        "adcode": "542225",
                        "name": "琼结县"
                    },
                    {
                        "adcode": "542226",
                        "name": "曲松县"
                    },
                    {
                        "adcode": "542227",
                        "name": "措美县"
                    },
                    {
                        "adcode": "542228",
                        "name": "洛扎县"
                    },
                    {
                        "adcode": "542229",
                        "name": "加查县"
                    },
                    {
                        "adcode": "542231",
                        "name": "隆子县"
                    },
                    {
                        "adcode": "542232",
                        "name": "错那县"
                    },
                    {
                        "adcode": "542233",
                        "name": "浪卡子县"
                    }
                ]
            },
            {
                "adcode": "5401",
                "name": "拉萨市",
                "s": [
                    {
                        "adcode": "540199",
                        "name": "拉萨市市本级"
                    },
                    {
                        "adcode": "540102",
                        "name": "城关区"
                    },
                    {
                        "adcode": "540121",
                        "name": "林周县"
                    },
                    {
                        "adcode": "540122",
                        "name": "当雄县"
                    },
                    {
                        "adcode": "540123",
                        "name": "尼木县"
                    },
                    {
                        "adcode": "540124",
                        "name": "曲水县"
                    },
                    {
                        "adcode": "540125",
                        "name": "堆龙德庆县"
                    },
                    {
                        "adcode": "540126",
                        "name": "达孜县"
                    },
                    {
                        "adcode": "540127",
                        "name": "墨竹工卡县"
                    },
                    {
                        "adcode": "540101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "540103",
                        "name": "堆龙德庆区"
                    },
                    {
                        "adcode": "540172",
                        "name": "拉萨经济技术开发区"
                    },
                    {
                        "adcode": "540104",
                        "name": "达孜区"
                    }
                ]
            },
            {
                "adcode": "5423",
                "name": "日喀则地区",
                "s": [
                    {
                        "adcode": "542399",
                        "name": "日喀则地区本级"
                    },
                    {
                        "adcode": "542301",
                        "name": "日喀则市"
                    },
                    {
                        "adcode": "542322",
                        "name": "南木林县"
                    },
                    {
                        "adcode": "542323",
                        "name": "江孜县"
                    },
                    {
                        "adcode": "542324",
                        "name": "定日县"
                    },
                    {
                        "adcode": "542325",
                        "name": "萨迦县"
                    },
                    {
                        "adcode": "542326",
                        "name": "拉孜县"
                    },
                    {
                        "adcode": "542327",
                        "name": "昂仁县"
                    },
                    {
                        "adcode": "542328",
                        "name": "谢通门县"
                    },
                    {
                        "adcode": "542329",
                        "name": "白朗县"
                    },
                    {
                        "adcode": "542330",
                        "name": "仁布县"
                    },
                    {
                        "adcode": "542331",
                        "name": "康马县"
                    },
                    {
                        "adcode": "542332",
                        "name": "定结县"
                    },
                    {
                        "adcode": "542333",
                        "name": "仲巴县"
                    },
                    {
                        "adcode": "542334",
                        "name": "亚东县"
                    },
                    {
                        "adcode": "542335",
                        "name": "吉隆县"
                    },
                    {
                        "adcode": "542336",
                        "name": "聂拉木县"
                    },
                    {
                        "adcode": "542337",
                        "name": "萨嘎县"
                    },
                    {
                        "adcode": "542338",
                        "name": "岗巴县"
                    }
                ]
            },
            {
                "adcode": "5424",
                "name": "那曲地区",
                "s": [
                    {
                        "adcode": "542499",
                        "name": "那曲地区本级"
                    },
                    {
                        "adcode": "542421",
                        "name": "那曲县"
                    },
                    {
                        "adcode": "542422",
                        "name": "嘉黎县"
                    },
                    {
                        "adcode": "542423",
                        "name": "比如县"
                    },
                    {
                        "adcode": "542424",
                        "name": "聂荣县"
                    },
                    {
                        "adcode": "542425",
                        "name": "安多县"
                    },
                    {
                        "adcode": "542426",
                        "name": "申扎县"
                    },
                    {
                        "adcode": "542427",
                        "name": "索县"
                    },
                    {
                        "adcode": "542428",
                        "name": "班戈县"
                    },
                    {
                        "adcode": "542429",
                        "name": "巴青县"
                    },
                    {
                        "adcode": "542430",
                        "name": "尼玛县"
                    },
                    {
                        "adcode": "542431",
                        "name": "双湖县"
                    }
                ]
            },
            {
                "adcode": "5402",
                "name": "日喀则市",
                "s": [
                    {
                        "adcode": "540202",
                        "name": "桑珠孜区"
                    },
                    {
                        "adcode": "540221",
                        "name": "南木林县"
                    },
                    {
                        "adcode": "540222",
                        "name": "江孜县"
                    },
                    {
                        "adcode": "540223",
                        "name": "定日县"
                    },
                    {
                        "adcode": "540224",
                        "name": "萨迦县"
                    },
                    {
                        "adcode": "540225",
                        "name": "拉孜县"
                    },
                    {
                        "adcode": "540226",
                        "name": "昂仁县"
                    },
                    {
                        "adcode": "540227",
                        "name": "谢通门县"
                    },
                    {
                        "adcode": "540228",
                        "name": "白朗县"
                    },
                    {
                        "adcode": "540229",
                        "name": "仁布县"
                    },
                    {
                        "adcode": "540230",
                        "name": "康马县"
                    },
                    {
                        "adcode": "540231",
                        "name": "定结县"
                    },
                    {
                        "adcode": "540232",
                        "name": "仲巴县"
                    },
                    {
                        "adcode": "540233",
                        "name": "亚东县"
                    },
                    {
                        "adcode": "540234",
                        "name": "吉隆县"
                    },
                    {
                        "adcode": "540235",
                        "name": "聂拉木县"
                    },
                    {
                        "adcode": "540236",
                        "name": "萨嘎县"
                    },
                    {
                        "adcode": "540237",
                        "name": "岗巴县"
                    }
                ]
            },
            {
                "adcode": "5425",
                "name": "阿里地区",
                "s": [
                    {
                        "adcode": "542599",
                        "name": "阿里地区本级"
                    },
                    {
                        "adcode": "542521",
                        "name": "普兰县"
                    },
                    {
                        "adcode": "542522",
                        "name": "札达县"
                    },
                    {
                        "adcode": "542523",
                        "name": "噶尔县"
                    },
                    {
                        "adcode": "542524",
                        "name": "日土县"
                    },
                    {
                        "adcode": "542525",
                        "name": "革吉县"
                    },
                    {
                        "adcode": "542526",
                        "name": "改则县"
                    },
                    {
                        "adcode": "542527",
                        "name": "措勤县"
                    }
                ]
            },
            {
                "adcode": "5403",
                "name": "昌都市",
                "s": [
                    {
                        "adcode": "540326",
                        "name": "八宿县"
                    },
                    {
                        "adcode": "540302",
                        "name": "卡若区"
                    },
                    {
                        "adcode": "540323",
                        "name": "类乌齐县"
                    },
                    {
                        "adcode": "540330",
                        "name": "边坝县"
                    }
                ]
            },
            {
                "adcode": "5426",
                "name": "林芝地区",
                "s": [
                    {
                        "adcode": "542699",
                        "name": "林芝地区本级"
                    },
                    {
                        "adcode": "542621",
                        "name": "林芝县"
                    },
                    {
                        "adcode": "542622",
                        "name": "工布江达县"
                    },
                    {
                        "adcode": "542623",
                        "name": "米林县"
                    },
                    {
                        "adcode": "542624",
                        "name": "墨脱县"
                    },
                    {
                        "adcode": "542625",
                        "name": "波密县"
                    },
                    {
                        "adcode": "542626",
                        "name": "察隅县"
                    },
                    {
                        "adcode": "542627",
                        "name": "朗县"
                    }
                ]
            },
            {
                "adcode": "5404",
                "name": "林芝市",
                "s": [
                    {
                        "adcode": "540421",
                        "name": "工布江达县"
                    },
                    {
                        "adcode": "540402",
                        "name": "巴宜区"
                    },
                    {
                        "adcode": "540424",
                        "name": "波密县"
                    },
                    {
                        "adcode": "540422",
                        "name": "米林县"
                    }
                ]
            },
            {
                "adcode": "5405",
                "name": "山南市",
                "s": [
                    {
                        "adcode": "540502",
                        "name": "乃东区"
                    },
                    {
                        "adcode": "540522",
                        "name": "贡嘎县"
                    },
                    {
                        "adcode": "540530",
                        "name": "错那县"
                    }
                ]
            },
            {
                "adcode": "5406",
                "name": "那曲市",
                "s": [
                    {
                        "adcode": "540602",
                        "name": "色尼区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "21",
        "name": "辽宁省",
        "s": [
            {
                "adcode": "2199",
                "name": "辽宁省省本级",
                "s": [
                    {
                        "adcode": "219901",
                        "name": "辽宁省省本级（省直）"
                    },
                    {
                        "adcode": "219902",
                        "name": "辽宁省省本级（行业）"
                    },
                    {
                        "adcode": "219903",
                        "name": "辽宁省省本级（鞍钢）"
                    }
                ]
            },
            {
                "adcode": "2111",
                "name": "盘锦市",
                "s": [
                    {
                        "adcode": "211199",
                        "name": "盘锦市市本级"
                    },
                    {
                        "adcode": "211102",
                        "name": "双台子区"
                    },
                    {
                        "adcode": "211103",
                        "name": "兴隆台区"
                    },
                    {
                        "adcode": "211121",
                        "name": "大洼县"
                    },
                    {
                        "adcode": "211122",
                        "name": "盘山县"
                    },
                    {
                        "adcode": "211140",
                        "name": "盘锦辽东湾新区"
                    },
                    {
                        "adcode": "211141",
                        "name": "盘锦辽河口生态经济区"
                    },
                    {
                        "adcode": "211101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "211104",
                        "name": "大洼区"
                    }
                ]
            },
            {
                "adcode": "2110",
                "name": "辽阳市",
                "s": [
                    {
                        "adcode": "211099",
                        "name": "辽阳市市本级"
                    },
                    {
                        "adcode": "211002",
                        "name": "白塔区"
                    },
                    {
                        "adcode": "211003",
                        "name": "文圣区"
                    },
                    {
                        "adcode": "211004",
                        "name": "宏伟区"
                    },
                    {
                        "adcode": "211005",
                        "name": "弓长岭区"
                    },
                    {
                        "adcode": "211011",
                        "name": "太子河区"
                    },
                    {
                        "adcode": "211021",
                        "name": "辽阳县"
                    },
                    {
                        "adcode": "211081",
                        "name": "灯塔市"
                    },
                    {
                        "adcode": "211001",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2108",
                "name": "营口市",
                "s": [
                    {
                        "adcode": "210899",
                        "name": "营口市市本级"
                    },
                    {
                        "adcode": "210802",
                        "name": "站前区"
                    },
                    {
                        "adcode": "210803",
                        "name": "西市区"
                    },
                    {
                        "adcode": "210804",
                        "name": "鲅鱼圈区"
                    },
                    {
                        "adcode": "210811",
                        "name": "老边区"
                    },
                    {
                        "adcode": "210840",
                        "name": "建筑企业"
                    },
                    {
                        "adcode": "210881",
                        "name": "盖州市"
                    },
                    {
                        "adcode": "210882",
                        "name": "大石桥市"
                    },
                    {
                        "adcode": "210801",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2107",
                "name": "锦州市",
                "s": [
                    {
                        "adcode": "210799",
                        "name": "锦州市市本级"
                    },
                    {
                        "adcode": "210702",
                        "name": "古塔区"
                    },
                    {
                        "adcode": "210703",
                        "name": "凌河区"
                    },
                    {
                        "adcode": "210711",
                        "name": "太和区"
                    },
                    {
                        "adcode": "210726",
                        "name": "黑山县"
                    },
                    {
                        "adcode": "210727",
                        "name": "义县"
                    },
                    {
                        "adcode": "210740",
                        "name": "开发区"
                    },
                    {
                        "adcode": "210741",
                        "name": "松山新区"
                    },
                    {
                        "adcode": "210742",
                        "name": "锦州龙栖湾新区"
                    },
                    {
                        "adcode": "210781",
                        "name": "凌海市"
                    },
                    {
                        "adcode": "210782",
                        "name": "北镇市"
                    },
                    {
                        "adcode": "210701",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2106",
                "name": "丹东市",
                "s": [
                    {
                        "adcode": "210699",
                        "name": "丹东市市本级"
                    },
                    {
                        "adcode": "210602",
                        "name": "元宝区"
                    },
                    {
                        "adcode": "210603",
                        "name": "振兴区"
                    },
                    {
                        "adcode": "210604",
                        "name": "振安区"
                    },
                    {
                        "adcode": "210624",
                        "name": "宽甸满族自治县"
                    },
                    {
                        "adcode": "210640",
                        "name": "丹东边境经济合作区"
                    },
                    {
                        "adcode": "210681",
                        "name": "东港市"
                    },
                    {
                        "adcode": "210682",
                        "name": "凤城市"
                    },
                    {
                        "adcode": "210601",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2105",
                "name": "本溪市",
                "s": [
                    {
                        "adcode": "210599",
                        "name": "本溪市市本级"
                    },
                    {
                        "adcode": "210502",
                        "name": "平山区"
                    },
                    {
                        "adcode": "210503",
                        "name": "溪湖区"
                    },
                    {
                        "adcode": "210504",
                        "name": "明山区"
                    },
                    {
                        "adcode": "210505",
                        "name": "南芬区"
                    },
                    {
                        "adcode": "210521",
                        "name": "本溪满族自治县"
                    },
                    {
                        "adcode": "210522",
                        "name": "桓仁满族自治县"
                    },
                    {
                        "adcode": "210540",
                        "name": "本溪市高新技术产业开发区"
                    },
                    {
                        "adcode": "210501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2104",
                "name": "抚顺市",
                "s": [
                    {
                        "adcode": "210499",
                        "name": "抚顺市市本级"
                    },
                    {
                        "adcode": "210402",
                        "name": "新抚区"
                    },
                    {
                        "adcode": "210403",
                        "name": "东洲区"
                    },
                    {
                        "adcode": "210404",
                        "name": "望花区"
                    },
                    {
                        "adcode": "210411",
                        "name": "顺城区"
                    },
                    {
                        "adcode": "210421",
                        "name": "抚顺县"
                    },
                    {
                        "adcode": "210422",
                        "name": "新宾满族自治县"
                    },
                    {
                        "adcode": "210423",
                        "name": "清原满族自治县"
                    },
                    {
                        "adcode": "210440",
                        "name": "抚顺经济开发区"
                    },
                    {
                        "adcode": "210401",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2103",
                "name": "鞍山市",
                "s": [
                    {
                        "adcode": "210399",
                        "name": "鞍山市市本级"
                    },
                    {
                        "adcode": "210302",
                        "name": "铁东区"
                    },
                    {
                        "adcode": "210303",
                        "name": "铁西区"
                    },
                    {
                        "adcode": "210304",
                        "name": "立山区"
                    },
                    {
                        "adcode": "210311",
                        "name": "千山区"
                    },
                    {
                        "adcode": "210321",
                        "name": "台安县"
                    },
                    {
                        "adcode": "210323",
                        "name": "岫岩满族自治县"
                    },
                    {
                        "adcode": "210340",
                        "name": "鞍山经济开发区"
                    },
                    {
                        "adcode": "210341",
                        "name": "鞍山文化旅游开发区"
                    },
                    {
                        "adcode": "210342",
                        "name": "鞍山高新产业开发区"
                    },
                    {
                        "adcode": "210343",
                        "name": "鞍山市千山风景区"
                    },
                    {
                        "adcode": "210381",
                        "name": "海城市"
                    },
                    {
                        "adcode": "210301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2114",
                "name": "葫芦岛市",
                "s": [
                    {
                        "adcode": "211499",
                        "name": "葫芦岛市市本级"
                    },
                    {
                        "adcode": "211402",
                        "name": "连山区"
                    },
                    {
                        "adcode": "211403",
                        "name": "龙港区"
                    },
                    {
                        "adcode": "211404",
                        "name": "南票区"
                    },
                    {
                        "adcode": "211421",
                        "name": "绥中县"
                    },
                    {
                        "adcode": "211422",
                        "name": "建昌县"
                    },
                    {
                        "adcode": "211481",
                        "name": "兴城市"
                    },
                    {
                        "adcode": "211401",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2102",
                "name": "大连市",
                "s": [
                    {
                        "adcode": "210299",
                        "name": "大连市市本级"
                    },
                    {
                        "adcode": "210202",
                        "name": "中山区"
                    },
                    {
                        "adcode": "210203",
                        "name": "西岗区"
                    },
                    {
                        "adcode": "210204",
                        "name": "沙河口区"
                    },
                    {
                        "adcode": "210211",
                        "name": "甘井子区"
                    },
                    {
                        "adcode": "210212",
                        "name": "旅顺口区"
                    },
                    {
                        "adcode": "210213",
                        "name": "金州区"
                    },
                    {
                        "adcode": "210224",
                        "name": "长海县"
                    },
                    {
                        "adcode": "210240",
                        "name": "开发区"
                    },
                    {
                        "adcode": "210241",
                        "name": "保税区"
                    },
                    {
                        "adcode": "210242",
                        "name": "长兴岛临港工业区"
                    },
                    {
                        "adcode": "210243",
                        "name": "花园口经济区"
                    },
                    {
                        "adcode": "210281",
                        "name": "瓦房店市"
                    },
                    {
                        "adcode": "210282",
                        "name": "普兰店市"
                    },
                    {
                        "adcode": "210283",
                        "name": "庄河市"
                    },
                    {
                        "adcode": "210201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "210214",
                        "name": "普兰店区"
                    }
                ]
            },
            {
                "adcode": "2113",
                "name": "朝阳市",
                "s": [
                    {
                        "adcode": "211399",
                        "name": "朝阳市市本级"
                    },
                    {
                        "adcode": "211302",
                        "name": "双塔区"
                    },
                    {
                        "adcode": "211303",
                        "name": "龙城区"
                    },
                    {
                        "adcode": "211321",
                        "name": "朝阳县"
                    },
                    {
                        "adcode": "211322",
                        "name": "建平县"
                    },
                    {
                        "adcode": "211324",
                        "name": "喀喇沁左翼蒙古族自治县"
                    },
                    {
                        "adcode": "211340",
                        "name": "朝阳经济技术开发区"
                    },
                    {
                        "adcode": "211381",
                        "name": "北票市"
                    },
                    {
                        "adcode": "211382",
                        "name": "凌源市"
                    },
                    {
                        "adcode": "211301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2101",
                "name": "沈阳市",
                "s": [
                    {
                        "adcode": "210199",
                        "name": "沈阳市市本级"
                    },
                    {
                        "adcode": "210102",
                        "name": "和平区"
                    },
                    {
                        "adcode": "210103",
                        "name": "沈河区"
                    },
                    {
                        "adcode": "210104",
                        "name": "大东区"
                    },
                    {
                        "adcode": "210105",
                        "name": "皇姑区"
                    },
                    {
                        "adcode": "210106",
                        "name": "铁西区"
                    },
                    {
                        "adcode": "210111",
                        "name": "苏家屯区"
                    },
                    {
                        "adcode": "210112",
                        "name": "浑南区"
                    },
                    {
                        "adcode": "210113",
                        "name": "沈北新区"
                    },
                    {
                        "adcode": "210114",
                        "name": "于洪区"
                    },
                    {
                        "adcode": "210122",
                        "name": "辽中县"
                    },
                    {
                        "adcode": "210123",
                        "name": "康平县"
                    },
                    {
                        "adcode": "210124",
                        "name": "法库县"
                    },
                    {
                        "adcode": "210140",
                        "name": "经济技术开发区"
                    },
                    {
                        "adcode": "210141",
                        "name": "浑南新区"
                    },
                    {
                        "adcode": "210142",
                        "name": "棋盘山"
                    },
                    {
                        "adcode": "210143",
                        "name": "蒲河新城"
                    },
                    {
                        "adcode": "210181",
                        "name": "新民市"
                    },
                    {
                        "adcode": "210101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "210115",
                        "name": "辽中区"
                    }
                ]
            },
            {
                "adcode": "2112",
                "name": "铁岭市",
                "s": [
                    {
                        "adcode": "211299",
                        "name": "铁岭市市本级"
                    },
                    {
                        "adcode": "211202",
                        "name": "银州区"
                    },
                    {
                        "adcode": "211204",
                        "name": "清河区"
                    },
                    {
                        "adcode": "211221",
                        "name": "铁岭县"
                    },
                    {
                        "adcode": "211223",
                        "name": "西丰县"
                    },
                    {
                        "adcode": "211224",
                        "name": "昌图县"
                    },
                    {
                        "adcode": "211240",
                        "name": "铁岭经济开发区"
                    },
                    {
                        "adcode": "211281",
                        "name": "调兵山市"
                    },
                    {
                        "adcode": "211282",
                        "name": "开原市"
                    },
                    {
                        "adcode": "211201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "2109",
                "name": "阜新市",
                "s": [
                    {
                        "adcode": "210999",
                        "name": "阜新市市本级"
                    },
                    {
                        "adcode": "210902",
                        "name": "海州区"
                    },
                    {
                        "adcode": "210903",
                        "name": "新邱区"
                    },
                    {
                        "adcode": "210904",
                        "name": "太平区"
                    },
                    {
                        "adcode": "210905",
                        "name": "清河门区"
                    },
                    {
                        "adcode": "210911",
                        "name": "细河区"
                    },
                    {
                        "adcode": "210921",
                        "name": "蒙古族自治县"
                    },
                    {
                        "adcode": "210922",
                        "name": "彰武县"
                    },
                    {
                        "adcode": "210940",
                        "name": "阜新市经济开发区"
                    },
                    {
                        "adcode": "210941",
                        "name": "矿区"
                    },
                    {
                        "adcode": "210942",
                        "name": "高新技术产业园区"
                    },
                    {
                        "adcode": "210901",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "210921",
                        "name": "阜新蒙古族自治县"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "37",
        "name": "山东省",
        "s": [
            {
                "adcode": "3704",
                "name": "枣庄市",
                "s": [
                    {
                        "adcode": "370499",
                        "name": "枣庄市市本级"
                    },
                    {
                        "adcode": "370402",
                        "name": "市中区"
                    },
                    {
                        "adcode": "370403",
                        "name": "薛城区"
                    },
                    {
                        "adcode": "370404",
                        "name": "峄城区"
                    },
                    {
                        "adcode": "370405",
                        "name": "台儿庄区"
                    },
                    {
                        "adcode": "370406",
                        "name": "山亭区"
                    },
                    {
                        "adcode": "370481",
                        "name": "滕州市"
                    },
                    {
                        "adcode": "370401",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3715",
                "name": "聊城市",
                "s": [
                    {
                        "adcode": "371599",
                        "name": "聊城市市本级"
                    },
                    {
                        "adcode": "371502",
                        "name": "东昌府区"
                    },
                    {
                        "adcode": "371521",
                        "name": "阳谷县"
                    },
                    {
                        "adcode": "371522",
                        "name": "莘县"
                    },
                    {
                        "adcode": "371523",
                        "name": "茌平县"
                    },
                    {
                        "adcode": "371524",
                        "name": "东阿县"
                    },
                    {
                        "adcode": "371525",
                        "name": "冠县"
                    },
                    {
                        "adcode": "371526",
                        "name": "高唐县"
                    },
                    {
                        "adcode": "371540",
                        "name": "聊城经济技术开发区"
                    },
                    {
                        "adcode": "371541",
                        "name": "聊城高新技术产业开发区"
                    },
                    {
                        "adcode": "371542",
                        "name": "江北水城旅游度假区"
                    },
                    {
                        "adcode": "371581",
                        "name": "临清市"
                    },
                    {
                        "adcode": "371501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3705",
                "name": "东营市",
                "s": [
                    {
                        "adcode": "370599",
                        "name": "东营市市本级"
                    },
                    {
                        "adcode": "370502",
                        "name": "东营区"
                    },
                    {
                        "adcode": "370503",
                        "name": "河口区"
                    },
                    {
                        "adcode": "370521",
                        "name": "垦利县"
                    },
                    {
                        "adcode": "370522",
                        "name": "利津县"
                    },
                    {
                        "adcode": "370523",
                        "name": "广饶县"
                    },
                    {
                        "adcode": "370540",
                        "name": "东营经济技术开发区"
                    },
                    {
                        "adcode": "370541",
                        "name": "东营港经济开发区"
                    },
                    {
                        "adcode": "370501",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "370505",
                        "name": "垦利区"
                    }
                ]
            },
            {
                "adcode": "3716",
                "name": "滨州市",
                "s": [
                    {
                        "adcode": "371699",
                        "name": "滨州市市本级"
                    },
                    {
                        "adcode": "371602",
                        "name": "滨城区"
                    },
                    {
                        "adcode": "371621",
                        "name": "惠民县"
                    },
                    {
                        "adcode": "371622",
                        "name": "阳信县"
                    },
                    {
                        "adcode": "371623",
                        "name": "无棣县"
                    },
                    {
                        "adcode": "371624",
                        "name": "沾化县"
                    },
                    {
                        "adcode": "371625",
                        "name": "博兴县"
                    },
                    {
                        "adcode": "371626",
                        "name": "邹平县"
                    },
                    {
                        "adcode": "371640",
                        "name": "开发区"
                    },
                    {
                        "adcode": "371641",
                        "name": "滨州高新技术产业开发区"
                    },
                    {
                        "adcode": "371642",
                        "name": "滨州北海经济开发区"
                    },
                    {
                        "adcode": "371601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "371603",
                        "name": "沾化区"
                    },
                    {
                        "adcode": "371681",
                        "name": "邹平市"
                    }
                ]
            },
            {
                "adcode": "3706",
                "name": "烟台市",
                "s": [
                    {
                        "adcode": "370699",
                        "name": "烟台市市本级"
                    },
                    {
                        "adcode": "370602",
                        "name": "芝罘区"
                    },
                    {
                        "adcode": "370611",
                        "name": "福山区"
                    },
                    {
                        "adcode": "370612",
                        "name": "牟平区"
                    },
                    {
                        "adcode": "370613",
                        "name": "莱山区"
                    },
                    {
                        "adcode": "370634",
                        "name": "长岛县"
                    },
                    {
                        "adcode": "370640",
                        "name": "开发区"
                    },
                    {
                        "adcode": "370641",
                        "name": "高新区"
                    },
                    {
                        "adcode": "370681",
                        "name": "龙口市"
                    },
                    {
                        "adcode": "370682",
                        "name": "莱阳市"
                    },
                    {
                        "adcode": "370683",
                        "name": "莱州市"
                    },
                    {
                        "adcode": "370684",
                        "name": "蓬莱市"
                    },
                    {
                        "adcode": "370685",
                        "name": "招远市"
                    },
                    {
                        "adcode": "370686",
                        "name": "栖霞市"
                    },
                    {
                        "adcode": "370687",
                        "name": "海阳市"
                    },
                    {
                        "adcode": "370601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "370672",
                        "name": "烟台经济技术开发区"
                    },
                    {
                        "adcode": "370671",
                        "name": "烟台高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "3717",
                "name": "菏泽市",
                "s": [
                    {
                        "adcode": "371799",
                        "name": "菏泽市市本级"
                    },
                    {
                        "adcode": "371702",
                        "name": "牡丹区"
                    },
                    {
                        "adcode": "371721",
                        "name": "曹县"
                    },
                    {
                        "adcode": "371722",
                        "name": "单县"
                    },
                    {
                        "adcode": "371723",
                        "name": "成武县"
                    },
                    {
                        "adcode": "371724",
                        "name": "巨野县"
                    },
                    {
                        "adcode": "371725",
                        "name": "郓城县"
                    },
                    {
                        "adcode": "371726",
                        "name": "鄄城县"
                    },
                    {
                        "adcode": "371727",
                        "name": "定陶县"
                    },
                    {
                        "adcode": "371728",
                        "name": "东明县"
                    },
                    {
                        "adcode": "371740",
                        "name": "菏泽市经济开发区"
                    },
                    {
                        "adcode": "371741",
                        "name": "高新技术产业开发区"
                    },
                    {
                        "adcode": "371701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "371703",
                        "name": "定陶区"
                    },
                    {
                        "adcode": "371771",
                        "name": "菏泽经济技术开发区"
                    },
                    {
                        "adcode": "371772",
                        "name": "菏泽高新技术开发区"
                    }
                ]
            },
            {
                "adcode": "3707",
                "name": "潍坊市",
                "s": [
                    {
                        "adcode": "370799",
                        "name": "潍坊市市本级"
                    },
                    {
                        "adcode": "370702",
                        "name": "潍城区"
                    },
                    {
                        "adcode": "370703",
                        "name": "寒亭区"
                    },
                    {
                        "adcode": "370704",
                        "name": "坊子区"
                    },
                    {
                        "adcode": "370705",
                        "name": "奎文区"
                    },
                    {
                        "adcode": "370724",
                        "name": "临朐县"
                    },
                    {
                        "adcode": "370725",
                        "name": "昌乐县"
                    },
                    {
                        "adcode": "370740",
                        "name": "潍坊滨海经济开发区"
                    },
                    {
                        "adcode": "370741",
                        "name": "潍坊高新技术产业开发区"
                    },
                    {
                        "adcode": "370742",
                        "name": "潍坊峡山生态经济开发区"
                    },
                    {
                        "adcode": "370781",
                        "name": "青州市"
                    },
                    {
                        "adcode": "370782",
                        "name": "诸城市"
                    },
                    {
                        "adcode": "370783",
                        "name": "寿光市"
                    },
                    {
                        "adcode": "370784",
                        "name": "安丘市"
                    },
                    {
                        "adcode": "370785",
                        "name": "高密市"
                    },
                    {
                        "adcode": "370786",
                        "name": "昌邑市"
                    },
                    {
                        "adcode": "370701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "370772",
                        "name": "潍坊滨海经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "3708",
                "name": "济宁市",
                "s": [
                    {
                        "adcode": "370899",
                        "name": "济宁市市本级"
                    },
                    {
                        "adcode": "370802",
                        "name": "市中区"
                    },
                    {
                        "adcode": "370811",
                        "name": "任城区"
                    },
                    {
                        "adcode": "370812",
                        "name": "兖州区"
                    },
                    {
                        "adcode": "370826",
                        "name": "微山县"
                    },
                    {
                        "adcode": "370827",
                        "name": "鱼台县"
                    },
                    {
                        "adcode": "370828",
                        "name": "金乡县"
                    },
                    {
                        "adcode": "370829",
                        "name": "嘉祥县"
                    },
                    {
                        "adcode": "370830",
                        "name": "汶上县"
                    },
                    {
                        "adcode": "370831",
                        "name": "泗水县"
                    },
                    {
                        "adcode": "370832",
                        "name": "梁山县"
                    },
                    {
                        "adcode": "370881",
                        "name": "曲阜市"
                    },
                    {
                        "adcode": "370882",
                        "name": "兖州市"
                    },
                    {
                        "adcode": "370883",
                        "name": "邹城市"
                    },
                    {
                        "adcode": "370801",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "370871",
                        "name": "济宁高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "3709",
                "name": "泰安市",
                "s": [
                    {
                        "adcode": "370999",
                        "name": "泰安市市本级"
                    },
                    {
                        "adcode": "370902",
                        "name": "泰山区"
                    },
                    {
                        "adcode": "370911",
                        "name": "岱岳区"
                    },
                    {
                        "adcode": "370921",
                        "name": "宁阳县"
                    },
                    {
                        "adcode": "370923",
                        "name": "东平县"
                    },
                    {
                        "adcode": "370982",
                        "name": "新泰市"
                    },
                    {
                        "adcode": "370983",
                        "name": "肥城市"
                    },
                    {
                        "adcode": "370901",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3710",
                "name": "威海市",
                "s": [
                    {
                        "adcode": "371099",
                        "name": "威海市市本级"
                    },
                    {
                        "adcode": "371002",
                        "name": "环翠区"
                    },
                    {
                        "adcode": "371040",
                        "name": "高技术产业开发区"
                    },
                    {
                        "adcode": "371041",
                        "name": "经济技术开发区"
                    },
                    {
                        "adcode": "371042",
                        "name": "威海临港经济技术开发区"
                    },
                    {
                        "adcode": "371081",
                        "name": "文登市"
                    },
                    {
                        "adcode": "371082",
                        "name": "荣成市"
                    },
                    {
                        "adcode": "371083",
                        "name": "乳山市"
                    },
                    {
                        "adcode": "371001",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "371003",
                        "name": "文登区"
                    },
                    {
                        "adcode": "371071",
                        "name": "威海火炬高技术产业开发区"
                    },
                    {
                        "adcode": "371072",
                        "name": "威海经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "3711",
                "name": "日照市",
                "s": [
                    {
                        "adcode": "371199",
                        "name": "日照市市本级"
                    },
                    {
                        "adcode": "371102",
                        "name": "东港区"
                    },
                    {
                        "adcode": "371103",
                        "name": "岚山区"
                    },
                    {
                        "adcode": "371121",
                        "name": "五莲县"
                    },
                    {
                        "adcode": "371122",
                        "name": "莒县"
                    },
                    {
                        "adcode": "371140",
                        "name": "日照经济开发区"
                    },
                    {
                        "adcode": "371141",
                        "name": "山海天旅游度假区"
                    },
                    {
                        "adcode": "371142",
                        "name": "日照市国际海洋城"
                    },
                    {
                        "adcode": "371101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "371171",
                        "name": "日照经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "3701",
                "name": "济南市",
                "s": [
                    {
                        "adcode": "370199",
                        "name": "济南市市本级"
                    },
                    {
                        "adcode": "370102",
                        "name": "历下区"
                    },
                    {
                        "adcode": "370103",
                        "name": "市中区"
                    },
                    {
                        "adcode": "370104",
                        "name": "槐荫区"
                    },
                    {
                        "adcode": "370105",
                        "name": "天桥区"
                    },
                    {
                        "adcode": "370112",
                        "name": "历城区"
                    },
                    {
                        "adcode": "370113",
                        "name": "长清区"
                    },
                    {
                        "adcode": "370124",
                        "name": "平阴县"
                    },
                    {
                        "adcode": "370125",
                        "name": "济阳县"
                    },
                    {
                        "adcode": "370126",
                        "name": "商河县"
                    },
                    {
                        "adcode": "370140",
                        "name": "济南高新技术产业开发区"
                    },
                    {
                        "adcode": "370181",
                        "name": "章丘市"
                    },
                    {
                        "adcode": "370115",
                        "name": "济阳区"
                    },
                    {
                        "adcode": "370101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "370114",
                        "name": "章丘区"
                    }
                ]
            },
            {
                "adcode": "3712",
                "name": "莱芜市",
                "s": [
                    {
                        "adcode": "371299",
                        "name": "莱芜市市本级"
                    },
                    {
                        "adcode": "371202",
                        "name": "莱城区"
                    },
                    {
                        "adcode": "371203",
                        "name": "钢城区"
                    },
                    {
                        "adcode": "371201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3702",
                "name": "青岛市",
                "s": [
                    {
                        "adcode": "370215",
                        "name": "即墨区"
                    },
                    {
                        "adcode": "370299",
                        "name": "青岛市市本级"
                    },
                    {
                        "adcode": "370202",
                        "name": "市南区"
                    },
                    {
                        "adcode": "370203",
                        "name": "市北区"
                    },
                    {
                        "adcode": "370205",
                        "name": "四方区"
                    },
                    {
                        "adcode": "370211",
                        "name": "黄岛区"
                    },
                    {
                        "adcode": "370212",
                        "name": "崂山区"
                    },
                    {
                        "adcode": "370213",
                        "name": "李沧区"
                    },
                    {
                        "adcode": "370214",
                        "name": "城阳区"
                    },
                    {
                        "adcode": "370240",
                        "name": "保税区"
                    },
                    {
                        "adcode": "370281",
                        "name": "胶州市"
                    },
                    {
                        "adcode": "370282",
                        "name": "即墨市"
                    },
                    {
                        "adcode": "370283",
                        "name": "平度市"
                    },
                    {
                        "adcode": "370284",
                        "name": "胶南市"
                    },
                    {
                        "adcode": "370285",
                        "name": "莱西市"
                    },
                    {
                        "adcode": "370201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "370271",
                        "name": "青岛高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "3713",
                "name": "临沂市",
                "s": [
                    {
                        "adcode": "371399",
                        "name": "临沂市市本级"
                    },
                    {
                        "adcode": "371302",
                        "name": "兰山区"
                    },
                    {
                        "adcode": "371311",
                        "name": "罗庄区"
                    },
                    {
                        "adcode": "371312",
                        "name": "河东区"
                    },
                    {
                        "adcode": "371321",
                        "name": "沂南县"
                    },
                    {
                        "adcode": "371322",
                        "name": "郯城县"
                    },
                    {
                        "adcode": "371323",
                        "name": "沂水县"
                    },
                    {
                        "adcode": "371324",
                        "name": "兰陵县"
                    },
                    {
                        "adcode": "371325",
                        "name": "费县"
                    },
                    {
                        "adcode": "371326",
                        "name": "平邑县"
                    },
                    {
                        "adcode": "371327",
                        "name": "莒南县"
                    },
                    {
                        "adcode": "371328",
                        "name": "蒙阴县"
                    },
                    {
                        "adcode": "371329",
                        "name": "临沭县"
                    },
                    {
                        "adcode": "371340",
                        "name": "临沂市经济开发区"
                    },
                    {
                        "adcode": "371341",
                        "name": "临沂市高新开发区"
                    },
                    {
                        "adcode": "371342",
                        "name": "临港产业区"
                    },
                    {
                        "adcode": "371343",
                        "name": "蒙山旅游区"
                    },
                    {
                        "adcode": "371344",
                        "name": "临沂综合保税区"
                    },
                    {
                        "adcode": "371301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "371373",
                        "name": "临沂临港经济开发区"
                    },
                    {
                        "adcode": "371371",
                        "name": "临沂高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "3703",
                "name": "淄博市",
                "s": [
                    {
                        "adcode": "370399",
                        "name": "淄博市市本级"
                    },
                    {
                        "adcode": "370302",
                        "name": "淄川区"
                    },
                    {
                        "adcode": "370303",
                        "name": "张店区"
                    },
                    {
                        "adcode": "370304",
                        "name": "博山区"
                    },
                    {
                        "adcode": "370305",
                        "name": "临淄区"
                    },
                    {
                        "adcode": "370306",
                        "name": "周村区"
                    },
                    {
                        "adcode": "370321",
                        "name": "桓台县"
                    },
                    {
                        "adcode": "370322",
                        "name": "高青县"
                    },
                    {
                        "adcode": "370323",
                        "name": "沂源县"
                    },
                    {
                        "adcode": "370340",
                        "name": "高新区"
                    },
                    {
                        "adcode": "370341",
                        "name": "文昌湖旅游度假区"
                    },
                    {
                        "adcode": "370342",
                        "name": "淄博经济技术开发区"
                    },
                    {
                        "adcode": "370301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3714",
                "name": "德州市",
                "s": [
                    {
                        "adcode": "371499",
                        "name": "德州市市本级"
                    },
                    {
                        "adcode": "371402",
                        "name": "德城区"
                    },
                    {
                        "adcode": "371421",
                        "name": "陵县"
                    },
                    {
                        "adcode": "371422",
                        "name": "宁津县"
                    },
                    {
                        "adcode": "371423",
                        "name": "庆云县"
                    },
                    {
                        "adcode": "371424",
                        "name": "临邑县"
                    },
                    {
                        "adcode": "371425",
                        "name": "齐河县"
                    },
                    {
                        "adcode": "371426",
                        "name": "平原县"
                    },
                    {
                        "adcode": "371427",
                        "name": "夏津县"
                    },
                    {
                        "adcode": "371428",
                        "name": "武城县"
                    },
                    {
                        "adcode": "371440",
                        "name": "德州经济技术开发区"
                    },
                    {
                        "adcode": "371481",
                        "name": "乐陵市"
                    },
                    {
                        "adcode": "371482",
                        "name": "禹城市"
                    },
                    {
                        "adcode": "371401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "371403",
                        "name": "陵城区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "36",
        "name": "江西省",
        "s": [
            {
                "adcode": "3604",
                "name": "九江市",
                "s": [
                    {
                        "adcode": "360499",
                        "name": "九江市市本级"
                    },
                    {
                        "adcode": "360402",
                        "name": "庐山区"
                    },
                    {
                        "adcode": "360403",
                        "name": "浔阳区"
                    },
                    {
                        "adcode": "360421",
                        "name": "九江县"
                    },
                    {
                        "adcode": "360423",
                        "name": "武宁县"
                    },
                    {
                        "adcode": "360424",
                        "name": "修水县"
                    },
                    {
                        "adcode": "360425",
                        "name": "永修县"
                    },
                    {
                        "adcode": "360426",
                        "name": "德安县"
                    },
                    {
                        "adcode": "360427",
                        "name": "星子县"
                    },
                    {
                        "adcode": "360428",
                        "name": "都昌县"
                    },
                    {
                        "adcode": "360429",
                        "name": "湖口县"
                    },
                    {
                        "adcode": "360430",
                        "name": "彭泽县"
                    },
                    {
                        "adcode": "360440",
                        "name": "开发区"
                    },
                    {
                        "adcode": "360441",
                        "name": "庐山局"
                    },
                    {
                        "adcode": "360442",
                        "name": "共青城开放开发区"
                    },
                    {
                        "adcode": "360481",
                        "name": "瑞昌市"
                    },
                    {
                        "adcode": "360401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "360482",
                        "name": "共青城市"
                    },
                    {
                        "adcode": "360483",
                        "name": "庐山市"
                    },
                    {
                        "adcode": "360404",
                        "name": "柴桑区"
                    },
                    {
                        "adcode": "360402",
                        "name": "濂溪区"
                    }
                ]
            },
            {
                "adcode": "3603",
                "name": "萍乡市",
                "s": [
                    {
                        "adcode": "360399",
                        "name": "萍乡市市本级"
                    },
                    {
                        "adcode": "360302",
                        "name": "安源区"
                    },
                    {
                        "adcode": "360313",
                        "name": "湘东区"
                    },
                    {
                        "adcode": "360321",
                        "name": "莲花县"
                    },
                    {
                        "adcode": "360322",
                        "name": "上栗县"
                    },
                    {
                        "adcode": "360323",
                        "name": "芦溪县"
                    },
                    {
                        "adcode": "360340",
                        "name": "萍乡经济开发区"
                    },
                    {
                        "adcode": "360301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3602",
                "name": "景德镇市",
                "s": [
                    {
                        "adcode": "360299",
                        "name": "景德镇市市本级"
                    },
                    {
                        "adcode": "360202",
                        "name": "昌江区"
                    },
                    {
                        "adcode": "360203",
                        "name": "珠山区"
                    },
                    {
                        "adcode": "360222",
                        "name": "浮梁县"
                    },
                    {
                        "adcode": "360281",
                        "name": "乐平市"
                    },
                    {
                        "adcode": "360201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3601",
                "name": "南昌市",
                "s": [
                    {
                        "adcode": "360199",
                        "name": "南昌市市本级"
                    },
                    {
                        "adcode": "360102",
                        "name": "东湖区"
                    },
                    {
                        "adcode": "360103",
                        "name": "西湖区"
                    },
                    {
                        "adcode": "360104",
                        "name": "青云谱区"
                    },
                    {
                        "adcode": "360105",
                        "name": "湾里区"
                    },
                    {
                        "adcode": "360106",
                        "name": "红谷滩新区"
                    },
                    {
                        "adcode": "360111",
                        "name": "青山湖区"
                    },
                    {
                        "adcode": "360112",
                        "name": "新建区"
                    },
                    {
                        "adcode": "360121",
                        "name": "南昌县"
                    },
                    {
                        "adcode": "360122",
                        "name": "新建县"
                    },
                    {
                        "adcode": "360123",
                        "name": "安义县"
                    },
                    {
                        "adcode": "360124",
                        "name": "进贤县"
                    },
                    {
                        "adcode": "360140",
                        "name": "昌北区"
                    },
                    {
                        "adcode": "360141",
                        "name": "高新区"
                    },
                    {
                        "adcode": "360150",
                        "name": "英雄开发区"
                    },
                    {
                        "adcode": "360151",
                        "name": "桑海开发区"
                    },
                    {
                        "adcode": "360101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3611",
                "name": "上饶市",
                "s": [
                    {
                        "adcode": "361199",
                        "name": "上饶市市本级"
                    },
                    {
                        "adcode": "361102",
                        "name": "信州区"
                    },
                    {
                        "adcode": "361121",
                        "name": "上饶县"
                    },
                    {
                        "adcode": "361122",
                        "name": "广丰县"
                    },
                    {
                        "adcode": "361123",
                        "name": "玉山县"
                    },
                    {
                        "adcode": "361124",
                        "name": "铅山县"
                    },
                    {
                        "adcode": "361125",
                        "name": "横峰县"
                    },
                    {
                        "adcode": "361126",
                        "name": "弋阳县"
                    },
                    {
                        "adcode": "361127",
                        "name": "余干县"
                    },
                    {
                        "adcode": "361128",
                        "name": "波阳县"
                    },
                    {
                        "adcode": "361129",
                        "name": "万年县"
                    },
                    {
                        "adcode": "361130",
                        "name": "婺源县"
                    },
                    {
                        "adcode": "361181",
                        "name": "德兴市"
                    },
                    {
                        "adcode": "361101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "361103",
                        "name": "广丰区"
                    },
                    {
                        "adcode": "361128",
                        "name": "鄱阳县"
                    }
                ]
            },
            {
                "adcode": "3610",
                "name": "抚州市",
                "s": [
                    {
                        "adcode": "361099",
                        "name": "抚州市市本级"
                    },
                    {
                        "adcode": "361002",
                        "name": "临川区"
                    },
                    {
                        "adcode": "361021",
                        "name": "南城县"
                    },
                    {
                        "adcode": "361022",
                        "name": "黎川县"
                    },
                    {
                        "adcode": "361023",
                        "name": "南丰县"
                    },
                    {
                        "adcode": "361024",
                        "name": "崇仁县"
                    },
                    {
                        "adcode": "361025",
                        "name": "乐安县"
                    },
                    {
                        "adcode": "361026",
                        "name": "宜黄县"
                    },
                    {
                        "adcode": "361027",
                        "name": "金溪县"
                    },
                    {
                        "adcode": "361028",
                        "name": "资溪县"
                    },
                    {
                        "adcode": "361029",
                        "name": "东乡县"
                    },
                    {
                        "adcode": "361030",
                        "name": "广昌县"
                    },
                    {
                        "adcode": "361040",
                        "name": "金巢区"
                    },
                    {
                        "adcode": "361001",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "361003",
                        "name": "东乡区"
                    }
                ]
            },
            {
                "adcode": "3609",
                "name": "宜春市",
                "s": [
                    {
                        "adcode": "360999",
                        "name": "宜春市市本级"
                    },
                    {
                        "adcode": "360902",
                        "name": "袁州区"
                    },
                    {
                        "adcode": "360921",
                        "name": "奉新县"
                    },
                    {
                        "adcode": "360922",
                        "name": "万载县"
                    },
                    {
                        "adcode": "360923",
                        "name": "上高县"
                    },
                    {
                        "adcode": "360924",
                        "name": "宜丰县"
                    },
                    {
                        "adcode": "360925",
                        "name": "靖安县"
                    },
                    {
                        "adcode": "360926",
                        "name": "铜鼓县"
                    },
                    {
                        "adcode": "360981",
                        "name": "丰城市"
                    },
                    {
                        "adcode": "360982",
                        "name": "樟树市"
                    },
                    {
                        "adcode": "360983",
                        "name": "高安市"
                    },
                    {
                        "adcode": "360901",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3608",
                "name": "吉安市",
                "s": [
                    {
                        "adcode": "360899",
                        "name": "吉安市市本级"
                    },
                    {
                        "adcode": "360802",
                        "name": "吉州区"
                    },
                    {
                        "adcode": "360803",
                        "name": "青原区"
                    },
                    {
                        "adcode": "360821",
                        "name": "吉安县"
                    },
                    {
                        "adcode": "360822",
                        "name": "吉水县"
                    },
                    {
                        "adcode": "360823",
                        "name": "峡江县"
                    },
                    {
                        "adcode": "360824",
                        "name": "新干县"
                    },
                    {
                        "adcode": "360825",
                        "name": "永丰县"
                    },
                    {
                        "adcode": "360826",
                        "name": "泰和县"
                    },
                    {
                        "adcode": "360827",
                        "name": "遂川县"
                    },
                    {
                        "adcode": "360828",
                        "name": "万安县"
                    },
                    {
                        "adcode": "360829",
                        "name": "安福县"
                    },
                    {
                        "adcode": "360830",
                        "name": "永新县"
                    },
                    {
                        "adcode": "360881",
                        "name": "井冈山市"
                    },
                    {
                        "adcode": "360801",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "3607",
                "name": "赣州市",
                "s": [
                    {
                        "adcode": "360799",
                        "name": "赣州市市本级"
                    },
                    {
                        "adcode": "360702",
                        "name": "章贡区"
                    },
                    {
                        "adcode": "360721",
                        "name": "赣县"
                    },
                    {
                        "adcode": "360722",
                        "name": "信丰县"
                    },
                    {
                        "adcode": "360723",
                        "name": "大余县"
                    },
                    {
                        "adcode": "360724",
                        "name": "上犹县"
                    },
                    {
                        "adcode": "360725",
                        "name": "崇义县"
                    },
                    {
                        "adcode": "360726",
                        "name": "安远县"
                    },
                    {
                        "adcode": "360727",
                        "name": "龙南县"
                    },
                    {
                        "adcode": "360728",
                        "name": "定南县"
                    },
                    {
                        "adcode": "360729",
                        "name": "全南县"
                    },
                    {
                        "adcode": "360730",
                        "name": "宁都县"
                    },
                    {
                        "adcode": "360731",
                        "name": "于都县"
                    },
                    {
                        "adcode": "360732",
                        "name": "兴国县"
                    },
                    {
                        "adcode": "360733",
                        "name": "会昌县"
                    },
                    {
                        "adcode": "360734",
                        "name": "寻乌县"
                    },
                    {
                        "adcode": "360735",
                        "name": "石城县"
                    },
                    {
                        "adcode": "360781",
                        "name": "瑞金市"
                    },
                    {
                        "adcode": "360782",
                        "name": "南康市"
                    },
                    {
                        "adcode": "360701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "360703",
                        "name": "南康区"
                    },
                    {
                        "adcode": "360704",
                        "name": "赣县区"
                    }
                ]
            },
            {
                "adcode": "3606",
                "name": "鹰潭市",
                "s": [
                    {
                        "adcode": "360699",
                        "name": "鹰潭市市本级"
                    },
                    {
                        "adcode": "360602",
                        "name": "月湖区"
                    },
                    {
                        "adcode": "360622",
                        "name": "余江县"
                    },
                    {
                        "adcode": "360681",
                        "name": "贵溪市"
                    },
                    {
                        "adcode": "360601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "360603",
                        "name": "余江区"
                    }
                ]
            },
            {
                "adcode": "3605",
                "name": "新余市",
                "s": [
                    {
                        "adcode": "360599",
                        "name": "新余市市本级"
                    },
                    {
                        "adcode": "360502",
                        "name": "渝水区"
                    },
                    {
                        "adcode": "360521",
                        "name": "分宜县"
                    },
                    {
                        "adcode": "360540",
                        "name": "仙女湖区"
                    },
                    {
                        "adcode": "360541",
                        "name": "新余高新技术产业园区"
                    },
                    {
                        "adcode": "360542",
                        "name": "孔目江生态经济区"
                    },
                    {
                        "adcode": "360501",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "44",
        "name": "广东省",
        "s": [
            {
                "adcode": "4451",
                "name": "潮州市",
                "s": [
                    {
                        "adcode": "445199",
                        "name": "潮州市市本级"
                    },
                    {
                        "adcode": "445102",
                        "name": "湘桥区"
                    },
                    {
                        "adcode": "445121",
                        "name": "潮安县"
                    },
                    {
                        "adcode": "445122",
                        "name": "饶平县"
                    },
                    {
                        "adcode": "445140",
                        "name": "枫溪区"
                    },
                    {
                        "adcode": "445101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "445103",
                        "name": "潮安区"
                    }
                ]
            },
            {
                "adcode": "4452",
                "name": "揭阳市",
                "s": [
                    {
                        "adcode": "445299",
                        "name": "揭阳市市本级"
                    },
                    {
                        "adcode": "445202",
                        "name": "榕城区"
                    },
                    {
                        "adcode": "445203",
                        "name": "揭东区"
                    },
                    {
                        "adcode": "445221",
                        "name": "揭东县"
                    },
                    {
                        "adcode": "445222",
                        "name": "揭西县"
                    },
                    {
                        "adcode": "445224",
                        "name": "惠来县"
                    },
                    {
                        "adcode": "445240",
                        "name": "蓝城区"
                    },
                    {
                        "adcode": "445241",
                        "name": "空港经济区"
                    },
                    {
                        "adcode": "445242",
                        "name": "大南山区"
                    },
                    {
                        "adcode": "445243",
                        "name": "普侨区"
                    },
                    {
                        "adcode": "445244",
                        "name": "揭阳高新技术开发区"
                    },
                    {
                        "adcode": "445245",
                        "name": "揭阳农垦"
                    },
                    {
                        "adcode": "445246",
                        "name": "揭阳大南海石化工业区"
                    },
                    {
                        "adcode": "445281",
                        "name": "普宁市"
                    },
                    {
                        "adcode": "445201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4420",
                "name": "中山市",
                "s": [
                    {
                        "adcode": "442099",
                        "name": "中山市市本级"
                    },
                    {
                        "adcode": "442000001",
                        "name": "石岐区街道"
                    },
                    {
                        "adcode": "442000105",
                        "name": "古镇镇"
                    },
                    {
                        "adcode": "442000114",
                        "name": "三乡镇"
                    },
                    {
                        "adcode": "442000109",
                        "name": "三角镇"
                    },
                    {
                        "adcode": "442000103",
                        "name": "东凤镇"
                    },
                    {
                        "adcode": "442000002",
                        "name": "东区街道"
                    },
                    {
                        "adcode": "442000104",
                        "name": "东升镇"
                    },
                    {
                        "adcode": "442000006",
                        "name": "五桂山街道"
                    },
                    {
                        "adcode": "442000005",
                        "name": "南区街道"
                    },
                    {
                        "adcode": "442000111",
                        "name": "南头镇"
                    },
                    {
                        "adcode": "442000113",
                        "name": "南朗镇"
                    },
                    {
                        "adcode": "442000107",
                        "name": "坦洲镇"
                    },
                    {
                        "adcode": "442000116",
                        "name": "大涌镇"
                    },
                    {
                        "adcode": "442000100",
                        "name": "小榄镇"
                    },
                    {
                        "adcode": "442000115",
                        "name": "板芙镇"
                    },
                    {
                        "adcode": "442000110",
                        "name": "横栏镇"
                    },
                    {
                        "adcode": "442000106",
                        "name": "沙溪镇"
                    },
                    {
                        "adcode": "442000108",
                        "name": "港口镇"
                    },
                    {
                        "adcode": "442000003",
                        "name": "火炬开发区街道"
                    },
                    {
                        "adcode": "442000117",
                        "name": "神湾镇"
                    },
                    {
                        "adcode": "442000004",
                        "name": "西区街道"
                    },
                    {
                        "adcode": "442000112",
                        "name": "阜沙镇"
                    },
                    {
                        "adcode": "442000101",
                        "name": "黄圃镇"
                    }
                ]
            },
            {
                "adcode": "4453",
                "name": "云浮市",
                "s": [
                    {
                        "adcode": "445399",
                        "name": "云浮市市本级"
                    },
                    {
                        "adcode": "445302",
                        "name": "云城区"
                    },
                    {
                        "adcode": "445303",
                        "name": "云安区"
                    },
                    {
                        "adcode": "445321",
                        "name": "新兴县"
                    },
                    {
                        "adcode": "445322",
                        "name": "郁南县"
                    },
                    {
                        "adcode": "445323",
                        "name": "云安县"
                    },
                    {
                        "adcode": "445381",
                        "name": "罗定市"
                    },
                    {
                        "adcode": "445301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4408",
                "name": "湛江市",
                "s": [
                    {
                        "adcode": "440899",
                        "name": "湛江市市本级"
                    },
                    {
                        "adcode": "440802",
                        "name": "赤坎区"
                    },
                    {
                        "adcode": "440803",
                        "name": "霞山区"
                    },
                    {
                        "adcode": "440804",
                        "name": "坡头区"
                    },
                    {
                        "adcode": "440811",
                        "name": "麻章区"
                    },
                    {
                        "adcode": "440823",
                        "name": "遂溪县"
                    },
                    {
                        "adcode": "440825",
                        "name": "徐闻县"
                    },
                    {
                        "adcode": "440881",
                        "name": "廉江市"
                    },
                    {
                        "adcode": "440882",
                        "name": "雷州市"
                    },
                    {
                        "adcode": "440883",
                        "name": "吴川市"
                    },
                    {
                        "adcode": "440840",
                        "name": "湛江经济技术开发区"
                    },
                    {
                        "adcode": "440841",
                        "name": "湛江农垦"
                    },
                    {
                        "adcode": "440801",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4419",
                "name": "东莞市",
                "s": [
                    {
                        "adcode": "441999",
                        "name": "东莞市市本级"
                    },
                    {
                        "adcode": "441900121",
                        "name": "虎门镇"
                    },
                    {
                        "adcode": "441900005",
                        "name": "万江街道"
                    },
                    {
                        "adcode": "441900109",
                        "name": "东坑镇"
                    },
                    {
                        "adcode": "441900003",
                        "name": "东城街道"
                    },
                    {
                        "adcode": "441900402",
                        "name": "东莞港"
                    },
                    {
                        "adcode": "441900403",
                        "name": "东莞生态园"
                    },
                    {
                        "adcode": "441900128",
                        "name": "中堂镇"
                    },
                    {
                        "adcode": "441900105",
                        "name": "企石镇"
                    },
                    {
                        "adcode": "441900117",
                        "name": "凤岗镇"
                    },
                    {
                        "adcode": "441900004",
                        "name": "南城街道"
                    },
                    {
                        "adcode": "441900122",
                        "name": "厚街镇"
                    },
                    {
                        "adcode": "441900116",
                        "name": "塘厦镇"
                    },
                    {
                        "adcode": "441900118",
                        "name": "大岭山镇"
                    },
                    {
                        "adcode": "441900113",
                        "name": "大朗镇"
                    },
                    {
                        "adcode": "441900111",
                        "name": "寮步镇"
                    },
                    {
                        "adcode": "441900110",
                        "name": "常平镇"
                    },
                    {
                        "adcode": "441900127",
                        "name": "望牛墩镇"
                    },
                    {
                        "adcode": "441900401",
                        "name": "松山湖管委会"
                    },
                    {
                        "adcode": "441900107",
                        "name": "桥头镇"
                    },
                    {
                        "adcode": "441900112",
                        "name": "樟木头镇"
                    },
                    {
                        "adcode": "441900106",
                        "name": "横沥镇"
                    },
                    {
                        "adcode": "441900123",
                        "name": "沙田镇"
                    },
                    {
                        "adcode": "441900125",
                        "name": "洪梅镇"
                    },
                    {
                        "adcode": "441900115",
                        "name": "清溪镇"
                    },
                    {
                        "adcode": "441900104",
                        "name": "石排镇"
                    },
                    {
                        "adcode": "441900101",
                        "name": "石碣镇"
                    },
                    {
                        "adcode": "441900102",
                        "name": "石龙镇"
                    },
                    {
                        "adcode": "441900103",
                        "name": "茶山镇"
                    },
                    {
                        "adcode": "441900006",
                        "name": "莞城街道"
                    },
                    {
                        "adcode": "441900108",
                        "name": "谢岗镇"
                    },
                    {
                        "adcode": "441900124",
                        "name": "道滘镇"
                    },
                    {
                        "adcode": "441900119",
                        "name": "长安镇"
                    },
                    {
                        "adcode": "441900129",
                        "name": "高埗镇"
                    },
                    {
                        "adcode": "441900126",
                        "name": "麻涌镇"
                    },
                    {
                        "adcode": "441900114",
                        "name": "黄江镇"
                    }
                ]
            },
            {
                "adcode": "4409",
                "name": "茂名市",
                "s": [
                    {
                        "adcode": "440999",
                        "name": "茂名市市本级"
                    },
                    {
                        "adcode": "440902",
                        "name": "茂南区"
                    },
                    {
                        "adcode": "440903",
                        "name": "茂港区"
                    },
                    {
                        "adcode": "440904",
                        "name": "电白区"
                    },
                    {
                        "adcode": "440940",
                        "name": "茂名滨海新区"
                    },
                    {
                        "adcode": "440941",
                        "name": "茂名高新技术产业开发区"
                    },
                    {
                        "adcode": "440923",
                        "name": "电白县"
                    },
                    {
                        "adcode": "440981",
                        "name": "高州市"
                    },
                    {
                        "adcode": "440982",
                        "name": "化州市"
                    },
                    {
                        "adcode": "440983",
                        "name": "信宜市"
                    },
                    {
                        "adcode": "440901",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4401",
                "name": "广州市",
                "s": [
                    {
                        "adcode": "440199",
                        "name": "广州市市本级"
                    },
                    {
                        "adcode": "440103",
                        "name": "荔湾区"
                    },
                    {
                        "adcode": "440104",
                        "name": "越秀区"
                    },
                    {
                        "adcode": "440105",
                        "name": "海珠区"
                    },
                    {
                        "adcode": "440106",
                        "name": "天河区"
                    },
                    {
                        "adcode": "440111",
                        "name": "白云区"
                    },
                    {
                        "adcode": "440112",
                        "name": "黄埔区"
                    },
                    {
                        "adcode": "440113",
                        "name": "番禺区"
                    },
                    {
                        "adcode": "440114",
                        "name": "花都区"
                    },
                    {
                        "adcode": "440115",
                        "name": "南沙区"
                    },
                    {
                        "adcode": "440116",
                        "name": "萝岗区"
                    },
                    {
                        "adcode": "440183",
                        "name": "增城市"
                    },
                    {
                        "adcode": "440184",
                        "name": "从化市"
                    },
                    {
                        "adcode": "440101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "440117",
                        "name": "从化区"
                    },
                    {
                        "adcode": "440118",
                        "name": "增城区"
                    }
                ]
            },
            {
                "adcode": "4412",
                "name": "肇庆市",
                "s": [
                    {
                        "adcode": "441299",
                        "name": "肇庆市市本级"
                    },
                    {
                        "adcode": "441202",
                        "name": "端州区"
                    },
                    {
                        "adcode": "441203",
                        "name": "鼎湖区"
                    },
                    {
                        "adcode": "441223",
                        "name": "广宁县"
                    },
                    {
                        "adcode": "441224",
                        "name": "怀集县"
                    },
                    {
                        "adcode": "441225",
                        "name": "封开县"
                    },
                    {
                        "adcode": "441226",
                        "name": "德庆县"
                    },
                    {
                        "adcode": "441240",
                        "name": "高新区"
                    },
                    {
                        "adcode": "441283",
                        "name": "高要市"
                    },
                    {
                        "adcode": "441284",
                        "name": "四会市"
                    },
                    {
                        "adcode": "441201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "441204",
                        "name": "高要区"
                    }
                ]
            },
            {
                "adcode": "4402",
                "name": "韶关市",
                "s": [
                    {
                        "adcode": "440299",
                        "name": "韶关市市本级"
                    },
                    {
                        "adcode": "440203",
                        "name": "武江区"
                    },
                    {
                        "adcode": "440204",
                        "name": "浈江区"
                    },
                    {
                        "adcode": "440205",
                        "name": "曲江区"
                    },
                    {
                        "adcode": "440222",
                        "name": "始兴县"
                    },
                    {
                        "adcode": "440224",
                        "name": "仁化县"
                    },
                    {
                        "adcode": "440229",
                        "name": "翁源县"
                    },
                    {
                        "adcode": "440232",
                        "name": "乳源瑶族自治县"
                    },
                    {
                        "adcode": "440233",
                        "name": "新丰县"
                    },
                    {
                        "adcode": "440281",
                        "name": "乐昌市"
                    },
                    {
                        "adcode": "440282",
                        "name": "南雄市"
                    },
                    {
                        "adcode": "440201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4413",
                "name": "惠州市",
                "s": [
                    {
                        "adcode": "441399",
                        "name": "惠州市市本级"
                    },
                    {
                        "adcode": "441302",
                        "name": "惠城区"
                    },
                    {
                        "adcode": "441303",
                        "name": "惠阳区"
                    },
                    {
                        "adcode": "441322",
                        "name": "博罗县"
                    },
                    {
                        "adcode": "441323",
                        "name": "惠东县"
                    },
                    {
                        "adcode": "441324",
                        "name": "龙门县"
                    },
                    {
                        "adcode": "441340",
                        "name": "大亚湾经济开发区"
                    },
                    {
                        "adcode": "441341",
                        "name": "惠州仲恺高新技术产业开发区"
                    },
                    {
                        "adcode": "441301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4403",
                "name": "深圳市",
                "s": [
                    {
                        "adcode": "440399",
                        "name": "深圳市市本级"
                    },
                    {
                        "adcode": "440303",
                        "name": "罗湖区"
                    },
                    {
                        "adcode": "440304",
                        "name": "福田区"
                    },
                    {
                        "adcode": "440305",
                        "name": "南山区"
                    },
                    {
                        "adcode": "440306",
                        "name": "宝安区"
                    },
                    {
                        "adcode": "440307",
                        "name": "龙岗区"
                    },
                    {
                        "adcode": "440308",
                        "name": "盐田区"
                    },
                    {
                        "adcode": "440342",
                        "name": "龙华新区"
                    },
                    {
                        "adcode": "440343",
                        "name": "大鹏新区"
                    },
                    {
                        "adcode": "440301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "440309",
                        "name": "龙华区"
                    },
                    {
                        "adcode": "440310",
                        "name": "坪山区"
                    },
                    {
                        "adcode": "440311",
                        "name": "光明区"
                    }
                ]
            },
            {
                "adcode": "4414",
                "name": "梅州市",
                "s": [
                    {
                        "adcode": "441499",
                        "name": "梅州市市本级"
                    },
                    {
                        "adcode": "441402",
                        "name": "梅江区"
                    },
                    {
                        "adcode": "441421",
                        "name": "梅县"
                    },
                    {
                        "adcode": "441422",
                        "name": "大埔县"
                    },
                    {
                        "adcode": "441423",
                        "name": "丰顺县"
                    },
                    {
                        "adcode": "441424",
                        "name": "五华县"
                    },
                    {
                        "adcode": "441426",
                        "name": "平远县"
                    },
                    {
                        "adcode": "441427",
                        "name": "蕉岭县"
                    },
                    {
                        "adcode": "441481",
                        "name": "兴宁市"
                    },
                    {
                        "adcode": "441401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "441403",
                        "name": "梅县区"
                    }
                ]
            },
            {
                "adcode": "4404",
                "name": "珠海市",
                "s": [
                    {
                        "adcode": "440499",
                        "name": "珠海市市本级"
                    },
                    {
                        "adcode": "440402",
                        "name": "香洲区"
                    },
                    {
                        "adcode": "440403",
                        "name": "斗门区"
                    },
                    {
                        "adcode": "440404",
                        "name": "金湾区"
                    },
                    {
                        "adcode": "440440",
                        "name": "万山海洋开发试验区"
                    },
                    {
                        "adcode": "440441",
                        "name": "高新技术产业开发区"
                    },
                    {
                        "adcode": "440442",
                        "name": "横琴新区"
                    },
                    {
                        "adcode": "440443",
                        "name": "高栏港经济区"
                    },
                    {
                        "adcode": "440444",
                        "name": "保税区"
                    },
                    {
                        "adcode": "440401",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4415",
                "name": "汕尾市",
                "s": [
                    {
                        "adcode": "441599",
                        "name": "汕尾市市本级"
                    },
                    {
                        "adcode": "441502",
                        "name": "城区"
                    },
                    {
                        "adcode": "441521",
                        "name": "海丰县"
                    },
                    {
                        "adcode": "441523",
                        "name": "陆河县"
                    },
                    {
                        "adcode": "441540",
                        "name": "红海湾"
                    },
                    {
                        "adcode": "441541",
                        "name": "农垦"
                    },
                    {
                        "adcode": "441542",
                        "name": "华侨管理区"
                    },
                    {
                        "adcode": "441501",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "441581",
                        "name": "陆丰市"
                    }
                ]
            },
            {
                "adcode": "4405",
                "name": "汕头市",
                "s": [
                    {
                        "adcode": "440599",
                        "name": "汕头市市本级"
                    },
                    {
                        "adcode": "440507",
                        "name": "龙湖区"
                    },
                    {
                        "adcode": "440511",
                        "name": "金平区"
                    },
                    {
                        "adcode": "440512",
                        "name": "濠江区"
                    },
                    {
                        "adcode": "440513",
                        "name": "潮阳区"
                    },
                    {
                        "adcode": "440514",
                        "name": "潮南区"
                    },
                    {
                        "adcode": "440515",
                        "name": "澄海区"
                    },
                    {
                        "adcode": "440523",
                        "name": "南澳县"
                    },
                    {
                        "adcode": "440501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4416",
                "name": "河源市",
                "s": [
                    {
                        "adcode": "441699",
                        "name": "河源市市本级"
                    },
                    {
                        "adcode": "441602",
                        "name": "源城区"
                    },
                    {
                        "adcode": "441621",
                        "name": "紫金县"
                    },
                    {
                        "adcode": "441622",
                        "name": "龙川县"
                    },
                    {
                        "adcode": "441623",
                        "name": "连平县"
                    },
                    {
                        "adcode": "441624",
                        "name": "和平县"
                    },
                    {
                        "adcode": "441625",
                        "name": "东源县"
                    },
                    {
                        "adcode": "441640",
                        "name": "河源江东新区"
                    },
                    {
                        "adcode": "441601",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4406",
                "name": "佛山市",
                "s": [
                    {
                        "adcode": "440699",
                        "name": "佛山市市本级"
                    },
                    {
                        "adcode": "440604",
                        "name": "禅城区"
                    },
                    {
                        "adcode": "440605",
                        "name": "南海区"
                    },
                    {
                        "adcode": "440606",
                        "name": "顺德区"
                    },
                    {
                        "adcode": "440607",
                        "name": "三水区"
                    },
                    {
                        "adcode": "440608",
                        "name": "高明区"
                    },
                    {
                        "adcode": "440601",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4417",
                "name": "阳江市",
                "s": [
                    {
                        "adcode": "441799",
                        "name": "阳江市市本级"
                    },
                    {
                        "adcode": "441702",
                        "name": "江城区"
                    },
                    {
                        "adcode": "441721",
                        "name": "阳西县"
                    },
                    {
                        "adcode": "441723",
                        "name": "阳东县"
                    },
                    {
                        "adcode": "441740",
                        "name": "岗侨区"
                    },
                    {
                        "adcode": "441741",
                        "name": "农垦"
                    },
                    {
                        "adcode": "441742",
                        "name": "海陵区"
                    },
                    {
                        "adcode": "441743",
                        "name": "阳江高新技术产业开发区"
                    },
                    {
                        "adcode": "441701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "441781",
                        "name": "阳春市"
                    },
                    {
                        "adcode": "441704",
                        "name": "阳东区"
                    }
                ]
            },
            {
                "adcode": "4407",
                "name": "江门市",
                "s": [
                    {
                        "adcode": "440799",
                        "name": "江门市市本级"
                    },
                    {
                        "adcode": "440703",
                        "name": "蓬江区"
                    },
                    {
                        "adcode": "440704",
                        "name": "江海区"
                    },
                    {
                        "adcode": "440705",
                        "name": "新会区"
                    },
                    {
                        "adcode": "440781",
                        "name": "台山市"
                    },
                    {
                        "adcode": "440783",
                        "name": "开平市"
                    },
                    {
                        "adcode": "440784",
                        "name": "鹤山市"
                    },
                    {
                        "adcode": "440785",
                        "name": "恩平市"
                    },
                    {
                        "adcode": "440701",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4418",
                "name": "清远市",
                "s": [
                    {
                        "adcode": "441899",
                        "name": "清远市市本级"
                    },
                    {
                        "adcode": "441802",
                        "name": "清城区"
                    },
                    {
                        "adcode": "441803",
                        "name": "清新区"
                    },
                    {
                        "adcode": "441821",
                        "name": "佛冈县"
                    },
                    {
                        "adcode": "441823",
                        "name": "阳山县"
                    },
                    {
                        "adcode": "441825",
                        "name": "连山壮族瑶族自治县"
                    },
                    {
                        "adcode": "441826",
                        "name": "连南瑶族自治县"
                    },
                    {
                        "adcode": "441827",
                        "name": "清新县"
                    },
                    {
                        "adcode": "441881",
                        "name": "英德市"
                    },
                    {
                        "adcode": "441882",
                        "name": "连州市"
                    },
                    {
                        "adcode": "441801",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "32",
        "name": "江苏省",
        "s": [
            {
                "adcode": "3299",
                "name": "江苏省省本级",
                "s": [
                    {
                        "adcode": "329901",
                        "name": "江苏省省本级（省直）"
                    },
                    {
                        "adcode": "329903",
                        "name": "江苏省省本级（农垦）"
                    },
                    {
                        "adcode": "329904",
                        "name": "江苏省省本级（监狱管理局）"
                    }
                ]
            },
            {
                "adcode": "3211",
                "name": "镇江市",
                "s": [
                    {
                        "adcode": "321199",
                        "name": "镇江市市本级"
                    },
                    {
                        "adcode": "321102",
                        "name": "京口区"
                    },
                    {
                        "adcode": "321111",
                        "name": "润州区"
                    },
                    {
                        "adcode": "321112",
                        "name": "丹徒区"
                    },
                    {
                        "adcode": "321181",
                        "name": "丹阳市"
                    },
                    {
                        "adcode": "321182",
                        "name": "扬中市"
                    },
                    {
                        "adcode": "321183",
                        "name": "句容市"
                    },
                    {
                        "adcode": "321101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "321171",
                        "name": "镇江新区"
                    }
                ]
            },
            {
                "adcode": "3210",
                "name": "扬州市",
                "s": [
                    {
                        "adcode": "321099",
                        "name": "扬州市市本级"
                    },
                    {
                        "adcode": "321002",
                        "name": "广陵区"
                    },
                    {
                        "adcode": "321003",
                        "name": "邗江区"
                    },
                    {
                        "adcode": "321011",
                        "name": "维扬区"
                    },
                    {
                        "adcode": "321023",
                        "name": "宝应县"
                    },
                    {
                        "adcode": "321040",
                        "name": "新城西区"
                    },
                    {
                        "adcode": "321041",
                        "name": "扬州经济技术开发区"
                    },
                    {
                        "adcode": "321042",
                        "name": "蜀冈-瘦西湖风景名胜区"
                    },
                    {
                        "adcode": "321081",
                        "name": "仪征市"
                    },
                    {
                        "adcode": "321084",
                        "name": "高邮市"
                    },
                    {
                        "adcode": "321088",
                        "name": "江都市"
                    },
                    {
                        "adcode": "321001",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "321012",
                        "name": "江都区"
                    }
                ]
            },
            {
                "adcode": "3208",
                "name": "淮安市",
                "s": [
                    {
                        "adcode": "320899",
                        "name": "淮安市市本级"
                    },
                    {
                        "adcode": "320802",
                        "name": "清河区"
                    },
                    {
                        "adcode": "320803",
                        "name": "楚州区"
                    },
                    {
                        "adcode": "320804",
                        "name": "淮阴区"
                    },
                    {
                        "adcode": "320811",
                        "name": "清浦区"
                    },
                    {
                        "adcode": "320826",
                        "name": "涟水县"
                    },
                    {
                        "adcode": "320829",
                        "name": "洪泽县"
                    },
                    {
                        "adcode": "320812",
                        "name": "清江浦区"
                    },
                    {
                        "adcode": "320813",
                        "name": "洪泽区"
                    },
                    {
                        "adcode": "320830",
                        "name": "盱眙县"
                    },
                    {
                        "adcode": "320831",
                        "name": "金湖县"
                    },
                    {
                        "adcode": "320840",
                        "name": "淮安经济开发区"
                    },
                    {
                        "adcode": "320841",
                        "name": "淮安生态新城"
                    },
                    {
                        "adcode": "320801",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "320803",
                        "name": "淮安区"
                    },
                    {
                        "adcode": "320871",
                        "name": "淮安经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "3207",
                "name": "连云港市",
                "s": [
                    {
                        "adcode": "320799",
                        "name": "连云港市市本级"
                    },
                    {
                        "adcode": "320703",
                        "name": "连云区"
                    },
                    {
                        "adcode": "320705",
                        "name": "新浦区"
                    },
                    {
                        "adcode": "320706",
                        "name": "海州区"
                    },
                    {
                        "adcode": "320721",
                        "name": "赣榆县"
                    },
                    {
                        "adcode": "320722",
                        "name": "东海县"
                    },
                    {
                        "adcode": "320723",
                        "name": "灌云县"
                    },
                    {
                        "adcode": "320724",
                        "name": "灌南县"
                    },
                    {
                        "adcode": "320740",
                        "name": "连云港高新技术产业开发区"
                    },
                    {
                        "adcode": "320741",
                        "name": "徐圩新区"
                    },
                    {
                        "adcode": "320742",
                        "name": "连云港云台山风景名胜区(科教创业园区)"
                    },
                    {
                        "adcode": "320701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "320707",
                        "name": "赣榆区"
                    },
                    {
                        "adcode": "320771",
                        "name": "连云港经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "3206",
                "name": "南通市",
                "s": [
                    {
                        "adcode": "320699",
                        "name": "南通市市本级"
                    },
                    {
                        "adcode": "320602",
                        "name": "崇川区"
                    },
                    {
                        "adcode": "320611",
                        "name": "港闸区"
                    },
                    {
                        "adcode": "320612",
                        "name": "通州区"
                    },
                    {
                        "adcode": "320621",
                        "name": "海安县"
                    },
                    {
                        "adcode": "320623",
                        "name": "如东县"
                    },
                    {
                        "adcode": "320681",
                        "name": "启东市"
                    },
                    {
                        "adcode": "320682",
                        "name": "如皋市"
                    },
                    {
                        "adcode": "320683",
                        "name": "通州市"
                    },
                    {
                        "adcode": "320684",
                        "name": "海门市"
                    },
                    {
                        "adcode": "320640",
                        "name": "南通经济技术开发区"
                    },
                    {
                        "adcode": "320601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "320685",
                        "name": "海安市"
                    }
                ]
            },
            {
                "adcode": "3205",
                "name": "苏州市",
                "s": [
                    {
                        "adcode": "320599",
                        "name": "苏州市市本级"
                    },
                    {
                        "adcode": "320502",
                        "name": "沧浪区"
                    },
                    {
                        "adcode": "320503",
                        "name": "平江区"
                    },
                    {
                        "adcode": "320504",
                        "name": "金阊区"
                    },
                    {
                        "adcode": "320505",
                        "name": "虎丘区"
                    },
                    {
                        "adcode": "320506",
                        "name": "吴中区"
                    },
                    {
                        "adcode": "320507",
                        "name": "相城区"
                    },
                    {
                        "adcode": "320508",
                        "name": "姑苏区"
                    },
                    {
                        "adcode": "320540",
                        "name": "苏州工业园区"
                    },
                    {
                        "adcode": "320581",
                        "name": "常熟市"
                    },
                    {
                        "adcode": "320582",
                        "name": "张家港市"
                    },
                    {
                        "adcode": "320583",
                        "name": "昆山市"
                    },
                    {
                        "adcode": "320584",
                        "name": "吴江市"
                    },
                    {
                        "adcode": "320585",
                        "name": "太仓市"
                    },
                    {
                        "adcode": "320501",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "320509",
                        "name": "吴江区"
                    }
                ]
            },
            {
                "adcode": "3204",
                "name": "常州市",
                "s": [
                    {
                        "adcode": "320499",
                        "name": "常州市市本级"
                    },
                    {
                        "adcode": "320402",
                        "name": "天宁区"
                    },
                    {
                        "adcode": "320404",
                        "name": "钟楼区"
                    },
                    {
                        "adcode": "320405",
                        "name": "戚墅堰区"
                    },
                    {
                        "adcode": "320411",
                        "name": "新北区"
                    },
                    {
                        "adcode": "320412",
                        "name": "武进区"
                    },
                    {
                        "adcode": "320481",
                        "name": "溧阳市"
                    },
                    {
                        "adcode": "320482",
                        "name": "金坛市"
                    },
                    {
                        "adcode": "320401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "320413",
                        "name": "金坛区"
                    }
                ]
            },
            {
                "adcode": "3203",
                "name": "徐州市",
                "s": [
                    {
                        "adcode": "320399",
                        "name": "徐州市市本级"
                    },
                    {
                        "adcode": "320302",
                        "name": "鼓楼区"
                    },
                    {
                        "adcode": "320303",
                        "name": "云龙区"
                    },
                    {
                        "adcode": "320304",
                        "name": "九里区"
                    },
                    {
                        "adcode": "320305",
                        "name": "贾汪区"
                    },
                    {
                        "adcode": "320311",
                        "name": "泉山区"
                    },
                    {
                        "adcode": "320312",
                        "name": "铜山区"
                    },
                    {
                        "adcode": "320321",
                        "name": "丰县"
                    },
                    {
                        "adcode": "320322",
                        "name": "沛县"
                    },
                    {
                        "adcode": "320323",
                        "name": "铜山县"
                    },
                    {
                        "adcode": "320324",
                        "name": "睢宁县"
                    },
                    {
                        "adcode": "320381",
                        "name": "新沂市"
                    },
                    {
                        "adcode": "320382",
                        "name": "邳州市"
                    },
                    {
                        "adcode": "320301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "320371",
                        "name": "徐州经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "3202",
                "name": "无锡市",
                "s": [
                    {
                        "adcode": "320299",
                        "name": "无锡市市本级"
                    },
                    {
                        "adcode": "320202",
                        "name": "崇安区"
                    },
                    {
                        "adcode": "320203",
                        "name": "南长区"
                    },
                    {
                        "adcode": "320204",
                        "name": "北塘区"
                    },
                    {
                        "adcode": "320205",
                        "name": "锡山区"
                    },
                    {
                        "adcode": "320206",
                        "name": "惠山区"
                    },
                    {
                        "adcode": "320211",
                        "name": "滨湖区"
                    },
                    {
                        "adcode": "320213",
                        "name": "新区"
                    },
                    {
                        "adcode": "320281",
                        "name": "江阴市"
                    },
                    {
                        "adcode": "320282",
                        "name": "宜兴市"
                    },
                    {
                        "adcode": "320201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "320214",
                        "name": "新吴区"
                    },
                    {
                        "adcode": "320213",
                        "name": "梁溪区"
                    }
                ]
            },
            {
                "adcode": "3213",
                "name": "宿迁市",
                "s": [
                    {
                        "adcode": "321399",
                        "name": "宿迁市市本级"
                    },
                    {
                        "adcode": "321302",
                        "name": "宿城区"
                    },
                    {
                        "adcode": "321311",
                        "name": "宿豫区"
                    },
                    {
                        "adcode": "321322",
                        "name": "沭阳县"
                    },
                    {
                        "adcode": "321323",
                        "name": "泗阳县"
                    },
                    {
                        "adcode": "321324",
                        "name": "泗洪县"
                    },
                    {
                        "adcode": "321301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "321371",
                        "name": "宿迁经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "3201",
                "name": "南京市",
                "s": [
                    {
                        "adcode": "320199",
                        "name": "南京市市本级"
                    },
                    {
                        "adcode": "320102",
                        "name": "玄武区"
                    },
                    {
                        "adcode": "320103",
                        "name": "白下区"
                    },
                    {
                        "adcode": "320104",
                        "name": "秦淮区"
                    },
                    {
                        "adcode": "320105",
                        "name": "建邺区"
                    },
                    {
                        "adcode": "320106",
                        "name": "鼓楼区"
                    },
                    {
                        "adcode": "320107",
                        "name": "下关区"
                    },
                    {
                        "adcode": "320111",
                        "name": "浦口区"
                    },
                    {
                        "adcode": "320113",
                        "name": "栖霞区"
                    },
                    {
                        "adcode": "320114",
                        "name": "雨花台区"
                    },
                    {
                        "adcode": "320115",
                        "name": "江宁区"
                    },
                    {
                        "adcode": "320116",
                        "name": "六合区"
                    },
                    {
                        "adcode": "320124",
                        "name": "溧水县"
                    },
                    {
                        "adcode": "320125",
                        "name": "高淳县"
                    },
                    {
                        "adcode": "320140",
                        "name": "南京化学工业园"
                    },
                    {
                        "adcode": "320101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "320117",
                        "name": "溧水区"
                    },
                    {
                        "adcode": "320118",
                        "name": "高淳区"
                    }
                ]
            },
            {
                "adcode": "3212",
                "name": "泰州市",
                "s": [
                    {
                        "adcode": "321299",
                        "name": "泰州市市本级"
                    },
                    {
                        "adcode": "321202",
                        "name": "海陵区"
                    },
                    {
                        "adcode": "321203",
                        "name": "高港区"
                    },
                    {
                        "adcode": "321281",
                        "name": "兴化市"
                    },
                    {
                        "adcode": "321282",
                        "name": "靖江市"
                    },
                    {
                        "adcode": "321283",
                        "name": "泰兴市"
                    },
                    {
                        "adcode": "321284",
                        "name": "姜堰市"
                    },
                    {
                        "adcode": "321201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "321204",
                        "name": "姜堰区"
                    },
                    {
                        "adcode": "321271",
                        "name": "泰州医药高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "3209",
                "name": "盐城市",
                "s": [
                    {
                        "adcode": "320999",
                        "name": "盐城市市本级"
                    },
                    {
                        "adcode": "320902",
                        "name": "亭湖区"
                    },
                    {
                        "adcode": "320903",
                        "name": "盐都区"
                    },
                    {
                        "adcode": "320921",
                        "name": "响水县"
                    },
                    {
                        "adcode": "320922",
                        "name": "滨海县"
                    },
                    {
                        "adcode": "320923",
                        "name": "阜宁县"
                    },
                    {
                        "adcode": "320924",
                        "name": "射阳县"
                    },
                    {
                        "adcode": "320925",
                        "name": "建湖县"
                    },
                    {
                        "adcode": "320940",
                        "name": "盐城经济开发区"
                    },
                    {
                        "adcode": "320941",
                        "name": "盐城城南新区"
                    },
                    {
                        "adcode": "320981",
                        "name": "东台市"
                    },
                    {
                        "adcode": "320982",
                        "name": "大丰市"
                    },
                    {
                        "adcode": "320901",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "320904",
                        "name": "大丰区"
                    },
                    {
                        "adcode": "320971",
                        "name": "盐城经济技术开发区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "50",
        "name": "重庆市",
        "s": [
            {
                "adcode": "500107",
                "name": "九龙坡区",
                "s": [
                    {
                        "adcode": "500107",
                        "name": "九龙坡区"
                    }
                ]
            },
            {
                "adcode": "500106",
                "name": "沙坪坝区",
                "s": [
                    {
                        "adcode": "500106",
                        "name": "沙坪坝区"
                    }
                ]
            },
            {
                "adcode": "500105",
                "name": "江北区",
                "s": [
                    {
                        "adcode": "500105",
                        "name": "江北区"
                    }
                ]
            },
            {
                "adcode": "500104",
                "name": "大渡口区",
                "s": [
                    {
                        "adcode": "500104",
                        "name": "大渡口区"
                    }
                ]
            },
            {
                "adcode": "500109",
                "name": "北碚区",
                "s": [
                    {
                        "adcode": "500109",
                        "name": "北碚区"
                    }
                ]
            },
            {
                "adcode": "500108",
                "name": "南岸区",
                "s": [
                    {
                        "adcode": "500108",
                        "name": "南岸区"
                    }
                ]
            },
            {
                "adcode": "500229",
                "name": "城口县",
                "s": [
                    {
                        "adcode": "500229",
                        "name": "城口县"
                    }
                ]
            },
            {
                "adcode": "500110",
                "name": "綦江区",
                "s": [
                    {
                        "adcode": "500110",
                        "name": "綦江区"
                    }
                ]
            },
            {
                "adcode": "500154",
                "name": "开州区",
                "s": [
                    {
                        "adcode": "500154",
                        "name": "开州区"
                    }
                ]
            },
            {
                "adcode": "500231",
                "name": "垫江县",
                "s": [
                    {
                        "adcode": "500231",
                        "name": "垫江县"
                    }
                ]
            },
            {
                "adcode": "500230",
                "name": "丰都县",
                "s": [
                    {
                        "adcode": "500230",
                        "name": "丰都县"
                    }
                ]
            },
            {
                "adcode": "500153",
                "name": "荣昌区",
                "s": [
                    {
                        "adcode": "500153",
                        "name": "荣昌区"
                    }
                ]
            },
            {
                "adcode": "500152",
                "name": "潼南区",
                "s": [
                    {
                        "adcode": "500152",
                        "name": "潼南区"
                    }
                ]
            },
            {
                "adcode": "500151",
                "name": "铜梁区",
                "s": [
                    {
                        "adcode": "500151",
                        "name": "铜梁区"
                    }
                ]
            },
            {
                "adcode": "500114",
                "name": "黔江区",
                "s": [
                    {
                        "adcode": "500114",
                        "name": "黔江区"
                    }
                ]
            },
            {
                "adcode": "500235",
                "name": "云阳县",
                "s": [
                    {
                        "adcode": "500235",
                        "name": "云阳县"
                    }
                ]
            },
            {
                "adcode": "500113",
                "name": "巴南区",
                "s": [
                    {
                        "adcode": "500113",
                        "name": "巴南区"
                    }
                ]
            },
            {
                "adcode": "500112",
                "name": "渝北区",
                "s": [
                    {
                        "adcode": "500112",
                        "name": "渝北区"
                    }
                ]
            },
            {
                "adcode": "500233",
                "name": "忠县",
                "s": [
                    {
                        "adcode": "500233",
                        "name": "忠县"
                    }
                ]
            },
            {
                "adcode": "500156",
                "name": "武隆区",
                "s": [
                    {
                        "adcode": "500156",
                        "name": "武隆区"
                    }
                ]
            },
            {
                "adcode": "500111",
                "name": "大足区",
                "s": [
                    {
                        "adcode": "500111",
                        "name": "大足区"
                    }
                ]
            },
            {
                "adcode": "500155",
                "name": "梁平区",
                "s": [
                    {
                        "adcode": "500155",
                        "name": "梁平区"
                    }
                ]
            },
            {
                "adcode": "500118",
                "name": "永川区",
                "s": [
                    {
                        "adcode": "500118",
                        "name": "永川区"
                    }
                ]
            },
            {
                "adcode": "500117",
                "name": "合川区",
                "s": [
                    {
                        "adcode": "500117",
                        "name": "合川区"
                    }
                ]
            },
            {
                "adcode": "500238",
                "name": "巫溪县",
                "s": [
                    {
                        "adcode": "500238",
                        "name": "巫溪县"
                    }
                ]
            },
            {
                "adcode": "500116",
                "name": "江津区",
                "s": [
                    {
                        "adcode": "500116",
                        "name": "江津区"
                    }
                ]
            },
            {
                "adcode": "500237",
                "name": "巫山县",
                "s": [
                    {
                        "adcode": "500237",
                        "name": "巫山县"
                    }
                ]
            },
            {
                "adcode": "500115",
                "name": "长寿区",
                "s": [
                    {
                        "adcode": "500115",
                        "name": "长寿区"
                    }
                ]
            },
            {
                "adcode": "500236",
                "name": "奉节县",
                "s": [
                    {
                        "adcode": "500236",
                        "name": "奉节县"
                    }
                ]
            },
            {
                "adcode": "500119",
                "name": "南川区",
                "s": [
                    {
                        "adcode": "500119",
                        "name": "南川区"
                    }
                ]
            },
            {
                "adcode": "500143",
                "name": "万盛经开区",
                "s": [
                    {
                        "adcode": "500143",
                        "name": "万盛经开区"
                    }
                ]
            },
            {
                "adcode": "500242",
                "name": "酉阳土家族苗族自治县",
                "s": [
                    {
                        "adcode": "500242",
                        "name": "酉阳土家族苗族自治县"
                    }
                ]
            },
            {
                "adcode": "500142",
                "name": "北部新区",
                "s": [
                    {
                        "adcode": "500142",
                        "name": "北部新区"
                    }
                ]
            },
            {
                "adcode": "500120",
                "name": "璧山区",
                "s": [
                    {
                        "adcode": "500120",
                        "name": "璧山区"
                    }
                ]
            },
            {
                "adcode": "500241",
                "name": "秀山土家族苗族自治县",
                "s": [
                    {
                        "adcode": "500241",
                        "name": "秀山土家族苗族自治县"
                    }
                ]
            },
            {
                "adcode": "500141",
                "name": "高新区",
                "s": [
                    {
                        "adcode": "500141",
                        "name": "高新区"
                    }
                ]
            },
            {
                "adcode": "500240",
                "name": "石柱土家族自治县",
                "s": [
                    {
                        "adcode": "500240",
                        "name": "石柱土家族自治县"
                    }
                ]
            },
            {
                "adcode": "500140",
                "name": "经济技术开发区",
                "s": [
                    {
                        "adcode": "500140",
                        "name": "经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "500103",
                "name": "渝中区",
                "s": [
                    {
                        "adcode": "500103",
                        "name": "渝中区"
                    }
                ]
            },
            {
                "adcode": "500102",
                "name": "涪陵区",
                "s": [
                    {
                        "adcode": "500102",
                        "name": "涪陵区"
                    }
                ]
            },
            {
                "adcode": "500101",
                "name": "万州区",
                "s": [
                    {
                        "adcode": "500101",
                        "name": "万州区"
                    }
                ]
            },
            {
                "adcode": "500243",
                "name": "彭水苗族土家族自治县",
                "s": [
                    {
                        "adcode": "500243",
                        "name": "彭水苗族土家族自治县"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "45",
        "name": "广西壮族自治区",
        "s": [
            {
                "adcode": "4507",
                "name": "钦州市",
                "s": [
                    {
                        "adcode": "450799",
                        "name": "钦州市市本级"
                    },
                    {
                        "adcode": "450702",
                        "name": "钦南区"
                    },
                    {
                        "adcode": "450703",
                        "name": "钦北区"
                    },
                    {
                        "adcode": "450721",
                        "name": "灵山县"
                    },
                    {
                        "adcode": "450722",
                        "name": "浦北县"
                    },
                    {
                        "adcode": "450740",
                        "name": "钦州港经济技术开发区"
                    },
                    {
                        "adcode": "450701",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4508",
                "name": "贵港市",
                "s": [
                    {
                        "adcode": "450899",
                        "name": "贵港市市本级"
                    },
                    {
                        "adcode": "450802",
                        "name": "港北区"
                    },
                    {
                        "adcode": "450803",
                        "name": "港南区"
                    },
                    {
                        "adcode": "450804",
                        "name": "覃塘区"
                    },
                    {
                        "adcode": "450821",
                        "name": "平南县"
                    },
                    {
                        "adcode": "450881",
                        "name": "桂平市"
                    },
                    {
                        "adcode": "450801",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4509",
                "name": "玉林市",
                "s": [
                    {
                        "adcode": "450999",
                        "name": "玉林市市本级"
                    },
                    {
                        "adcode": "450902",
                        "name": "玉州区"
                    },
                    {
                        "adcode": "450903",
                        "name": "福绵区"
                    },
                    {
                        "adcode": "450921",
                        "name": "容县"
                    },
                    {
                        "adcode": "450922",
                        "name": "陆川县"
                    },
                    {
                        "adcode": "450923",
                        "name": "博白县"
                    },
                    {
                        "adcode": "450924",
                        "name": "兴业县"
                    },
                    {
                        "adcode": "450940",
                        "name": "玉东新区"
                    },
                    {
                        "adcode": "450981",
                        "name": "北流市"
                    },
                    {
                        "adcode": "450901",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4510",
                "name": "百色市",
                "s": [
                    {
                        "adcode": "451099",
                        "name": "百色市市本级"
                    },
                    {
                        "adcode": "451002",
                        "name": "右江区"
                    },
                    {
                        "adcode": "451021",
                        "name": "田阳县"
                    },
                    {
                        "adcode": "451022",
                        "name": "田东县"
                    },
                    {
                        "adcode": "451023",
                        "name": "平果县"
                    },
                    {
                        "adcode": "451024",
                        "name": "德保县"
                    },
                    {
                        "adcode": "451025",
                        "name": "靖西县"
                    },
                    {
                        "adcode": "451026",
                        "name": "那坡县"
                    },
                    {
                        "adcode": "451027",
                        "name": "凌云县"
                    },
                    {
                        "adcode": "451028",
                        "name": "乐业县"
                    },
                    {
                        "adcode": "451029",
                        "name": "田林县"
                    },
                    {
                        "adcode": "451030",
                        "name": "西林县"
                    },
                    {
                        "adcode": "451031",
                        "name": "隆林各族自治县"
                    },
                    {
                        "adcode": "451001",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "451081",
                        "name": "靖西市"
                    }
                ]
            },
            {
                "adcode": "4511",
                "name": "贺州市",
                "s": [
                    {
                        "adcode": "451199",
                        "name": "贺州市市本级"
                    },
                    {
                        "adcode": "451102",
                        "name": "八步区"
                    },
                    {
                        "adcode": "451121",
                        "name": "昭平县"
                    },
                    {
                        "adcode": "451122",
                        "name": "钟山县"
                    },
                    {
                        "adcode": "451123",
                        "name": "富川瑶族自治县"
                    },
                    {
                        "adcode": "451140",
                        "name": "平桂管理区"
                    },
                    {
                        "adcode": "451101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "451103",
                        "name": "平桂区"
                    }
                ]
            },
            {
                "adcode": "4501",
                "name": "南宁市",
                "s": [
                    {
                        "adcode": "450199",
                        "name": "南宁市市本级"
                    },
                    {
                        "adcode": "450102",
                        "name": "兴宁区"
                    },
                    {
                        "adcode": "450103",
                        "name": "青秀区"
                    },
                    {
                        "adcode": "450105",
                        "name": "江南区"
                    },
                    {
                        "adcode": "450107",
                        "name": "西乡塘区"
                    },
                    {
                        "adcode": "450108",
                        "name": "良庆区"
                    },
                    {
                        "adcode": "450109",
                        "name": "邕宁区"
                    },
                    {
                        "adcode": "450122",
                        "name": "武鸣县"
                    },
                    {
                        "adcode": "450123",
                        "name": "隆安县"
                    },
                    {
                        "adcode": "450124",
                        "name": "马山县"
                    },
                    {
                        "adcode": "450125",
                        "name": "上林县"
                    },
                    {
                        "adcode": "450126",
                        "name": "宾阳县"
                    },
                    {
                        "adcode": "450127",
                        "name": "横县"
                    },
                    {
                        "adcode": "450140",
                        "name": "高新技术产业开发区"
                    },
                    {
                        "adcode": "450141",
                        "name": "经济技术开发区"
                    },
                    {
                        "adcode": "450142",
                        "name": "广西-东盟经济开发区"
                    },
                    {
                        "adcode": "450101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "450110",
                        "name": "武鸣区"
                    }
                ]
            },
            {
                "adcode": "4512",
                "name": "河池市",
                "s": [
                    {
                        "adcode": "451299",
                        "name": "河池市市本级"
                    },
                    {
                        "adcode": "451202",
                        "name": "金城江区"
                    },
                    {
                        "adcode": "451221",
                        "name": "南丹县"
                    },
                    {
                        "adcode": "451222",
                        "name": "天峨县"
                    },
                    {
                        "adcode": "451223",
                        "name": "凤山县"
                    },
                    {
                        "adcode": "451224",
                        "name": "东兰县"
                    },
                    {
                        "adcode": "451225",
                        "name": "罗城仫佬族自治县"
                    },
                    {
                        "adcode": "451226",
                        "name": "环江毛南族自治县"
                    },
                    {
                        "adcode": "451227",
                        "name": "巴马瑶族自治县"
                    },
                    {
                        "adcode": "451228",
                        "name": "都安瑶族自治县"
                    },
                    {
                        "adcode": "451229",
                        "name": "大化瑶族自治县"
                    },
                    {
                        "adcode": "451281",
                        "name": "宜州市"
                    },
                    {
                        "adcode": "451201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "451203",
                        "name": "宜州区"
                    }
                ]
            },
            {
                "adcode": "4502",
                "name": "柳州市",
                "s": [
                    {
                        "adcode": "450299",
                        "name": "柳州市市本级"
                    },
                    {
                        "adcode": "450202",
                        "name": "城中区"
                    },
                    {
                        "adcode": "450203",
                        "name": "鱼峰区"
                    },
                    {
                        "adcode": "450204",
                        "name": "柳南区"
                    },
                    {
                        "adcode": "450205",
                        "name": "柳北区"
                    },
                    {
                        "adcode": "450221",
                        "name": "柳江县"
                    },
                    {
                        "adcode": "450222",
                        "name": "柳城县"
                    },
                    {
                        "adcode": "450223",
                        "name": "鹿寨县"
                    },
                    {
                        "adcode": "450224",
                        "name": "融安县"
                    },
                    {
                        "adcode": "450225",
                        "name": "融水苗族自治县"
                    },
                    {
                        "adcode": "450226",
                        "name": "三江侗族自治县"
                    },
                    {
                        "adcode": "450240",
                        "name": "柳州市柳东新区"
                    },
                    {
                        "adcode": "450241",
                        "name": "柳州市阳和工业新区"
                    },
                    {
                        "adcode": "450201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "450206",
                        "name": "柳江区"
                    }
                ]
            },
            {
                "adcode": "4513",
                "name": "来宾市",
                "s": [
                    {
                        "adcode": "451399",
                        "name": "来宾市市本级"
                    },
                    {
                        "adcode": "451302",
                        "name": "兴宾区"
                    },
                    {
                        "adcode": "451321",
                        "name": "忻城县"
                    },
                    {
                        "adcode": "451322",
                        "name": "象州县"
                    },
                    {
                        "adcode": "451323",
                        "name": "武宣县"
                    },
                    {
                        "adcode": "451324",
                        "name": "金秀瑶族自治县"
                    },
                    {
                        "adcode": "451381",
                        "name": "合山市"
                    },
                    {
                        "adcode": "451301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4503",
                "name": "桂林市",
                "s": [
                    {
                        "adcode": "450399",
                        "name": "桂林市市本级"
                    },
                    {
                        "adcode": "450302",
                        "name": "秀峰区"
                    },
                    {
                        "adcode": "450303",
                        "name": "叠彩区"
                    },
                    {
                        "adcode": "450304",
                        "name": "象山区"
                    },
                    {
                        "adcode": "450305",
                        "name": "七星区"
                    },
                    {
                        "adcode": "450311",
                        "name": "雁山区"
                    },
                    {
                        "adcode": "450321",
                        "name": "阳朔县"
                    },
                    {
                        "adcode": "450322",
                        "name": "临桂县"
                    },
                    {
                        "adcode": "450323",
                        "name": "灵川县"
                    },
                    {
                        "adcode": "450324",
                        "name": "全州县"
                    },
                    {
                        "adcode": "450325",
                        "name": "兴安县"
                    },
                    {
                        "adcode": "450326",
                        "name": "永福县"
                    },
                    {
                        "adcode": "450327",
                        "name": "灌阳县"
                    },
                    {
                        "adcode": "450328",
                        "name": "龙胜各族自治县"
                    },
                    {
                        "adcode": "450329",
                        "name": "资源县"
                    },
                    {
                        "adcode": "450330",
                        "name": "平乐县"
                    },
                    {
                        "adcode": "450331",
                        "name": "荔蒲县"
                    },
                    {
                        "adcode": "450332",
                        "name": "恭城瑶族自治县"
                    },
                    {
                        "adcode": "450301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "450312",
                        "name": "临桂区"
                    },
                    {
                        "adcode": "450381",
                        "name": "荔浦市"
                    }
                ]
            },
            {
                "adcode": "4514",
                "name": "崇左市",
                "s": [
                    {
                        "adcode": "451499",
                        "name": "崇左市市本级"
                    },
                    {
                        "adcode": "451402",
                        "name": "江洲区"
                    },
                    {
                        "adcode": "451421",
                        "name": "扶绥县"
                    },
                    {
                        "adcode": "451422",
                        "name": "宁明县"
                    },
                    {
                        "adcode": "451423",
                        "name": "龙州县"
                    },
                    {
                        "adcode": "451424",
                        "name": "大新县"
                    },
                    {
                        "adcode": "451425",
                        "name": "天等县"
                    },
                    {
                        "adcode": "451481",
                        "name": "凭祥市"
                    },
                    {
                        "adcode": "451401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "451402",
                        "name": "江州区"
                    }
                ]
            },
            {
                "adcode": "4504",
                "name": "梧州市",
                "s": [
                    {
                        "adcode": "450499",
                        "name": "梧州市市本级"
                    },
                    {
                        "adcode": "450403",
                        "name": "万秀区"
                    },
                    {
                        "adcode": "450404",
                        "name": "蝶山区"
                    },
                    {
                        "adcode": "450405",
                        "name": "长洲区"
                    },
                    {
                        "adcode": "450406",
                        "name": "龙圩区"
                    },
                    {
                        "adcode": "450421",
                        "name": "苍梧县"
                    },
                    {
                        "adcode": "450422",
                        "name": "藤县"
                    },
                    {
                        "adcode": "450423",
                        "name": "蒙山县"
                    },
                    {
                        "adcode": "450481",
                        "name": "岑溪市"
                    },
                    {
                        "adcode": "450401",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4505",
                "name": "北海市",
                "s": [
                    {
                        "adcode": "450599",
                        "name": "北海市市本级"
                    },
                    {
                        "adcode": "450502",
                        "name": "海城区"
                    },
                    {
                        "adcode": "450503",
                        "name": "银海区"
                    },
                    {
                        "adcode": "450512",
                        "name": "铁山港区"
                    },
                    {
                        "adcode": "450521",
                        "name": "合浦县"
                    },
                    {
                        "adcode": "450501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4506",
                "name": "防城港市",
                "s": [
                    {
                        "adcode": "450699",
                        "name": "防城港市市本级"
                    },
                    {
                        "adcode": "450602",
                        "name": "港口区"
                    },
                    {
                        "adcode": "450603",
                        "name": "防城区"
                    },
                    {
                        "adcode": "450621",
                        "name": "上思县"
                    },
                    {
                        "adcode": "450681",
                        "name": "东兴市"
                    },
                    {
                        "adcode": "450601",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "42",
        "name": "湖北省",
        "s": [
            {
                "adcode": "4210",
                "name": "荆州市",
                "s": [
                    {
                        "adcode": "421099",
                        "name": "荆州市市本级"
                    },
                    {
                        "adcode": "421002",
                        "name": "沙市区"
                    },
                    {
                        "adcode": "421003",
                        "name": "荆州区"
                    },
                    {
                        "adcode": "421022",
                        "name": "公安县"
                    },
                    {
                        "adcode": "421023",
                        "name": "监利县"
                    },
                    {
                        "adcode": "421024",
                        "name": "江陵县"
                    },
                    {
                        "adcode": "421040",
                        "name": "荆州经济技术开发区"
                    },
                    {
                        "adcode": "421081",
                        "name": "石首市"
                    },
                    {
                        "adcode": "421083",
                        "name": "洪湖市"
                    },
                    {
                        "adcode": "421087",
                        "name": "松滋市"
                    },
                    {
                        "adcode": "421001",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4211",
                "name": "黄冈市",
                "s": [
                    {
                        "adcode": "421199",
                        "name": "黄冈市市本级"
                    },
                    {
                        "adcode": "421102",
                        "name": "黄州区"
                    },
                    {
                        "adcode": "421121",
                        "name": "团风县"
                    },
                    {
                        "adcode": "421122",
                        "name": "红安县"
                    },
                    {
                        "adcode": "421123",
                        "name": "罗田县"
                    },
                    {
                        "adcode": "421124",
                        "name": "英山县"
                    },
                    {
                        "adcode": "421125",
                        "name": "浠水县"
                    },
                    {
                        "adcode": "421126",
                        "name": "蕲春县"
                    },
                    {
                        "adcode": "421127",
                        "name": "黄梅县"
                    },
                    {
                        "adcode": "421181",
                        "name": "麻城市"
                    },
                    {
                        "adcode": "421182",
                        "name": "武穴市"
                    },
                    {
                        "adcode": "421140",
                        "name": "龙感湖管理区"
                    },
                    {
                        "adcode": "421101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4201",
                "name": "武汉市",
                "s": [
                    {
                        "adcode": "420199",
                        "name": "武汉市市本级"
                    },
                    {
                        "adcode": "420102",
                        "name": "江岸区"
                    },
                    {
                        "adcode": "420103",
                        "name": "江汉区"
                    },
                    {
                        "adcode": "420104",
                        "name": "硚口区"
                    },
                    {
                        "adcode": "420105",
                        "name": "汉阳区"
                    },
                    {
                        "adcode": "420106",
                        "name": "武昌区"
                    },
                    {
                        "adcode": "420107",
                        "name": "青山区"
                    },
                    {
                        "adcode": "420111",
                        "name": "洪山区"
                    },
                    {
                        "adcode": "420112",
                        "name": "东西湖区"
                    },
                    {
                        "adcode": "420113",
                        "name": "汉南区"
                    },
                    {
                        "adcode": "420114",
                        "name": "蔡甸区"
                    },
                    {
                        "adcode": "420115",
                        "name": "江夏区"
                    },
                    {
                        "adcode": "420116",
                        "name": "黄陂区"
                    },
                    {
                        "adcode": "420117",
                        "name": "新洲区"
                    },
                    {
                        "adcode": "420140",
                        "name": "东湖高新开发区"
                    },
                    {
                        "adcode": "420141",
                        "name": "武汉经济开发区"
                    },
                    {
                        "adcode": "420101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4212",
                "name": "咸宁市",
                "s": [
                    {
                        "adcode": "421299",
                        "name": "咸宁市市本级"
                    },
                    {
                        "adcode": "421202",
                        "name": "咸安区"
                    },
                    {
                        "adcode": "421221",
                        "name": "嘉鱼县"
                    },
                    {
                        "adcode": "421222",
                        "name": "通城县"
                    },
                    {
                        "adcode": "421223",
                        "name": "崇阳县"
                    },
                    {
                        "adcode": "421224",
                        "name": "通山县"
                    },
                    {
                        "adcode": "421281",
                        "name": "赤壁市"
                    },
                    {
                        "adcode": "421201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4290",
                "name": "省直辖县级行政区划",
                "s": [
                    {
                        "adcode": "429004",
                        "name": "仙桃市"
                    },
                    {
                        "adcode": "429006",
                        "name": "天门市"
                    },
                    {
                        "adcode": "429021",
                        "name": "神农架林区"
                    },
                    {
                        "adcode": "429005",
                        "name": "潜江市"
                    },
                    {
                        "adcode": "429021",
                        "name": "神农架林区"
                    }
                ]
            },
            {
                "adcode": "4202",
                "name": "黄石市",
                "s": [
                    {
                        "adcode": "420299",
                        "name": "黄石市市本级"
                    },
                    {
                        "adcode": "420202",
                        "name": "黄石港区"
                    },
                    {
                        "adcode": "420203",
                        "name": "西塞山区"
                    },
                    {
                        "adcode": "420204",
                        "name": "下陆区"
                    },
                    {
                        "adcode": "420205",
                        "name": "铁山区"
                    },
                    {
                        "adcode": "420222",
                        "name": "阳新县"
                    },
                    {
                        "adcode": "420240",
                        "name": "黄石市经济技术开发区"
                    },
                    {
                        "adcode": "420281",
                        "name": "大冶市"
                    },
                    {
                        "adcode": "420201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4213",
                "name": "随州市",
                "s": [
                    {
                        "adcode": "421399",
                        "name": "随州市市本级"
                    },
                    {
                        "adcode": "421381",
                        "name": "广水市"
                    },
                    {
                        "adcode": "421321",
                        "name": "随县"
                    },
                    {
                        "adcode": "421301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "421303",
                        "name": "曾都区"
                    }
                ]
            },
            {
                "adcode": "4203",
                "name": "十堰市",
                "s": [
                    {
                        "adcode": "420399",
                        "name": "十堰市市本级"
                    },
                    {
                        "adcode": "420302",
                        "name": "茅箭区"
                    },
                    {
                        "adcode": "420303",
                        "name": "张湾区"
                    },
                    {
                        "adcode": "420321",
                        "name": "郧县"
                    },
                    {
                        "adcode": "420322",
                        "name": "郧西县"
                    },
                    {
                        "adcode": "420323",
                        "name": "竹山县"
                    },
                    {
                        "adcode": "420324",
                        "name": "竹溪县"
                    },
                    {
                        "adcode": "420325",
                        "name": "房县"
                    },
                    {
                        "adcode": "420340",
                        "name": "武当山特区"
                    },
                    {
                        "adcode": "420341",
                        "name": "十堰经济技术开发区"
                    },
                    {
                        "adcode": "420381",
                        "name": "丹江口市"
                    },
                    {
                        "adcode": "420301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "420304",
                        "name": "郧阳区"
                    }
                ]
            },
            {
                "adcode": "4205",
                "name": "宜昌市",
                "s": [
                    {
                        "adcode": "420599",
                        "name": "宜昌市市本级"
                    },
                    {
                        "adcode": "420502",
                        "name": "西陵区"
                    },
                    {
                        "adcode": "420503",
                        "name": "伍家岗区"
                    },
                    {
                        "adcode": "420504",
                        "name": "点军区"
                    },
                    {
                        "adcode": "420505",
                        "name": "猇亭区"
                    },
                    {
                        "adcode": "420506",
                        "name": "夷陵区"
                    },
                    {
                        "adcode": "420525",
                        "name": "远安县"
                    },
                    {
                        "adcode": "420526",
                        "name": "兴山县"
                    },
                    {
                        "adcode": "420527",
                        "name": "秭归县"
                    },
                    {
                        "adcode": "420528",
                        "name": "长阳土家族自治县"
                    },
                    {
                        "adcode": "420529",
                        "name": "五峰土家族自治县"
                    },
                    {
                        "adcode": "420540",
                        "name": "开发区"
                    },
                    {
                        "adcode": "420581",
                        "name": "宜都市"
                    },
                    {
                        "adcode": "420582",
                        "name": "当阳市"
                    },
                    {
                        "adcode": "420583",
                        "name": "枝江市"
                    },
                    {
                        "adcode": "420501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4206",
                "name": "襄阳市",
                "s": [
                    {
                        "adcode": "420699",
                        "name": "襄阳市市本级"
                    },
                    {
                        "adcode": "420602",
                        "name": "襄城区"
                    },
                    {
                        "adcode": "420606",
                        "name": "樊城区"
                    },
                    {
                        "adcode": "420607",
                        "name": "襄州区"
                    },
                    {
                        "adcode": "420624",
                        "name": "南漳县"
                    },
                    {
                        "adcode": "420625",
                        "name": "谷城县"
                    },
                    {
                        "adcode": "420626",
                        "name": "保康县"
                    },
                    {
                        "adcode": "420640",
                        "name": "襄阳高新技术开发区"
                    },
                    {
                        "adcode": "420641",
                        "name": "东津新区（襄阳经济技术开发区）"
                    },
                    {
                        "adcode": "420682",
                        "name": "老河口市"
                    },
                    {
                        "adcode": "420683",
                        "name": "枣阳市"
                    },
                    {
                        "adcode": "420684",
                        "name": "宜城市"
                    },
                    {
                        "adcode": "420601",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4228",
                "name": "恩施土家族苗族自治州",
                "s": [
                    {
                        "adcode": "422899",
                        "name": "恩施土家族苗族自治州州本级"
                    },
                    {
                        "adcode": "422801",
                        "name": "恩施市"
                    },
                    {
                        "adcode": "422802",
                        "name": "利川市"
                    },
                    {
                        "adcode": "422822",
                        "name": "建始县"
                    },
                    {
                        "adcode": "422823",
                        "name": "巴东县"
                    },
                    {
                        "adcode": "422825",
                        "name": "宣恩县"
                    },
                    {
                        "adcode": "422826",
                        "name": "咸丰县"
                    },
                    {
                        "adcode": "422827",
                        "name": "来凤县"
                    },
                    {
                        "adcode": "422828",
                        "name": "鹤峰县"
                    }
                ]
            },
            {
                "adcode": "4207",
                "name": "鄂州市",
                "s": [
                    {
                        "adcode": "420799",
                        "name": "鄂州市市本级"
                    },
                    {
                        "adcode": "420702",
                        "name": "梁子湖区"
                    },
                    {
                        "adcode": "420703",
                        "name": "华容区"
                    },
                    {
                        "adcode": "420704",
                        "name": "鄂城区"
                    },
                    {
                        "adcode": "420740",
                        "name": "葛店开发区"
                    },
                    {
                        "adcode": "420741",
                        "name": "长港农场"
                    },
                    {
                        "adcode": "420701",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4208",
                "name": "荆门市",
                "s": [
                    {
                        "adcode": "420899",
                        "name": "荆门市市本级"
                    },
                    {
                        "adcode": "420802",
                        "name": "东宝区"
                    },
                    {
                        "adcode": "420804",
                        "name": "掇刀区"
                    },
                    {
                        "adcode": "420821",
                        "name": "京山市"
                    },
                    {
                        "adcode": "420822",
                        "name": "沙洋县"
                    },
                    {
                        "adcode": "420840",
                        "name": "屈家岭管理区"
                    },
                    {
                        "adcode": "420881",
                        "name": "钟祥市"
                    },
                    {
                        "adcode": "420801",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4209",
                "name": "孝感市",
                "s": [
                    {
                        "adcode": "420999",
                        "name": "孝感市市本级"
                    },
                    {
                        "adcode": "420902",
                        "name": "孝南区"
                    },
                    {
                        "adcode": "420921",
                        "name": "孝昌县"
                    },
                    {
                        "adcode": "420922",
                        "name": "大悟县"
                    },
                    {
                        "adcode": "420923",
                        "name": "云梦县"
                    },
                    {
                        "adcode": "420981",
                        "name": "应城市"
                    },
                    {
                        "adcode": "420982",
                        "name": "安陆市"
                    },
                    {
                        "adcode": "420984",
                        "name": "汉川市"
                    },
                    {
                        "adcode": "420901",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "62",
        "name": "甘肃省",
        "s": [
            {
                "adcode": "6230",
                "name": "甘南藏族自治州",
                "s": [
                    {
                        "adcode": "623099",
                        "name": "甘南藏族自治州州本级"
                    },
                    {
                        "adcode": "623001",
                        "name": "合作市"
                    },
                    {
                        "adcode": "623021",
                        "name": "临潭县"
                    },
                    {
                        "adcode": "623022",
                        "name": "卓尼县"
                    },
                    {
                        "adcode": "623023",
                        "name": "舟曲县"
                    },
                    {
                        "adcode": "623024",
                        "name": "迭部县"
                    },
                    {
                        "adcode": "623025",
                        "name": "玛曲县"
                    },
                    {
                        "adcode": "623026",
                        "name": "碌曲县"
                    },
                    {
                        "adcode": "623027",
                        "name": "夏河县"
                    }
                ]
            },
            {
                "adcode": "6210",
                "name": "庆阳市",
                "s": [
                    {
                        "adcode": "621099",
                        "name": "庆阳市市本级"
                    },
                    {
                        "adcode": "621002",
                        "name": "西峰区"
                    },
                    {
                        "adcode": "621021",
                        "name": "庆城县"
                    },
                    {
                        "adcode": "621022",
                        "name": "环县"
                    },
                    {
                        "adcode": "621023",
                        "name": "华池县"
                    },
                    {
                        "adcode": "621024",
                        "name": "合水县"
                    },
                    {
                        "adcode": "621025",
                        "name": "正宁县"
                    },
                    {
                        "adcode": "621026",
                        "name": "宁县"
                    },
                    {
                        "adcode": "621027",
                        "name": "镇原县"
                    },
                    {
                        "adcode": "621001",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6201",
                "name": "兰州市",
                "s": [
                    {
                        "adcode": "620199",
                        "name": "兰州市市本级"
                    },
                    {
                        "adcode": "620102",
                        "name": "城关区"
                    },
                    {
                        "adcode": "620103",
                        "name": "七里河区"
                    },
                    {
                        "adcode": "620104",
                        "name": "西固区"
                    },
                    {
                        "adcode": "620105",
                        "name": "安宁区"
                    },
                    {
                        "adcode": "620111",
                        "name": "红古区"
                    },
                    {
                        "adcode": "620121",
                        "name": "永登县"
                    },
                    {
                        "adcode": "620122",
                        "name": "皋兰县"
                    },
                    {
                        "adcode": "620123",
                        "name": "榆中县"
                    },
                    {
                        "adcode": "620140",
                        "name": "兰州新区"
                    },
                    {
                        "adcode": "620101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6212",
                "name": "陇南市",
                "s": [
                    {
                        "adcode": "621299",
                        "name": "陇南市市本级"
                    },
                    {
                        "adcode": "621202",
                        "name": "武都区"
                    },
                    {
                        "adcode": "621221",
                        "name": "成县"
                    },
                    {
                        "adcode": "621222",
                        "name": "文县"
                    },
                    {
                        "adcode": "621223",
                        "name": "宕昌县"
                    },
                    {
                        "adcode": "621224",
                        "name": "康县"
                    },
                    {
                        "adcode": "621225",
                        "name": "西和县"
                    },
                    {
                        "adcode": "621226",
                        "name": "礼县"
                    },
                    {
                        "adcode": "621227",
                        "name": "徽县"
                    },
                    {
                        "adcode": "621228",
                        "name": "两当县"
                    },
                    {
                        "adcode": "621201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6211",
                "name": "定西市",
                "s": [
                    {
                        "adcode": "621199",
                        "name": "定西市市本级"
                    },
                    {
                        "adcode": "621102",
                        "name": "安定区"
                    },
                    {
                        "adcode": "621121",
                        "name": "通渭县"
                    },
                    {
                        "adcode": "621122",
                        "name": "陇西县"
                    },
                    {
                        "adcode": "621123",
                        "name": "渭源县"
                    },
                    {
                        "adcode": "621124",
                        "name": "临洮县"
                    },
                    {
                        "adcode": "621125",
                        "name": "漳县"
                    },
                    {
                        "adcode": "621126",
                        "name": "岷县"
                    },
                    {
                        "adcode": "621101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6203",
                "name": "金昌市",
                "s": [
                    {
                        "adcode": "620399",
                        "name": "金昌市市本级"
                    },
                    {
                        "adcode": "620302",
                        "name": "金川区"
                    },
                    {
                        "adcode": "620321",
                        "name": "永昌县"
                    },
                    {
                        "adcode": "620301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6202",
                "name": "嘉峪关市",
                "s": [
                    {
                        "adcode": "620299",
                        "name": "嘉峪关市市本级"
                    },
                    {
                        "adcode": "620201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "620201402",
                        "name": "镜铁区"
                    },
                    {
                        "adcode": "620201101",
                        "name": "峪泉镇"
                    },
                    {
                        "adcode": "620201100",
                        "name": "新城镇"
                    },
                    {
                        "adcode": "620201403",
                        "name": "长城区"
                    },
                    {
                        "adcode": "620201401",
                        "name": "雄关区"
                    }
                ]
            },
            {
                "adcode": "6270",
                "name": "甘肃矿区",
                "s": [
                    {
                        "adcode": "627099",
                        "name": "甘肃矿区本级"
                    }
                ]
            },
            {
                "adcode": "6205",
                "name": "天水市",
                "s": [
                    {
                        "adcode": "620599",
                        "name": "天水市市本级"
                    },
                    {
                        "adcode": "620502",
                        "name": "秦州区"
                    },
                    {
                        "adcode": "620503",
                        "name": "麦积区"
                    },
                    {
                        "adcode": "620521",
                        "name": "清水县"
                    },
                    {
                        "adcode": "620522",
                        "name": "秦安县"
                    },
                    {
                        "adcode": "620523",
                        "name": "甘谷县"
                    },
                    {
                        "adcode": "620524",
                        "name": "武山县"
                    },
                    {
                        "adcode": "620525",
                        "name": "张家川回族自治县"
                    },
                    {
                        "adcode": "620501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6204",
                "name": "白银市",
                "s": [
                    {
                        "adcode": "620499",
                        "name": "白银市市本级"
                    },
                    {
                        "adcode": "620402",
                        "name": "白银区"
                    },
                    {
                        "adcode": "620403",
                        "name": "平川区"
                    },
                    {
                        "adcode": "620421",
                        "name": "靖远县"
                    },
                    {
                        "adcode": "620422",
                        "name": "会宁县"
                    },
                    {
                        "adcode": "620423",
                        "name": "景泰县"
                    },
                    {
                        "adcode": "620401",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6207",
                "name": "张掖市",
                "s": [
                    {
                        "adcode": "620799",
                        "name": "张掖市市本级"
                    },
                    {
                        "adcode": "620702",
                        "name": "甘州区"
                    },
                    {
                        "adcode": "620721",
                        "name": "肃南裕固族自治县"
                    },
                    {
                        "adcode": "620722",
                        "name": "民乐县"
                    },
                    {
                        "adcode": "620723",
                        "name": "临泽县"
                    },
                    {
                        "adcode": "620724",
                        "name": "高台县"
                    },
                    {
                        "adcode": "620725",
                        "name": "山丹县"
                    },
                    {
                        "adcode": "620701",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6229",
                "name": "临夏回族自治州",
                "s": [
                    {
                        "adcode": "622999",
                        "name": "临夏回族自治州州本级"
                    },
                    {
                        "adcode": "622901",
                        "name": "临夏市"
                    },
                    {
                        "adcode": "622921",
                        "name": "临夏县"
                    },
                    {
                        "adcode": "622922",
                        "name": "康乐县"
                    },
                    {
                        "adcode": "622923",
                        "name": "永靖县"
                    },
                    {
                        "adcode": "622924",
                        "name": "广河县"
                    },
                    {
                        "adcode": "622925",
                        "name": "和政县"
                    },
                    {
                        "adcode": "622926",
                        "name": "东乡族自治县"
                    },
                    {
                        "adcode": "622927",
                        "name": "积石山保安族东乡族撒拉族自治县"
                    }
                ]
            },
            {
                "adcode": "6206",
                "name": "武威市",
                "s": [
                    {
                        "adcode": "620699",
                        "name": "武威市市本级"
                    },
                    {
                        "adcode": "620602",
                        "name": "凉州区"
                    },
                    {
                        "adcode": "620621",
                        "name": "民勤县"
                    },
                    {
                        "adcode": "620622",
                        "name": "古浪县"
                    },
                    {
                        "adcode": "620623",
                        "name": "天祝藏族自治县"
                    },
                    {
                        "adcode": "620601",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6209",
                "name": "酒泉市",
                "s": [
                    {
                        "adcode": "620999",
                        "name": "酒泉市市本级"
                    },
                    {
                        "adcode": "620902",
                        "name": "肃州区"
                    },
                    {
                        "adcode": "620921",
                        "name": "金塔县"
                    },
                    {
                        "adcode": "620922",
                        "name": "瓜州县"
                    },
                    {
                        "adcode": "620923",
                        "name": "肃北蒙古族自治县"
                    },
                    {
                        "adcode": "620924",
                        "name": "阿克塞哈萨克族自治县"
                    },
                    {
                        "adcode": "620981",
                        "name": "玉门市"
                    },
                    {
                        "adcode": "620982",
                        "name": "敦煌市"
                    },
                    {
                        "adcode": "620901",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6208",
                "name": "平凉市",
                "s": [
                    {
                        "adcode": "620899",
                        "name": "平凉市市本级"
                    },
                    {
                        "adcode": "620802",
                        "name": "崆峒区"
                    },
                    {
                        "adcode": "620821",
                        "name": "泾川县"
                    },
                    {
                        "adcode": "620822",
                        "name": "灵台县"
                    },
                    {
                        "adcode": "620823",
                        "name": "崇信县"
                    },
                    {
                        "adcode": "620824",
                        "name": "华亭县"
                    },
                    {
                        "adcode": "620825",
                        "name": "庄浪县"
                    },
                    {
                        "adcode": "620826",
                        "name": "静宁县"
                    },
                    {
                        "adcode": "620801",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "620881",
                        "name": "华亭市"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "46",
        "name": "海南省",
        "s": [
            {
                "adcode": "4690",
                "name": "省直辖县级行政单位",
                "s": [
                    {
                        "adcode": "469001",
                        "name": "五指山市"
                    },
                    {
                        "adcode": "469003",
                        "name": "儋州市"
                    },
                    {
                        "adcode": "469005",
                        "name": "文昌市"
                    },
                    {
                        "adcode": "469006",
                        "name": "万宁市"
                    },
                    {
                        "adcode": "469007",
                        "name": "东方市"
                    },
                    {
                        "adcode": "469021",
                        "name": "定安县"
                    },
                    {
                        "adcode": "469022",
                        "name": "屯昌县"
                    },
                    {
                        "adcode": "469023",
                        "name": "澄迈县"
                    },
                    {
                        "adcode": "469024",
                        "name": "临高县"
                    },
                    {
                        "adcode": "469025",
                        "name": "白沙黎族自治县"
                    },
                    {
                        "adcode": "469026",
                        "name": "昌江黎族自治县"
                    },
                    {
                        "adcode": "469027",
                        "name": "乐东黎族自治县"
                    },
                    {
                        "adcode": "469028",
                        "name": "陵水黎族自治县"
                    },
                    {
                        "adcode": "469029",
                        "name": "保亭黎族苗族自治县"
                    },
                    {
                        "adcode": "469030",
                        "name": "琼中黎族苗族自治县"
                    },
                    {
                        "adcode": "469031",
                        "name": "西沙群岛"
                    },
                    {
                        "adcode": "469032",
                        "name": "南沙群岛"
                    },
                    {
                        "adcode": "469033",
                        "name": "中沙群岛的岛礁及其海域"
                    },
                    {
                        "adcode": "469002",
                        "name": "琼海市"
                    },
                    {
                        "adcode": "469006",
                        "name": "万宁市"
                    },
                    {
                        "adcode": "469024",
                        "name": "临高县"
                    },
                    {
                        "adcode": "469027",
                        "name": "乐东黎族自治县"
                    },
                    {
                        "adcode": "469001",
                        "name": "五指山市"
                    },
                    {
                        "adcode": "469029",
                        "name": "保亭黎族苗族自治县"
                    },
                    {
                        "adcode": "469021",
                        "name": "定安县"
                    },
                    {
                        "adcode": "469022",
                        "name": "屯昌县"
                    },
                    {
                        "adcode": "469005",
                        "name": "文昌市"
                    },
                    {
                        "adcode": "469026",
                        "name": "昌江黎族自治县"
                    },
                    {
                        "adcode": "469023",
                        "name": "澄迈县"
                    },
                    {
                        "adcode": "469030",
                        "name": "琼中黎族苗族自治县"
                    },
                    {
                        "adcode": "469025",
                        "name": "白沙黎族自治县"
                    },
                    {
                        "adcode": "469028",
                        "name": "陵水黎族自治县"
                    }
                ]
            },
            {
                "adcode": "4620",
                "name": "洋浦经济开发区",
                "s": [
                    {
                        "adcode": "462099",
                        "name": "洋浦经济开发区本级"
                    }
                ]
            },
            {
                "adcode": "4621",
                "name": "省农垦",
                "s": [
                    {
                        "adcode": "462199",
                        "name": "省农垦本级"
                    }
                ]
            },
            {
                "adcode": "4601",
                "name": "海口市",
                "s": [
                    {
                        "adcode": "460199",
                        "name": "海口市市本级"
                    },
                    {
                        "adcode": "460105",
                        "name": "秀英区"
                    },
                    {
                        "adcode": "460106",
                        "name": "龙华区"
                    },
                    {
                        "adcode": "460107",
                        "name": "琼山区"
                    },
                    {
                        "adcode": "460108",
                        "name": "美兰区"
                    },
                    {
                        "adcode": "460101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4602",
                "name": "三亚市",
                "s": [
                    {
                        "adcode": "460299",
                        "name": "三亚市市本级"
                    },
                    {
                        "adcode": "460201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "460202",
                        "name": "海棠区"
                    },
                    {
                        "adcode": "460203",
                        "name": "吉阳区"
                    },
                    {
                        "adcode": "460204",
                        "name": "天涯区"
                    },
                    {
                        "adcode": "460205",
                        "name": "崖州区"
                    }
                ]
            },
            {
                "adcode": "4603",
                "name": "三沙市",
                "s": [
                    {
                        "adcode": "460323",
                        "name": "中沙群岛的岛礁及其海域"
                    },
                    {
                        "adcode": "460322",
                        "name": "南沙群岛"
                    },
                    {
                        "adcode": "460321",
                        "name": "西沙群岛"
                    }
                ]
            },
            {
                "adcode": "4604",
                "name": "儋州市",
                "s": [
                    {
                        "adcode": "460400115",
                        "name": "东成镇"
                    },
                    {
                        "adcode": "460400113",
                        "name": "中和镇"
                    },
                    {
                        "adcode": "460400106",
                        "name": "光村镇"
                    },
                    {
                        "adcode": "460400105",
                        "name": "兰洋镇"
                    },
                    {
                        "adcode": "460400102",
                        "name": "南丰镇"
                    },
                    {
                        "adcode": "460400103",
                        "name": "大成镇"
                    },
                    {
                        "adcode": "460400109",
                        "name": "峨蔓镇"
                    },
                    {
                        "adcode": "460400114",
                        "name": "排浦镇"
                    },
                    {
                        "adcode": "460400107",
                        "name": "木棠镇"
                    },
                    {
                        "adcode": "460400499",
                        "name": "洋浦经济开发区"
                    },
                    {
                        "adcode": "460400108",
                        "name": "海头镇"
                    },
                    {
                        "adcode": "460400112",
                        "name": "白马井镇"
                    },
                    {
                        "adcode": "460400100",
                        "name": "那大镇"
                    },
                    {
                        "adcode": "460400104",
                        "name": "雅星镇"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "41",
        "name": "河南省",
        "s": [
            {
                "adcode": "4110",
                "name": "许昌市",
                "s": [
                    {
                        "adcode": "411099",
                        "name": "许昌市市本级"
                    },
                    {
                        "adcode": "411002",
                        "name": "魏都区"
                    },
                    {
                        "adcode": "411023",
                        "name": "许昌县"
                    },
                    {
                        "adcode": "411024",
                        "name": "鄢陵县"
                    },
                    {
                        "adcode": "411025",
                        "name": "襄城县"
                    },
                    {
                        "adcode": "411081",
                        "name": "禹州市"
                    },
                    {
                        "adcode": "411082",
                        "name": "长葛市"
                    },
                    {
                        "adcode": "411001",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "411003",
                        "name": "建安区"
                    },
                    {
                        "adcode": "411071",
                        "name": "许昌经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "4111",
                "name": "漯河市",
                "s": [
                    {
                        "adcode": "411199",
                        "name": "漯河市市本级"
                    },
                    {
                        "adcode": "411102",
                        "name": "源汇区"
                    },
                    {
                        "adcode": "411103",
                        "name": "郾城区"
                    },
                    {
                        "adcode": "411104",
                        "name": "召陵区"
                    },
                    {
                        "adcode": "411121",
                        "name": "舞阳县"
                    },
                    {
                        "adcode": "411122",
                        "name": "临颍县"
                    },
                    {
                        "adcode": "411140",
                        "name": "漯河经济技术开发区"
                    },
                    {
                        "adcode": "411101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "4101",
                "name": "郑州市",
                "s": [
                    {
                        "adcode": "410199",
                        "name": "郑州市市本级"
                    },
                    {
                        "adcode": "410102",
                        "name": "中原区"
                    },
                    {
                        "adcode": "410103",
                        "name": "二七区"
                    },
                    {
                        "adcode": "410104",
                        "name": "管城回族区"
                    },
                    {
                        "adcode": "410105",
                        "name": "金水区"
                    },
                    {
                        "adcode": "410106",
                        "name": "上街区"
                    },
                    {
                        "adcode": "410108",
                        "name": "惠济区"
                    },
                    {
                        "adcode": "410122",
                        "name": "中牟县"
                    },
                    {
                        "adcode": "410140",
                        "name": "郑州高新技术产业开发区"
                    },
                    {
                        "adcode": "410141",
                        "name": "郑州经济技术开发区"
                    },
                    {
                        "adcode": "410142",
                        "name": "郑东新区"
                    },
                    {
                        "adcode": "410143",
                        "name": "新郑综合保税区"
                    },
                    {
                        "adcode": "410181",
                        "name": "巩义市"
                    },
                    {
                        "adcode": "410182",
                        "name": "荥阳市"
                    },
                    {
                        "adcode": "410183",
                        "name": "新密市"
                    },
                    {
                        "adcode": "410184",
                        "name": "新郑市"
                    },
                    {
                        "adcode": "410185",
                        "name": "登封市"
                    },
                    {
                        "adcode": "410101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "410173",
                        "name": "郑州航空港经济综合实验区"
                    }
                ]
            },
            {
                "adcode": "4112",
                "name": "三门峡市",
                "s": [
                    {
                        "adcode": "411299",
                        "name": "三门峡市市本级"
                    },
                    {
                        "adcode": "411202",
                        "name": "湖滨区"
                    },
                    {
                        "adcode": "411221",
                        "name": "渑池县"
                    },
                    {
                        "adcode": "411222",
                        "name": "陕县"
                    },
                    {
                        "adcode": "411224",
                        "name": "卢氏县"
                    },
                    {
                        "adcode": "411281",
                        "name": "义马市"
                    },
                    {
                        "adcode": "411282",
                        "name": "灵宝市"
                    },
                    {
                        "adcode": "411240",
                        "name": "城乡一体化示范区"
                    },
                    {
                        "adcode": "411201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "411203",
                        "name": "陕州区"
                    },
                    {
                        "adcode": "411271",
                        "name": "河南三门峡经济开发区"
                    }
                ]
            },
            {
                "adcode": "4102",
                "name": "开封市",
                "s": [
                    {
                        "adcode": "410299",
                        "name": "开封市市本级"
                    },
                    {
                        "adcode": "410202",
                        "name": "龙亭区"
                    },
                    {
                        "adcode": "410203",
                        "name": "顺河回族区"
                    },
                    {
                        "adcode": "410204",
                        "name": "鼓楼区"
                    },
                    {
                        "adcode": "410205",
                        "name": "禹王台区"
                    },
                    {
                        "adcode": "410211",
                        "name": "金明区"
                    },
                    {
                        "adcode": "410221",
                        "name": "杞县"
                    },
                    {
                        "adcode": "410222",
                        "name": "通许县"
                    },
                    {
                        "adcode": "410223",
                        "name": "尉氏县"
                    },
                    {
                        "adcode": "410224",
                        "name": "开封县"
                    },
                    {
                        "adcode": "410225",
                        "name": "兰考县"
                    },
                    {
                        "adcode": "410201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "410212",
                        "name": "祥符区"
                    }
                ]
            },
            {
                "adcode": "4113",
                "name": "南阳市",
                "s": [
                    {
                        "adcode": "411399",
                        "name": "南阳市市本级"
                    },
                    {
                        "adcode": "411302",
                        "name": "宛城区"
                    },
                    {
                        "adcode": "411303",
                        "name": "卧龙区"
                    },
                    {
                        "adcode": "411321",
                        "name": "南召县"
                    },
                    {
                        "adcode": "411322",
                        "name": "方城县"
                    },
                    {
                        "adcode": "411323",
                        "name": "西峡县"
                    },
                    {
                        "adcode": "411324",
                        "name": "镇平县"
                    },
                    {
                        "adcode": "411325",
                        "name": "内乡县"
                    },
                    {
                        "adcode": "411326",
                        "name": "淅川县"
                    },
                    {
                        "adcode": "411327",
                        "name": "社旗县"
                    },
                    {
                        "adcode": "411328",
                        "name": "唐河县"
                    },
                    {
                        "adcode": "411329",
                        "name": "新野县"
                    },
                    {
                        "adcode": "411330",
                        "name": "桐柏县"
                    },
                    {
                        "adcode": "411381",
                        "name": "邓州市"
                    },
                    {
                        "adcode": "411301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "411372",
                        "name": "南阳市城乡一体化示范区"
                    },
                    {
                        "adcode": "411371",
                        "name": "南阳高新技术产业开发区"
                    },
                    {
                        "adcode": "411397",
                        "name": "城乡一体化示范区"
                    },
                    {
                        "adcode": "411398",
                        "name": "官庄工区"
                    }
                ]
            },
            {
                "adcode": "4190",
                "name": "省直辖县级行政区划",
                "s": [
                    {
                        "adcode": "419001",
                        "name": "济源市"
                    }
                ]
            },
            {
                "adcode": "4114",
                "name": "商丘市",
                "s": [
                    {
                        "adcode": "411498",
                        "name": "城乡一体化示范区"
                    },
                    {
                        "adcode": "411499",
                        "name": "商丘市市本级"
                    },
                    {
                        "adcode": "411402",
                        "name": "梁园区"
                    },
                    {
                        "adcode": "411403",
                        "name": "睢阳区"
                    },
                    {
                        "adcode": "411421",
                        "name": "民权县"
                    },
                    {
                        "adcode": "411422",
                        "name": "睢县"
                    },
                    {
                        "adcode": "411423",
                        "name": "宁陵县"
                    },
                    {
                        "adcode": "411424",
                        "name": "柘城县"
                    },
                    {
                        "adcode": "411425",
                        "name": "虞城县"
                    },
                    {
                        "adcode": "411426",
                        "name": "夏邑县"
                    },
                    {
                        "adcode": "411440",
                        "name": "开发区"
                    },
                    {
                        "adcode": "411441",
                        "name": "商丘新区"
                    },
                    {
                        "adcode": "411481",
                        "name": "永城市"
                    },
                    {
                        "adcode": "411401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "411472",
                        "name": "河南商丘经济开发区"
                    },
                    {
                        "adcode": "411471",
                        "name": "豫东综合物流产业聚集区"
                    }
                ]
            },
            {
                "adcode": "4103",
                "name": "洛阳市",
                "s": [
                    {
                        "adcode": "410399",
                        "name": "洛阳市市本级"
                    },
                    {
                        "adcode": "410302",
                        "name": "老城区"
                    },
                    {
                        "adcode": "410303",
                        "name": "西工区"
                    },
                    {
                        "adcode": "410304",
                        "name": "瀍河回族区"
                    },
                    {
                        "adcode": "410305",
                        "name": "涧西区"
                    },
                    {
                        "adcode": "410306",
                        "name": "吉利区"
                    },
                    {
                        "adcode": "410311",
                        "name": "洛龙区"
                    },
                    {
                        "adcode": "410322",
                        "name": "孟津县"
                    },
                    {
                        "adcode": "410323",
                        "name": "新安县"
                    },
                    {
                        "adcode": "410324",
                        "name": "栾川县"
                    },
                    {
                        "adcode": "410325",
                        "name": "嵩县"
                    },
                    {
                        "adcode": "410326",
                        "name": "汝阳县"
                    },
                    {
                        "adcode": "410327",
                        "name": "宜阳县"
                    },
                    {
                        "adcode": "410328",
                        "name": "洛宁县"
                    },
                    {
                        "adcode": "410329",
                        "name": "伊川县"
                    },
                    {
                        "adcode": "410340",
                        "name": "洛阳高新技术开发区"
                    },
                    {
                        "adcode": "410341",
                        "name": "洛阳伊洛产业集聚区"
                    },
                    {
                        "adcode": "410381",
                        "name": "偃师市"
                    },
                    {
                        "adcode": "410301",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "410371",
                        "name": "洛阳高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "4104",
                "name": "平顶山市",
                "s": [
                    {
                        "adcode": "410499",
                        "name": "平顶山市市本级"
                    },
                    {
                        "adcode": "410402",
                        "name": "新华区"
                    },
                    {
                        "adcode": "410403",
                        "name": "卫东区"
                    },
                    {
                        "adcode": "410404",
                        "name": "石龙区"
                    },
                    {
                        "adcode": "410411",
                        "name": "湛河区"
                    },
                    {
                        "adcode": "410421",
                        "name": "宝丰县"
                    },
                    {
                        "adcode": "410422",
                        "name": "叶县"
                    },
                    {
                        "adcode": "410423",
                        "name": "鲁山县"
                    },
                    {
                        "adcode": "410425",
                        "name": "郏县"
                    },
                    {
                        "adcode": "410440",
                        "name": "新城区"
                    },
                    {
                        "adcode": "410441",
                        "name": "平顶山高新技术产业开发区"
                    },
                    {
                        "adcode": "410481",
                        "name": "舞钢市"
                    },
                    {
                        "adcode": "410482",
                        "name": "汝州市"
                    },
                    {
                        "adcode": "410401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "410472",
                        "name": "平顶山市新城区"
                    }
                ]
            },
            {
                "adcode": "4115",
                "name": "信阳市",
                "s": [
                    {
                        "adcode": "411599",
                        "name": "信阳市市本级"
                    },
                    {
                        "adcode": "411502",
                        "name": "浉河区"
                    },
                    {
                        "adcode": "411503",
                        "name": "平桥区"
                    },
                    {
                        "adcode": "411521",
                        "name": "罗山县"
                    },
                    {
                        "adcode": "411522",
                        "name": "光山县"
                    },
                    {
                        "adcode": "411523",
                        "name": "新县"
                    },
                    {
                        "adcode": "411524",
                        "name": "商城县"
                    },
                    {
                        "adcode": "411525",
                        "name": "固始县"
                    },
                    {
                        "adcode": "411526",
                        "name": "潢川县"
                    },
                    {
                        "adcode": "411527",
                        "name": "淮滨县"
                    },
                    {
                        "adcode": "411528",
                        "name": "息县"
                    },
                    {
                        "adcode": "411540",
                        "name": "南湖湾风景区"
                    },
                    {
                        "adcode": "411541",
                        "name": "鸡公山管理区"
                    },
                    {
                        "adcode": "411542",
                        "name": "上天梯非金属矿管理区"
                    },
                    {
                        "adcode": "411543",
                        "name": "工业城"
                    },
                    {
                        "adcode": "411544",
                        "name": "羊山新区"
                    },
                    {
                        "adcode": "411545",
                        "name": "潢川经济技术开发区"
                    },
                    {
                        "adcode": "411501",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "411571",
                        "name": "信阳高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "4105",
                "name": "安阳市",
                "s": [
                    {
                        "adcode": "410599",
                        "name": "安阳市市本级"
                    },
                    {
                        "adcode": "410502",
                        "name": "文峰区"
                    },
                    {
                        "adcode": "410503",
                        "name": "北关区"
                    },
                    {
                        "adcode": "410505",
                        "name": "殷都区"
                    },
                    {
                        "adcode": "410506",
                        "name": "龙安区"
                    },
                    {
                        "adcode": "410522",
                        "name": "安阳县"
                    },
                    {
                        "adcode": "410523",
                        "name": "汤阴县"
                    },
                    {
                        "adcode": "410526",
                        "name": "滑县"
                    },
                    {
                        "adcode": "410527",
                        "name": "内黄县"
                    },
                    {
                        "adcode": "410540",
                        "name": "开发区"
                    },
                    {
                        "adcode": "410541",
                        "name": "安阳新区"
                    },
                    {
                        "adcode": "410581",
                        "name": "林州市"
                    },
                    {
                        "adcode": "410501",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "410571",
                        "name": "安阳高新技术产业开发区"
                    }
                ]
            },
            {
                "adcode": "4116",
                "name": "周口市",
                "s": [
                    {
                        "adcode": "411699",
                        "name": "周口市市本级"
                    },
                    {
                        "adcode": "411602",
                        "name": "川汇区"
                    },
                    {
                        "adcode": "411621",
                        "name": "扶沟县"
                    },
                    {
                        "adcode": "411622",
                        "name": "西华县"
                    },
                    {
                        "adcode": "411623",
                        "name": "商水县"
                    },
                    {
                        "adcode": "411624",
                        "name": "沈丘县"
                    },
                    {
                        "adcode": "411625",
                        "name": "郸城县"
                    },
                    {
                        "adcode": "411626",
                        "name": "淮阳县"
                    },
                    {
                        "adcode": "411627",
                        "name": "太康县"
                    },
                    {
                        "adcode": "411628",
                        "name": "鹿邑县"
                    },
                    {
                        "adcode": "411640",
                        "name": "黄泛区"
                    },
                    {
                        "adcode": "411641",
                        "name": "东新区"
                    },
                    {
                        "adcode": "411642",
                        "name": "经济技术开发区"
                    },
                    {
                        "adcode": "411643",
                        "name": "周口港口物流产业集聚区"
                    },
                    {
                        "adcode": "411681",
                        "name": "项城市"
                    },
                    {
                        "adcode": "411601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "411671",
                        "name": "河南周口经济开发区"
                    }
                ]
            },
            {
                "adcode": "4106",
                "name": "鹤壁市",
                "s": [
                    {
                        "adcode": "410699",
                        "name": "鹤壁市市本级"
                    },
                    {
                        "adcode": "410602",
                        "name": "鹤山区"
                    },
                    {
                        "adcode": "410603",
                        "name": "山城区"
                    },
                    {
                        "adcode": "410611",
                        "name": "淇滨区"
                    },
                    {
                        "adcode": "410621",
                        "name": "浚县"
                    },
                    {
                        "adcode": "410622",
                        "name": "淇县"
                    },
                    {
                        "adcode": "410640",
                        "name": "开发区"
                    },
                    {
                        "adcode": "410641",
                        "name": "城乡一体化示范区"
                    },
                    {
                        "adcode": "410601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "410671",
                        "name": "鹤壁经济技术开发区"
                    }
                ]
            },
            {
                "adcode": "4117",
                "name": "驻马店市",
                "s": [
                    {
                        "adcode": "411799",
                        "name": "驻马店市市本级"
                    },
                    {
                        "adcode": "411702",
                        "name": "驿城区"
                    },
                    {
                        "adcode": "411721",
                        "name": "西平县"
                    },
                    {
                        "adcode": "411722",
                        "name": "上蔡县"
                    },
                    {
                        "adcode": "411723",
                        "name": "平舆县"
                    },
                    {
                        "adcode": "411724",
                        "name": "正阳县"
                    },
                    {
                        "adcode": "411725",
                        "name": "确山县"
                    },
                    {
                        "adcode": "411726",
                        "name": "泌阳县"
                    },
                    {
                        "adcode": "411727",
                        "name": "汝南县"
                    },
                    {
                        "adcode": "411728",
                        "name": "遂平县"
                    },
                    {
                        "adcode": "411729",
                        "name": "新蔡县"
                    },
                    {
                        "adcode": "411740",
                        "name": "高新区"
                    },
                    {
                        "adcode": "411701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "411771",
                        "name": "河南驻马店经济开发区"
                    }
                ]
            },
            {
                "adcode": "4107",
                "name": "新乡市",
                "s": [
                    {
                        "adcode": "410799",
                        "name": "新乡市市本级"
                    },
                    {
                        "adcode": "410702",
                        "name": "红旗区"
                    },
                    {
                        "adcode": "410703",
                        "name": "卫滨区"
                    },
                    {
                        "adcode": "410704",
                        "name": "凤泉区"
                    },
                    {
                        "adcode": "410711",
                        "name": "牧野区"
                    },
                    {
                        "adcode": "410721",
                        "name": "新乡县"
                    },
                    {
                        "adcode": "410724",
                        "name": "获嘉县"
                    },
                    {
                        "adcode": "410725",
                        "name": "原阳县"
                    },
                    {
                        "adcode": "410726",
                        "name": "延津县"
                    },
                    {
                        "adcode": "410727",
                        "name": "封丘县"
                    },
                    {
                        "adcode": "410728",
                        "name": "长垣县"
                    },
                    {
                        "adcode": "410740",
                        "name": "开发区"
                    },
                    {
                        "adcode": "410741",
                        "name": "平原新区"
                    },
                    {
                        "adcode": "410742",
                        "name": "高新技术产业开发区"
                    },
                    {
                        "adcode": "410743",
                        "name": "经济技术开发区"
                    },
                    {
                        "adcode": "410781",
                        "name": "卫辉市"
                    },
                    {
                        "adcode": "410782",
                        "name": "辉县市"
                    },
                    {
                        "adcode": "410701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "410771",
                        "name": "新乡高新技术产业开发区"
                    },
                    {
                        "adcode": "410772",
                        "name": "新乡经济技术开发区"
                    },
                    {
                        "adcode": "410773",
                        "name": "新乡市平原城乡一体化示范区"
                    }
                ]
            },
            {
                "adcode": "4118",
                "name": "济源市",
                "s": [
                    {
                        "adcode": "411899",
                        "name": "济源市市本级"
                    }
                ]
            },
            {
                "adcode": "4108",
                "name": "焦作市",
                "s": [
                    {
                        "adcode": "410899",
                        "name": "焦作市市本级"
                    },
                    {
                        "adcode": "410802",
                        "name": "解放区"
                    },
                    {
                        "adcode": "410803",
                        "name": "中站区"
                    },
                    {
                        "adcode": "410804",
                        "name": "马村区"
                    },
                    {
                        "adcode": "410811",
                        "name": "山阳区"
                    },
                    {
                        "adcode": "410821",
                        "name": "修武县"
                    },
                    {
                        "adcode": "410822",
                        "name": "博爱县"
                    },
                    {
                        "adcode": "410823",
                        "name": "武陟县"
                    },
                    {
                        "adcode": "410825",
                        "name": "温县"
                    },
                    {
                        "adcode": "410840",
                        "name": "高新区"
                    },
                    {
                        "adcode": "410881",
                        "name": "济源市"
                    },
                    {
                        "adcode": "410882",
                        "name": "沁阳市"
                    },
                    {
                        "adcode": "410883",
                        "name": "孟州市"
                    },
                    {
                        "adcode": "410801",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "410871",
                        "name": "焦作城乡一体化示范区"
                    }
                ]
            },
            {
                "adcode": "4109",
                "name": "濮阳市",
                "s": [
                    {
                        "adcode": "410999",
                        "name": "濮阳市市本级"
                    },
                    {
                        "adcode": "410902",
                        "name": "华龙区"
                    },
                    {
                        "adcode": "410922",
                        "name": "清丰县"
                    },
                    {
                        "adcode": "410923",
                        "name": "南乐县"
                    },
                    {
                        "adcode": "410926",
                        "name": "范县"
                    },
                    {
                        "adcode": "410927",
                        "name": "台前县"
                    },
                    {
                        "adcode": "410928",
                        "name": "濮阳县"
                    },
                    {
                        "adcode": "410940",
                        "name": "高新区"
                    },
                    {
                        "adcode": "410941",
                        "name": "濮阳城乡一体化示范区"
                    },
                    {
                        "adcode": "410901",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "410972",
                        "name": "濮阳经济技术开发区"
                    },
                    {
                        "adcode": "410971",
                        "name": "河南濮阳工业园区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "11",
        "name": "北京市",
        "s": [
            {
                "adcode": "110116",
                "name": "怀柔区",
                "s": [
                    {
                        "adcode": "110101283",
                        "name": "泉河街道"
                    },
                    {
                        "adcode": "110101274",
                        "name": "雁栖（地区）镇"
                    },
                    {
                        "adcode": "110101269",
                        "name": "杨宋镇"
                    },
                    {
                        "adcode": "110101281",
                        "name": "怀柔（地区）镇"
                    },
                    {
                        "adcode": "110101276",
                        "name": "琉璃庙镇"
                    },
                    {
                        "adcode": "110101271",
                        "name": "桥梓镇"
                    },
                    {
                        "adcode": "110101278",
                        "name": "汤河口镇"
                    },
                    {
                        "adcode": "110101270",
                        "name": "庙城（地区）镇"
                    },
                    {
                        "adcode": "110101273",
                        "name": "渤海镇"
                    },
                    {
                        "adcode": "110101279",
                        "name": "长哨营满族乡"
                    },
                    {
                        "adcode": "110101275",
                        "name": "怀北镇"
                    },
                    {
                        "adcode": "110101277",
                        "name": "宝山镇"
                    },
                    {
                        "adcode": "110101272",
                        "name": "九渡河镇"
                    },
                    {
                        "adcode": "110101280",
                        "name": "喇叭沟门满族乡"
                    },
                    {
                        "adcode": "110101282",
                        "name": "龙山街道"
                    },
                    {
                        "adcode": "110101268",
                        "name": "北房镇"
                    }
                ]
            },
            {
                "adcode": "110105",
                "name": "朝阳区",
                "s": [
                    {
                        "adcode": "110101067",
                        "name": "奥运村街道"
                    },
                    {
                        "adcode": "110101049",
                        "name": "香河园街道"
                    },
                    {
                        "adcode": "110101040",
                        "name": "左家庄街道"
                    },
                    {
                        "adcode": "110101070",
                        "name": "崔各庄（地区）乡"
                    },
                    {
                        "adcode": "110101034",
                        "name": "呼家楼街道"
                    },
                    {
                        "adcode": "110101048",
                        "name": "望京街道"
                    },
                    {
                        "adcode": "110101071",
                        "name": "黑庄户（地区）乡"
                    },
                    {
                        "adcode": "110101064",
                        "name": "金盏（地区）乡"
                    },
                    {
                        "adcode": "110101047",
                        "name": "安贞街道"
                    },
                    {
                        "adcode": "110101073",
                        "name": "三间房（地区）乡"
                    },
                    {
                        "adcode": "110101076",
                        "name": "东湖街道"
                    },
                    {
                        "adcode": "110101072",
                        "name": "豆各庄（地区）乡"
                    },
                    {
                        "adcode": "110101046",
                        "name": "团结湖街道"
                    },
                    {
                        "adcode": "110101044",
                        "name": "八里庄街道"
                    },
                    {
                        "adcode": "110101035",
                        "name": "朝外街道"
                    },
                    {
                        "adcode": "110101050",
                        "name": "潘家园街道"
                    },
                    {
                        "adcode": "110101061",
                        "name": "十八里店（地区）乡"
                    },
                    {
                        "adcode": "110101045",
                        "name": "首都机场街道"
                    },
                    {
                        "adcode": "110101051",
                        "name": "建外街道"
                    },
                    {
                        "adcode": "110101053",
                        "name": "亚运村街道"
                    },
                    {
                        "adcode": "110101066",
                        "name": "大屯街道"
                    },
                    {
                        "adcode": "110101052",
                        "name": "劲松街道"
                    },
                    {
                        "adcode": "110101041",
                        "name": "垡头街道"
                    },
                    {
                        "adcode": "110101037",
                        "name": "三里屯街道"
                    },
                    {
                        "adcode": "110101043",
                        "name": "酒仙桥街道"
                    },
                    {
                        "adcode": "110101042",
                        "name": "和平街街道"
                    },
                    {
                        "adcode": "110101068",
                        "name": "来广营（地区）乡"
                    },
                    {
                        "adcode": "110101055",
                        "name": "六里屯街道"
                    },
                    {
                        "adcode": "110101069",
                        "name": "将台（地区）乡"
                    },
                    {
                        "adcode": "110101039",
                        "name": "小关街道"
                    },
                    {
                        "adcode": "110101036",
                        "name": "双井街道"
                    },
                    {
                        "adcode": "110101058",
                        "name": "王四营（地区）乡"
                    },
                    {
                        "adcode": "110101056",
                        "name": "麦子店街道"
                    },
                    {
                        "adcode": "110101063",
                        "name": "东坝（地区）乡"
                    },
                    {
                        "adcode": "110101075",
                        "name": "孙河（地区）乡"
                    },
                    {
                        "adcode": "110101074",
                        "name": "常营乡"
                    },
                    {
                        "adcode": "110101059",
                        "name": "南磨房（地区）乡"
                    },
                    {
                        "adcode": "110101054",
                        "name": "东风（地区）乡"
                    },
                    {
                        "adcode": "110101038",
                        "name": "管庄（地区）乡"
                    },
                    {
                        "adcode": "110101065",
                        "name": "太阳宫（地区）乡"
                    },
                    {
                        "adcode": "110101060",
                        "name": "小红门（地区）乡"
                    },
                    {
                        "adcode": "110101057",
                        "name": "高碑店（地区）乡"
                    },
                    {
                        "adcode": "110101062",
                        "name": "平房（地区）乡"
                    }
                ]
            },
            {
                "adcode": "110117",
                "name": "平谷区",
                "s": [
                    {
                        "adcode": "110101289",
                        "name": "峪口（地区）镇"
                    },
                    {
                        "adcode": "110101292",
                        "name": "马昌营镇"
                    },
                    {
                        "adcode": "110101301",
                        "name": "滨河街道"
                    },
                    {
                        "adcode": "110101298",
                        "name": "镇罗营镇"
                    },
                    {
                        "adcode": "110101293",
                        "name": "南独乐河镇"
                    },
                    {
                        "adcode": "110101294",
                        "name": "金海湖（地区）镇"
                    },
                    {
                        "adcode": "110101296",
                        "name": "大华山镇"
                    },
                    {
                        "adcode": "110101297",
                        "name": "刘家店镇"
                    },
                    {
                        "adcode": "110101300",
                        "name": "兴谷街道"
                    },
                    {
                        "adcode": "110101291",
                        "name": "马坊（地区）镇"
                    },
                    {
                        "adcode": "110101299",
                        "name": "熊儿寨乡"
                    },
                    {
                        "adcode": "110101295",
                        "name": "黄松峪乡"
                    },
                    {
                        "adcode": "110101288",
                        "name": "夏各庄镇"
                    },
                    {
                        "adcode": "110101286",
                        "name": "王辛庄镇"
                    },
                    {
                        "adcode": "110101287",
                        "name": "山东庄镇"
                    },
                    {
                        "adcode": "110101284",
                        "name": "平谷（渔阳地区）镇"
                    },
                    {
                        "adcode": "110101290",
                        "name": "大兴庄镇"
                    },
                    {
                        "adcode": "110101285",
                        "name": "东高村镇"
                    }
                ]
            },
            {
                "adcode": "110106",
                "name": "丰台区",
                "s": [
                    {
                        "adcode": "110101085",
                        "name": "方庄（地区）街道"
                    },
                    {
                        "adcode": "110101095",
                        "name": "王佐镇"
                    },
                    {
                        "adcode": "110101082",
                        "name": "东铁匠营街道"
                    },
                    {
                        "adcode": "110101093",
                        "name": "花乡（地区）乡"
                    },
                    {
                        "adcode": "110101089",
                        "name": "右安门街道"
                    },
                    {
                        "adcode": "110101094",
                        "name": "长辛店镇"
                    },
                    {
                        "adcode": "110101081",
                        "name": "东高地街道"
                    },
                    {
                        "adcode": "110101080",
                        "name": "长辛店街道"
                    },
                    {
                        "adcode": "110101086",
                        "name": "太平桥街道"
                    },
                    {
                        "adcode": "110101090",
                        "name": "和义街道"
                    },
                    {
                        "adcode": "110101087",
                        "name": "大红门街道"
                    },
                    {
                        "adcode": "110101084",
                        "name": "云岗街道"
                    },
                    {
                        "adcode": "110101079",
                        "name": "南苑街道"
                    },
                    {
                        "adcode": "110101092",
                        "name": "宛平城（地区）街道"
                    },
                    {
                        "adcode": "110101083",
                        "name": "卢沟桥街道"
                    },
                    {
                        "adcode": "110101097",
                        "name": "卢沟桥（地区）乡"
                    },
                    {
                        "adcode": "110101096",
                        "name": "南苑（地区）乡"
                    },
                    {
                        "adcode": "110101077",
                        "name": "丰台街道"
                    },
                    {
                        "adcode": "110101091",
                        "name": "马家堡街道"
                    },
                    {
                        "adcode": "110101088",
                        "name": "西罗园街道"
                    },
                    {
                        "adcode": "110101078",
                        "name": "新村街道"
                    }
                ]
            },
            {
                "adcode": "110114",
                "name": "昌平区",
                "s": [
                    {
                        "adcode": "110101228",
                        "name": "马池口（地区）镇"
                    },
                    {
                        "adcode": "110101243",
                        "name": "霍营街道"
                    },
                    {
                        "adcode": "110101231",
                        "name": "流村镇"
                    },
                    {
                        "adcode": "110101236",
                        "name": "兴寿镇"
                    },
                    {
                        "adcode": "110101232",
                        "name": "阳坊镇"
                    },
                    {
                        "adcode": "110101241",
                        "name": "天通苑北街道"
                    },
                    {
                        "adcode": "110101230",
                        "name": "南口（地区）镇"
                    },
                    {
                        "adcode": "110101229",
                        "name": "南邵镇"
                    },
                    {
                        "adcode": "110101244",
                        "name": "龙泽园街道"
                    },
                    {
                        "adcode": "110101225",
                        "name": "城南街道"
                    },
                    {
                        "adcode": "110101237",
                        "name": "百善镇"
                    },
                    {
                        "adcode": "110101238",
                        "name": "北七家镇"
                    },
                    {
                        "adcode": "110101234",
                        "name": "小汤山镇"
                    },
                    {
                        "adcode": "110101235",
                        "name": "崔村镇"
                    },
                    {
                        "adcode": "110101242",
                        "name": "天通苑南街道"
                    },
                    {
                        "adcode": "110101233",
                        "name": "沙河（地区）镇"
                    },
                    {
                        "adcode": "110101239",
                        "name": "回龙观镇"
                    },
                    {
                        "adcode": "110101226",
                        "name": "十三陵镇"
                    },
                    {
                        "adcode": "110101227",
                        "name": "延寿镇"
                    },
                    {
                        "adcode": "110101224",
                        "name": "城北街道"
                    },
                    {
                        "adcode": "110101245",
                        "name": "史各庄街道"
                    },
                    {
                        "adcode": "110101240",
                        "name": "东小口（地区）镇"
                    }
                ]
            },
            {
                "adcode": "110115",
                "name": "大兴区",
                "s": [
                    {
                        "adcode": "110101265",
                        "name": "高米店街道"
                    },
                    {
                        "adcode": "110101246",
                        "name": "黄村（地区）镇"
                    },
                    {
                        "adcode": "110101267",
                        "name": "荣华街道"
                    },
                    {
                        "adcode": "110101258",
                        "name": "亦庄（地区）镇"
                    },
                    {
                        "adcode": "110101252",
                        "name": "青云店镇"
                    },
                    {
                        "adcode": "110101262",
                        "name": "林校路街道"
                    },
                    {
                        "adcode": "110101259",
                        "name": "西红门（地区）镇"
                    },
                    {
                        "adcode": "110101257",
                        "name": "旧宫（地区）镇"
                    },
                    {
                        "adcode": "110101266",
                        "name": "博兴街道"
                    },
                    {
                        "adcode": "110101263",
                        "name": "观音寺街道"
                    },
                    {
                        "adcode": "110101253",
                        "name": "采育镇"
                    },
                    {
                        "adcode": "110101249",
                        "name": "榆垡镇"
                    },
                    {
                        "adcode": "110101264",
                        "name": "天宫院街道"
                    },
                    {
                        "adcode": "110101260",
                        "name": "清源街道"
                    },
                    {
                        "adcode": "110101247",
                        "name": "北臧村镇"
                    },
                    {
                        "adcode": "110101250",
                        "name": "礼贤镇"
                    },
                    {
                        "adcode": "110101255",
                        "name": "魏善庄镇"
                    },
                    {
                        "adcode": "110101261",
                        "name": "兴丰街道"
                    },
                    {
                        "adcode": "110101256",
                        "name": "瀛海（地区）镇"
                    },
                    {
                        "adcode": "110101248",
                        "name": "庞各庄镇"
                    },
                    {
                        "adcode": "110101254",
                        "name": "长子营镇"
                    },
                    {
                        "adcode": "110101251",
                        "name": "安定镇"
                    }
                ]
            },
            {
                "adcode": "110101",
                "name": "东城区",
                "s": [
                    {
                        "adcode": "110101001",
                        "name": "东华门街道"
                    },
                    {
                        "adcode": "110101012",
                        "name": "前门街道"
                    },
                    {
                        "adcode": "110101009",
                        "name": "建国门街道"
                    },
                    {
                        "adcode": "110101016",
                        "name": "体育馆路街道"
                    },
                    {
                        "adcode": "110101008",
                        "name": "朝阳门街道"
                    },
                    {
                        "adcode": "110101011",
                        "name": "天坛街道"
                    },
                    {
                        "adcode": "110101006",
                        "name": "北新桥街道"
                    },
                    {
                        "adcode": "110101007",
                        "name": "东四街道"
                    },
                    {
                        "adcode": "110101014",
                        "name": "东花市街道"
                    },
                    {
                        "adcode": "110101013",
                        "name": "崇文门外街道"
                    },
                    {
                        "adcode": "110101005",
                        "name": "和平里街道"
                    },
                    {
                        "adcode": "110101010",
                        "name": "东直门街道"
                    },
                    {
                        "adcode": "110101015",
                        "name": "龙潭街道"
                    },
                    {
                        "adcode": "110101002",
                        "name": "景山街道"
                    },
                    {
                        "adcode": "110101003",
                        "name": "交通口街道"
                    },
                    {
                        "adcode": "110101004",
                        "name": "安定门街道"
                    },
                    {
                        "adcode": "110101017",
                        "name": "永定门外街道"
                    }
                ]
            },
            {
                "adcode": "110112",
                "name": "通州区",
                "s": [
                    {
                        "adcode": "110101196",
                        "name": "北苑街道"
                    },
                    {
                        "adcode": "110101182",
                        "name": "西集镇"
                    },
                    {
                        "adcode": "110101198",
                        "name": "玉桥街道"
                    },
                    {
                        "adcode": "110101179",
                        "name": "宋庄镇（徐辛庄）"
                    },
                    {
                        "adcode": "110101180",
                        "name": "潞城镇"
                    },
                    {
                        "adcode": "110101193",
                        "name": "张家湾镇"
                    },
                    {
                        "adcode": "110101194",
                        "name": "梨园（地区）镇"
                    },
                    {
                        "adcode": "110101184",
                        "name": "潞城镇（甘棠）"
                    },
                    {
                        "adcode": "110101185",
                        "name": "漷县镇"
                    },
                    {
                        "adcode": "110101178",
                        "name": "永顺（地区）镇"
                    },
                    {
                        "adcode": "110101183",
                        "name": "西集镇（郎府）"
                    },
                    {
                        "adcode": "110101181",
                        "name": "宋庄镇"
                    },
                    {
                        "adcode": "110101191",
                        "name": "台湖镇（次渠）"
                    },
                    {
                        "adcode": "110101195",
                        "name": "于家务回族乡"
                    },
                    {
                        "adcode": "110101189",
                        "name": "马驹桥镇（大杜社）"
                    },
                    {
                        "adcode": "110101190",
                        "name": "马驹桥镇"
                    },
                    {
                        "adcode": "110101188",
                        "name": "张家湾镇（牛堡屯）"
                    },
                    {
                        "adcode": "110101186",
                        "name": "漷县镇（觅子店）"
                    },
                    {
                        "adcode": "110101192",
                        "name": "台湖镇"
                    },
                    {
                        "adcode": "110101177",
                        "name": "新华街道"
                    },
                    {
                        "adcode": "110101197",
                        "name": "中仓街道"
                    },
                    {
                        "adcode": "110101187",
                        "name": "永乐店镇"
                    }
                ]
            },
            {
                "adcode": "110102",
                "name": "西城区",
                "s": [
                    {
                        "adcode": "110101033",
                        "name": "滨河街道"
                    },
                    {
                        "adcode": "110101021",
                        "name": "金融街街道"
                    },
                    {
                        "adcode": "110101019",
                        "name": "展览路街道"
                    },
                    {
                        "adcode": "110101020",
                        "name": "月坛街道"
                    },
                    {
                        "adcode": "110101028",
                        "name": "广安门外街道"
                    },
                    {
                        "adcode": "110101029",
                        "name": "白纸坊街道"
                    },
                    {
                        "adcode": "110101031",
                        "name": "陶然亭街道"
                    },
                    {
                        "adcode": "110101025",
                        "name": "大栅栏街道"
                    },
                    {
                        "adcode": "110101023",
                        "name": "什刹海街道"
                    },
                    {
                        "adcode": "110101026",
                        "name": "椿树街道"
                    },
                    {
                        "adcode": "110101032",
                        "name": "天桥街道"
                    },
                    {
                        "adcode": "110101027",
                        "name": "广安门内街道"
                    },
                    {
                        "adcode": "110101024",
                        "name": "新街口街道"
                    },
                    {
                        "adcode": "110101018",
                        "name": "德胜街道"
                    },
                    {
                        "adcode": "110101022",
                        "name": "西长安街街道"
                    },
                    {
                        "adcode": "110101030",
                        "name": "牛街街道"
                    }
                ]
            },
            {
                "adcode": "110113",
                "name": "顺义区",
                "s": [
                    {
                        "adcode": "110101218",
                        "name": "胜利街道"
                    },
                    {
                        "adcode": "110101213",
                        "name": "北石槽镇"
                    },
                    {
                        "adcode": "110101221",
                        "name": "旺泉街道"
                    },
                    {
                        "adcode": "110101211",
                        "name": "北小营镇"
                    },
                    {
                        "adcode": "110101215",
                        "name": "后沙峪（地区）镇"
                    },
                    {
                        "adcode": "110101202",
                        "name": "天竺（地区）镇"
                    },
                    {
                        "adcode": "110101205",
                        "name": "北务镇"
                    },
                    {
                        "adcode": "110101214",
                        "name": "高丽营镇"
                    },
                    {
                        "adcode": "110101210",
                        "name": "龙湾屯镇"
                    },
                    {
                        "adcode": "110101222",
                        "name": "双丰街道"
                    },
                    {
                        "adcode": "110101203",
                        "name": "李桥镇"
                    },
                    {
                        "adcode": "110101199",
                        "name": "仁和（地区）镇"
                    },
                    {
                        "adcode": "110101220",
                        "name": "石园街道"
                    },
                    {
                        "adcode": "110101206",
                        "name": "木林镇"
                    },
                    {
                        "adcode": "110101208",
                        "name": "杨镇（地区）镇"
                    },
                    {
                        "adcode": "110101200",
                        "name": "马坡（地区）镇"
                    },
                    {
                        "adcode": "110101209",
                        "name": "张镇"
                    },
                    {
                        "adcode": "110101223",
                        "name": "空港街道"
                    },
                    {
                        "adcode": "110101217",
                        "name": "大孙各庄镇"
                    },
                    {
                        "adcode": "110101212",
                        "name": "赵全营镇"
                    },
                    {
                        "adcode": "110101207",
                        "name": "南彩镇"
                    },
                    {
                        "adcode": "110101204",
                        "name": "李遂镇"
                    },
                    {
                        "adcode": "110101216",
                        "name": "南法信（地区）镇"
                    },
                    {
                        "adcode": "110101219",
                        "name": "光明街道"
                    },
                    {
                        "adcode": "110101201",
                        "name": "牛栏山（地区）镇"
                    }
                ]
            },
            {
                "adcode": "110111",
                "name": "房山区",
                "s": [
                    {
                        "adcode": "110101166",
                        "name": "大安山乡"
                    },
                    {
                        "adcode": "110101174",
                        "name": "迎风街道"
                    },
                    {
                        "adcode": "110101156",
                        "name": "琉璃河（地区）镇"
                    },
                    {
                        "adcode": "110101153",
                        "name": "长阳镇"
                    },
                    {
                        "adcode": "110101169",
                        "name": "河北镇"
                    },
                    {
                        "adcode": "110101149",
                        "name": "城关街道"
                    },
                    {
                        "adcode": "110101167",
                        "name": "佛子庄乡"
                    },
                    {
                        "adcode": "110101164",
                        "name": "霞云岭乡"
                    },
                    {
                        "adcode": "110101158",
                        "name": "长沟镇"
                    },
                    {
                        "adcode": "110101161",
                        "name": "张坊镇"
                    },
                    {
                        "adcode": "110101159",
                        "name": "韩村河镇"
                    },
                    {
                        "adcode": "110101171",
                        "name": "东风街道"
                    },
                    {
                        "adcode": "110101152",
                        "name": "良乡（地区）镇"
                    },
                    {
                        "adcode": "110101170",
                        "name": "新镇街道"
                    },
                    {
                        "adcode": "110101155",
                        "name": "阎村镇"
                    },
                    {
                        "adcode": "110101168",
                        "name": "南窖乡"
                    },
                    {
                        "adcode": "110101150",
                        "name": "周口店（地区）镇"
                    },
                    {
                        "adcode": "110101160",
                        "name": "大石窝镇"
                    },
                    {
                        "adcode": "110101157",
                        "name": "窦店镇"
                    },
                    {
                        "adcode": "110101172",
                        "name": "拱辰街道"
                    },
                    {
                        "adcode": "110101154",
                        "name": "青龙湖镇"
                    },
                    {
                        "adcode": "110101175",
                        "name": "向阳街道"
                    },
                    {
                        "adcode": "110101165",
                        "name": "史家营乡"
                    },
                    {
                        "adcode": "110101163",
                        "name": "蒲洼乡"
                    },
                    {
                        "adcode": "110101151",
                        "name": "石楼镇"
                    },
                    {
                        "adcode": "110101176",
                        "name": "星城街道"
                    },
                    {
                        "adcode": "110101173",
                        "name": "西潞街道"
                    },
                    {
                        "adcode": "110101162",
                        "name": "十渡镇"
                    }
                ]
            },
            {
                "adcode": "110109",
                "name": "门头沟区",
                "s": [
                    {
                        "adcode": "110101147",
                        "name": "东辛房街道"
                    },
                    {
                        "adcode": "110101146",
                        "name": "城子街道"
                    },
                    {
                        "adcode": "110101138",
                        "name": "军庄镇"
                    },
                    {
                        "adcode": "110101137",
                        "name": "永定（地区）镇"
                    },
                    {
                        "adcode": "110101141",
                        "name": "雁翅镇"
                    },
                    {
                        "adcode": "110101142",
                        "name": "王平（地区）镇"
                    },
                    {
                        "adcode": "110101139",
                        "name": "谭柘寺镇"
                    },
                    {
                        "adcode": "110101143",
                        "name": "斋堂镇"
                    },
                    {
                        "adcode": "110101136",
                        "name": "龙泉（地区）镇"
                    },
                    {
                        "adcode": "110101145",
                        "name": "大峪街道"
                    },
                    {
                        "adcode": "110101148",
                        "name": "大台街道"
                    },
                    {
                        "adcode": "110101144",
                        "name": "清水镇"
                    },
                    {
                        "adcode": "110101140",
                        "name": "妙峰山镇"
                    }
                ]
            },
            {
                "adcode": "110118",
                "name": "密云区",
                "s": [
                    {
                        "adcode": "110101321",
                        "name": "果园街道"
                    },
                    {
                        "adcode": "110101319",
                        "name": "檀营（地区）满族蒙族乡"
                    },
                    {
                        "adcode": "110101318",
                        "name": "溪翁庄镇"
                    },
                    {
                        "adcode": "110101309",
                        "name": "穆家峪镇"
                    },
                    {
                        "adcode": "110101302",
                        "name": "密云镇"
                    },
                    {
                        "adcode": "110101304",
                        "name": "十里堡镇"
                    },
                    {
                        "adcode": "110101315",
                        "name": "不老屯镇"
                    },
                    {
                        "adcode": "110101314",
                        "name": "高岭镇"
                    },
                    {
                        "adcode": "110101305",
                        "name": "河南寨镇"
                    },
                    {
                        "adcode": "110101311",
                        "name": "北庄镇"
                    },
                    {
                        "adcode": "110101317",
                        "name": "石城镇"
                    },
                    {
                        "adcode": "110101313",
                        "name": "古北口镇"
                    },
                    {
                        "adcode": "110101310",
                        "name": "太师屯镇"
                    },
                    {
                        "adcode": "110101303",
                        "name": "西田各庄镇"
                    },
                    {
                        "adcode": "110101308",
                        "name": "巨各庄镇"
                    },
                    {
                        "adcode": "110101320",
                        "name": "鼓楼街道"
                    },
                    {
                        "adcode": "110101306",
                        "name": "东邵渠镇"
                    },
                    {
                        "adcode": "110101307",
                        "name": "大城子镇"
                    },
                    {
                        "adcode": "110101316",
                        "name": "冯家峪镇"
                    },
                    {
                        "adcode": "110101312",
                        "name": "新城子镇"
                    }
                ]
            },
            {
                "adcode": "110107",
                "name": "石景山区",
                "s": [
                    {
                        "adcode": "110101105",
                        "name": "五里坨街道"
                    },
                    {
                        "adcode": "110101099",
                        "name": "金顶街街道"
                    },
                    {
                        "adcode": "110101104",
                        "name": "老山街道"
                    },
                    {
                        "adcode": "110101101",
                        "name": "吉城街道"
                    },
                    {
                        "adcode": "110101100",
                        "name": "苹果园街道"
                    },
                    {
                        "adcode": "110101103",
                        "name": "广宇街道"
                    },
                    {
                        "adcode": "110101098",
                        "name": "八宝山街道"
                    },
                    {
                        "adcode": "110101106",
                        "name": "鲁谷街道"
                    },
                    {
                        "adcode": "110101102",
                        "name": "八角街道"
                    }
                ]
            },
            {
                "adcode": "110119",
                "name": "延庆区",
                "s": [
                    {
                        "adcode": "110101334",
                        "name": "四海镇"
                    },
                    {
                        "adcode": "110101329",
                        "name": "井庄镇"
                    },
                    {
                        "adcode": "110101330",
                        "name": "大榆树镇"
                    },
                    {
                        "adcode": "110101331",
                        "name": "永宁镇"
                    },
                    {
                        "adcode": "110101323",
                        "name": "康庄镇"
                    },
                    {
                        "adcode": "110101336",
                        "name": "千家店镇"
                    },
                    {
                        "adcode": "110101328",
                        "name": "香营乡"
                    },
                    {
                        "adcode": "110101332",
                        "name": "大庄科乡"
                    },
                    {
                        "adcode": "110101327",
                        "name": "旧县镇"
                    },
                    {
                        "adcode": "110101325",
                        "name": "张山营镇"
                    },
                    {
                        "adcode": "110101322",
                        "name": "延庆镇"
                    },
                    {
                        "adcode": "110101335",
                        "name": "珍珠泉乡"
                    },
                    {
                        "adcode": "110101326",
                        "name": "沈家营镇"
                    },
                    {
                        "adcode": "110101324",
                        "name": "八达岭镇"
                    },
                    {
                        "adcode": "110101333",
                        "name": "刘斌堡乡"
                    }
                ]
            },
            {
                "adcode": "110108",
                "name": "海淀区",
                "s": [
                    {
                        "adcode": "110101110",
                        "name": "永定路街道"
                    },
                    {
                        "adcode": "110101122",
                        "name": "学院路街道"
                    },
                    {
                        "adcode": "110101131",
                        "name": "马连洼街道"
                    },
                    {
                        "adcode": "110101114",
                        "name": "青龙桥街道"
                    },
                    {
                        "adcode": "110101135",
                        "name": "上庄（地区）镇"
                    },
                    {
                        "adcode": "110101115",
                        "name": "海淀街道"
                    },
                    {
                        "adcode": "110101109",
                        "name": "万寿路街道"
                    },
                    {
                        "adcode": "110101125",
                        "name": "清河街道"
                    },
                    {
                        "adcode": "110101133",
                        "name": "苏家坨（地区）镇"
                    },
                    {
                        "adcode": "110101113",
                        "name": "海淀（万柳地区）镇"
                    },
                    {
                        "adcode": "110101124",
                        "name": "花园路街道"
                    },
                    {
                        "adcode": "110101129",
                        "name": "香山街道"
                    },
                    {
                        "adcode": "110101130",
                        "name": "西北旺（地区）镇"
                    },
                    {
                        "adcode": "110101111",
                        "name": "八里庄街道"
                    },
                    {
                        "adcode": "110101116",
                        "name": "燕园街道"
                    },
                    {
                        "adcode": "110101132",
                        "name": "上地街道"
                    },
                    {
                        "adcode": "110101127",
                        "name": "清华园街道"
                    },
                    {
                        "adcode": "110101108",
                        "name": "甘家口街道"
                    },
                    {
                        "adcode": "110101120",
                        "name": "北下关街道"
                    },
                    {
                        "adcode": "110101107",
                        "name": "羊坊店街道"
                    },
                    {
                        "adcode": "110101119",
                        "name": "北太平庄街道"
                    },
                    {
                        "adcode": "110101123",
                        "name": "曙光街道"
                    },
                    {
                        "adcode": "110101134",
                        "name": "温泉（地区）镇"
                    },
                    {
                        "adcode": "110101121",
                        "name": "中关村街道"
                    },
                    {
                        "adcode": "110101112",
                        "name": "田村路街道"
                    },
                    {
                        "adcode": "110101117",
                        "name": "紫竹院街道"
                    },
                    {
                        "adcode": "110101128",
                        "name": "四季青（地区）镇"
                    },
                    {
                        "adcode": "110101118",
                        "name": "东升（地区）镇"
                    },
                    {
                        "adcode": "110101126",
                        "name": "西三旗街道"
                    }
                ]
            },
            {
                "adcode": "1101",
                "name": "密云区",
                "s": [
                    {
                        "adcode": "110118",
                        "name": "密云区"
                    },
                    {
                        "adcode": "110101",
                        "name": "东城区"
                    },
                    {
                        "adcode": "110102",
                        "name": "西城区"
                    },
                    {
                        "adcode": "110103",
                        "name": "崇文区"
                    },
                    {
                        "adcode": "110104",
                        "name": "宣武区"
                    },
                    {
                        "adcode": "110105",
                        "name": "朝阳区"
                    },
                    {
                        "adcode": "110106",
                        "name": "丰台区"
                    },
                    {
                        "adcode": "110107",
                        "name": "石景山区"
                    },
                    {
                        "adcode": "110108",
                        "name": "海淀区"
                    },
                    {
                        "adcode": "110109",
                        "name": "门头沟区"
                    },
                    {
                        "adcode": "110111",
                        "name": "房山区"
                    },
                    {
                        "adcode": "110112",
                        "name": "通州区"
                    },
                    {
                        "adcode": "110113",
                        "name": "顺义区"
                    },
                    {
                        "adcode": "110114",
                        "name": "昌平区"
                    },
                    {
                        "adcode": "110115",
                        "name": "大兴区"
                    },
                    {
                        "adcode": "110116",
                        "name": "怀柔区"
                    },
                    {
                        "adcode": "110117",
                        "name": "平谷区"
                    },
                    {
                        "adcode": "110140",
                        "name": "经济技术开发区"
                    },
                    {
                        "adcode": "110119",
                        "name": "延庆区"
                    }
                ]
            },
            {
                "adcode": "1199",
                "name": "北京市市本级",
                "s": []
            }
        ]
    },
    {
        "adcode": "91",
        "name": "中国港澳台",
        "s": [
            {
                "adcode": "9102",
                "name": "澳门",
                "s": [
                    {
                        "adcode": "910201",
                        "name": "澳门"
                    }
                ]
            },
            {
                "adcode": "9103",
                "name": "台湾",
                "s": [
                    {
                        "adcode": "910301",
                        "name": "台湾"
                    }
                ]
            },
            {
                "adcode": "9101",
                "name": "香港",
                "s": [
                    {
                        "adcode": "910100",
                        "name": "香港"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "12",
        "name": "天津市",
        "s": [
            {
                "adcode": "120102",
                "name": "河东区",
                "s": [
                    {
                        "adcode": "120102",
                        "name": "河东区"
                    },
                    {
                        "adcode": "120102001000",
                        "name": "大王庄街道"
                    },
                    {
                        "adcode": "120102002000",
                        "name": "大直沽街道"
                    },
                    {
                        "adcode": "120102003000",
                        "name": "中山门街道"
                    },
                    {
                        "adcode": "120102004000",
                        "name": "富民路街道"
                    },
                    {
                        "adcode": "120102005000",
                        "name": "二号桥街道"
                    },
                    {
                        "adcode": "120102006000",
                        "name": "春华街道"
                    },
                    {
                        "adcode": "120102007000",
                        "name": "唐家口街道"
                    },
                    {
                        "adcode": "120102008000",
                        "name": "向阳楼街道"
                    },
                    {
                        "adcode": "120102009000",
                        "name": "常州道街道"
                    },
                    {
                        "adcode": "120102010000",
                        "name": "上杭路街道"
                    },
                    {
                        "adcode": "120102011000",
                        "name": "东新街道"
                    },
                    {
                        "adcode": "120102012000",
                        "name": "鲁山道街道"
                    },
                    {
                        "adcode": "120102013000",
                        "name": "天津铁厂街道"
                    }
                ]
            },
            {
                "adcode": "120113",
                "name": "北辰区",
                "s": [
                    {
                        "adcode": "120113",
                        "name": "北辰区"
                    },
                    {
                        "adcode": "120113001000",
                        "name": "果园新村街道"
                    },
                    {
                        "adcode": "120113002000",
                        "name": "集贤里街道"
                    },
                    {
                        "adcode": "120113003000",
                        "name": "普东街道"
                    },
                    {
                        "adcode": "120113004000",
                        "name": "瑞景街道"
                    },
                    {
                        "adcode": "120113005000",
                        "name": "佳荣里街道"
                    },
                    {
                        "adcode": "120113006000",
                        "name": "青源街道"
                    },
                    {
                        "adcode": "120113007000",
                        "name": "广源街道"
                    },
                    {
                        "adcode": "120113100000",
                        "name": "天穆镇"
                    },
                    {
                        "adcode": "120113101000",
                        "name": "北仓镇"
                    },
                    {
                        "adcode": "120113102000",
                        "name": "双街镇"
                    },
                    {
                        "adcode": "120113103000",
                        "name": "双口镇"
                    },
                    {
                        "adcode": "120113104000",
                        "name": "青光镇"
                    },
                    {
                        "adcode": "120113106000",
                        "name": "宜兴埠镇"
                    },
                    {
                        "adcode": "120113107000",
                        "name": "小淀镇"
                    },
                    {
                        "adcode": "120113108000",
                        "name": "大张庄镇"
                    },
                    {
                        "adcode": "120113111000",
                        "name": "西堤头镇"
                    },
                    {
                        "adcode": "120113400000",
                        "name": "科技园区北区"
                    },
                    {
                        "adcode": "120113401000",
                        "name": "科技园区南区"
                    },
                    {
                        "adcode": "120113402000",
                        "name": "天津医药医疗器械工业园"
                    },
                    {
                        "adcode": "120113403000",
                        "name": "天津陆路港物流装备产业园"
                    },
                    {
                        "adcode": "120113404000",
                        "name": "天津风电产业园"
                    },
                    {
                        "adcode": "120113500000",
                        "name": "红旗农场"
                    },
                    {
                        "adcode": "120113501000",
                        "name": "曙光农场"
                    }
                ]
            },
            {
                "adcode": "120103",
                "name": "河西区",
                "s": [
                    {
                        "adcode": "120103",
                        "name": "河西区"
                    },
                    {
                        "adcode": "120103001000",
                        "name": "大营门街道"
                    },
                    {
                        "adcode": "120103002000",
                        "name": "下瓦房街道"
                    },
                    {
                        "adcode": "120103003000",
                        "name": "桃园街道"
                    },
                    {
                        "adcode": "120103004000",
                        "name": "挂甲寺街道"
                    },
                    {
                        "adcode": "120103005000",
                        "name": "马场街道"
                    },
                    {
                        "adcode": "120103006000",
                        "name": "越秀路街道"
                    },
                    {
                        "adcode": "120103007000",
                        "name": "友谊路街道"
                    },
                    {
                        "adcode": "120103008000",
                        "name": "天塔街道"
                    },
                    {
                        "adcode": "120103009000",
                        "name": "尖山街道"
                    },
                    {
                        "adcode": "120103010000",
                        "name": "陈塘庄街道"
                    },
                    {
                        "adcode": "120103011000",
                        "name": "柳林街道"
                    },
                    {
                        "adcode": "120103012000",
                        "name": "东海街道"
                    },
                    {
                        "adcode": "120103013000",
                        "name": "梅江街道"
                    },
                    {
                        "adcode": "120103014000",
                        "name": "太湖路街道"
                    }
                ]
            },
            {
                "adcode": "120114",
                "name": "武清区",
                "s": [
                    {
                        "adcode": "120114",
                        "name": "武清区"
                    },
                    {
                        "adcode": "120114001000",
                        "name": "杨村街道"
                    },
                    {
                        "adcode": "120114002000",
                        "name": "下朱庄街道"
                    },
                    {
                        "adcode": "120114003000",
                        "name": "东蒲洼街道"
                    },
                    {
                        "adcode": "120114004000",
                        "name": "黄庄街道"
                    },
                    {
                        "adcode": "120114005000",
                        "name": "徐官屯街道"
                    },
                    {
                        "adcode": "120114006000",
                        "name": "运河西街道"
                    },
                    {
                        "adcode": "120114101000",
                        "name": "梅厂镇"
                    },
                    {
                        "adcode": "120114102000",
                        "name": "大碱厂镇"
                    },
                    {
                        "adcode": "120114103000",
                        "name": "崔黄口镇"
                    },
                    {
                        "adcode": "120114104000",
                        "name": "大良镇"
                    },
                    {
                        "adcode": "120114105000",
                        "name": "下伍旗镇"
                    },
                    {
                        "adcode": "120114106000",
                        "name": "南蔡村镇"
                    },
                    {
                        "adcode": "120114107000",
                        "name": "大孟庄镇"
                    },
                    {
                        "adcode": "120114108000",
                        "name": "泗村店镇"
                    },
                    {
                        "adcode": "120114109000",
                        "name": "河西务镇"
                    },
                    {
                        "adcode": "120114110000",
                        "name": "城关镇"
                    },
                    {
                        "adcode": "120114111000",
                        "name": "东马圈镇"
                    },
                    {
                        "adcode": "120114112000",
                        "name": "黄花店镇"
                    },
                    {
                        "adcode": "120114113000",
                        "name": "石各庄镇"
                    },
                    {
                        "adcode": "120114114000",
                        "name": "王庆坨镇"
                    },
                    {
                        "adcode": "120114115000",
                        "name": "汊沽港镇"
                    },
                    {
                        "adcode": "120114116000",
                        "name": "河北屯镇"
                    },
                    {
                        "adcode": "120114117000",
                        "name": "上马台镇"
                    },
                    {
                        "adcode": "120114118000",
                        "name": "大王古庄镇"
                    },
                    {
                        "adcode": "120114119000",
                        "name": "陈咀镇"
                    },
                    {
                        "adcode": "120114120000",
                        "name": "豆张庄镇"
                    },
                    {
                        "adcode": "120114121000",
                        "name": "曹子里镇"
                    },
                    {
                        "adcode": "120114122000",
                        "name": "大黄堡镇"
                    },
                    {
                        "adcode": "120114123000",
                        "name": "高村镇"
                    },
                    {
                        "adcode": "120114124000",
                        "name": "白古屯镇"
                    },
                    {
                        "adcode": "120114400000",
                        "name": "天津经济技术开发区逸仙科学工业园"
                    },
                    {
                        "adcode": "120114401000",
                        "name": "武清经济技术开发区"
                    },
                    {
                        "adcode": "120114403000",
                        "name": "天津京滨工业园"
                    },
                    {
                        "adcode": "120114404000",
                        "name": "天津京津电子商务产业园"
                    },
                    {
                        "adcode": "120114405000",
                        "name": "天津武清汽车产业园"
                    },
                    {
                        "adcode": "120114406000",
                        "name": "天津京津科技谷"
                    },
                    {
                        "adcode": "120114407000",
                        "name": "京津高村科技创新园"
                    },
                    {
                        "adcode": "120114500000",
                        "name": "武清农场"
                    }
                ]
            },
            {
                "adcode": "120104",
                "name": "南开区",
                "s": [
                    {
                        "adcode": "120104",
                        "name": "南开区"
                    },
                    {
                        "adcode": "120104001000",
                        "name": "长虹街道"
                    },
                    {
                        "adcode": "120104002000",
                        "name": "鼓楼街道"
                    },
                    {
                        "adcode": "120104003000",
                        "name": "兴南街道"
                    },
                    {
                        "adcode": "120104004000",
                        "name": "广开街道"
                    },
                    {
                        "adcode": "120104005000",
                        "name": "万兴街道"
                    },
                    {
                        "adcode": "120104006000",
                        "name": "学府街道"
                    },
                    {
                        "adcode": "120104007000",
                        "name": "向阳路街道"
                    },
                    {
                        "adcode": "120104008000",
                        "name": "嘉陵道街道"
                    },
                    {
                        "adcode": "120104009000",
                        "name": "王顶堤街道"
                    },
                    {
                        "adcode": "120104010000",
                        "name": "水上公园街道"
                    },
                    {
                        "adcode": "120104011000",
                        "name": "体育中心街道"
                    },
                    {
                        "adcode": "120104012000",
                        "name": "华苑街道"
                    }
                ]
            },
            {
                "adcode": "120115",
                "name": "宝坻区",
                "s": [
                    {
                        "adcode": "120115",
                        "name": "宝坻区"
                    },
                    {
                        "adcode": "120115001000",
                        "name": "海滨街道"
                    },
                    {
                        "adcode": "120115002000",
                        "name": "宝平街道"
                    },
                    {
                        "adcode": "120115003000",
                        "name": "钰华街道"
                    },
                    {
                        "adcode": "120115006000",
                        "name": "周良街道"
                    },
                    {
                        "adcode": "120115007000",
                        "name": "潮阳街道"
                    },
                    {
                        "adcode": "120115008000",
                        "name": "朝霞街道"
                    },
                    {
                        "adcode": "120115101000",
                        "name": "大口屯镇"
                    },
                    {
                        "adcode": "120115103000",
                        "name": "王卜庄镇"
                    },
                    {
                        "adcode": "120115104000",
                        "name": "方家庄镇"
                    },
                    {
                        "adcode": "120115105000",
                        "name": "林亭口镇"
                    },
                    {
                        "adcode": "120115106000",
                        "name": "八门城镇"
                    },
                    {
                        "adcode": "120115107000",
                        "name": "大钟庄镇"
                    },
                    {
                        "adcode": "120115108000",
                        "name": "新安镇"
                    },
                    {
                        "adcode": "120115111000",
                        "name": "霍各庄镇"
                    },
                    {
                        "adcode": "120115113000",
                        "name": "新开口镇"
                    },
                    {
                        "adcode": "120115115000",
                        "name": "大唐庄镇"
                    },
                    {
                        "adcode": "120115119000",
                        "name": "牛道口镇"
                    },
                    {
                        "adcode": "120115120000",
                        "name": "史各庄镇"
                    },
                    {
                        "adcode": "120115121000",
                        "name": "郝各庄镇"
                    },
                    {
                        "adcode": "120115123000",
                        "name": "牛家牌镇"
                    },
                    {
                        "adcode": "120115124000",
                        "name": "尔王庄镇"
                    },
                    {
                        "adcode": "120115125000",
                        "name": "黄庄镇"
                    },
                    {
                        "adcode": "120115126000",
                        "name": "口东镇"
                    },
                    {
                        "adcode": "120115127000",
                        "name": "大白庄镇"
                    },
                    {
                        "adcode": "120115456000",
                        "name": "宝坻经济开发区"
                    },
                    {
                        "adcode": "120115457000",
                        "name": "京津中关村科技城"
                    },
                    {
                        "adcode": "120115500000",
                        "name": "里自沽农场"
                    },
                    {
                        "adcode": "120115501000",
                        "name": "黄庄农场"
                    },
                    {
                        "adcode": "120115502000",
                        "name": "大钟农场"
                    }
                ]
            },
            {
                "adcode": "120105",
                "name": "河北区",
                "s": [
                    {
                        "adcode": "120105",
                        "name": "河北区"
                    },
                    {
                        "adcode": "120105001000",
                        "name": "光复道街道"
                    },
                    {
                        "adcode": "120105002000",
                        "name": "望海楼街道"
                    },
                    {
                        "adcode": "120105003000",
                        "name": "鸿顺里街道"
                    },
                    {
                        "adcode": "120105004000",
                        "name": "新开河街道"
                    },
                    {
                        "adcode": "120105005000",
                        "name": "铁东路街道"
                    },
                    {
                        "adcode": "120105006000",
                        "name": "建昌道街道"
                    },
                    {
                        "adcode": "120105007000",
                        "name": "宁园街道"
                    },
                    {
                        "adcode": "120105008000",
                        "name": "王串场街道"
                    },
                    {
                        "adcode": "120105009000",
                        "name": "江都路街道"
                    },
                    {
                        "adcode": "120105010000",
                        "name": "月牙河街道"
                    }
                ]
            },
            {
                "adcode": "120116",
                "name": "滨海新区",
                "s": [
                    {
                        "adcode": "120116",
                        "name": "滨海新区"
                    },
                    {
                        "adcode": "120116001000",
                        "name": "塘沽街道"
                    },
                    {
                        "adcode": "120116005000",
                        "name": "杭州道街道"
                    },
                    {
                        "adcode": "120116006000",
                        "name": "新河街道"
                    },
                    {
                        "adcode": "120116007000",
                        "name": "大沽街道"
                    },
                    {
                        "adcode": "120116008000",
                        "name": "新北街道"
                    },
                    {
                        "adcode": "120116009000",
                        "name": "北塘街道"
                    },
                    {
                        "adcode": "120116011000",
                        "name": "胡家园街道"
                    },
                    {
                        "adcode": "120116012000",
                        "name": "新港街道"
                    },
                    {
                        "adcode": "120116013000",
                        "name": "新村街道"
                    },
                    {
                        "adcode": "120116014000",
                        "name": "天津经济技术开发区东区泰达街道"
                    },
                    {
                        "adcode": "120116031000",
                        "name": "汉沽街道"
                    },
                    {
                        "adcode": "120116032000",
                        "name": "寨上街道"
                    },
                    {
                        "adcode": "120116033000",
                        "name": "茶淀街道"
                    },
                    {
                        "adcode": "120116051000",
                        "name": "大港街道"
                    },
                    {
                        "adcode": "120116053000",
                        "name": "古林街道"
                    },
                    {
                        "adcode": "120116054000",
                        "name": "海滨街道"
                    },
                    {
                        "adcode": "120116100000",
                        "name": "新城镇"
                    },
                    {
                        "adcode": "120116135000",
                        "name": "杨家泊镇"
                    },
                    {
                        "adcode": "120116156000",
                        "name": "太平镇"
                    },
                    {
                        "adcode": "120116157000",
                        "name": "小王庄镇"
                    },
                    {
                        "adcode": "120116158000",
                        "name": "中塘镇"
                    },
                    {
                        "adcode": "120116400000",
                        "name": "天津经济技术开发区（其他片区）"
                    },
                    {
                        "adcode": "120116401000",
                        "name": "天津港保税区"
                    },
                    {
                        "adcode": "120116402000",
                        "name": "天津滨海新区高新技术产业开发区"
                    },
                    {
                        "adcode": "120116403000",
                        "name": "东疆保税港区"
                    },
                    {
                        "adcode": "120116406000",
                        "name": "中新天津生态城"
                    }
                ]
            },
            {
                "adcode": "120110",
                "name": "东丽区",
                "s": [
                    {
                        "adcode": "120110",
                        "name": "东丽区"
                    },
                    {
                        "adcode": "120110001000",
                        "name": "张贵庄街道"
                    },
                    {
                        "adcode": "120110002000",
                        "name": "丰年村街道"
                    },
                    {
                        "adcode": "120110003000",
                        "name": "万新街道"
                    },
                    {
                        "adcode": "120110004000",
                        "name": "无瑕街道"
                    },
                    {
                        "adcode": "120110005000",
                        "name": "新立街道"
                    },
                    {
                        "adcode": "120110006000",
                        "name": "华明街道"
                    },
                    {
                        "adcode": "120110007000",
                        "name": "金钟街道"
                    },
                    {
                        "adcode": "120110008000",
                        "name": "军粮城街道"
                    },
                    {
                        "adcode": "120110009000",
                        "name": "金桥街道"
                    },
                    {
                        "adcode": "120110010000",
                        "name": "华新街道"
                    },
                    {
                        "adcode": "120110011000",
                        "name": "东丽湖街道"
                    },
                    {
                        "adcode": "120110400000",
                        "name": "天津经济技术开发区西区"
                    },
                    {
                        "adcode": "120110401000",
                        "name": "天津航空物流区"
                    },
                    {
                        "adcode": "120110402000",
                        "name": "天津空港经济区"
                    },
                    {
                        "adcode": "120110403000",
                        "name": "东丽区经济技术开发区"
                    },
                    {
                        "adcode": "120110405000",
                        "name": "综合保税区"
                    },
                    {
                        "adcode": "120110406000",
                        "name": "航空新城"
                    },
                    {
                        "adcode": "120110407000",
                        "name": "服务滨海新区建设管理委员会"
                    }
                ]
            },
            {
                "adcode": "120111",
                "name": "西青区",
                "s": [
                    {
                        "adcode": "120111",
                        "name": "西青区"
                    },
                    {
                        "adcode": "120111001000",
                        "name": "西营门街道"
                    },
                    {
                        "adcode": "120111002000",
                        "name": "李七庄街道"
                    },
                    {
                        "adcode": "120111003000",
                        "name": "赤龙南街道"
                    },
                    {
                        "adcode": "120111100000",
                        "name": "中北镇"
                    },
                    {
                        "adcode": "120111101000",
                        "name": "杨柳青镇"
                    },
                    {
                        "adcode": "120111102000",
                        "name": "辛口镇"
                    },
                    {
                        "adcode": "120111103000",
                        "name": "张家窝镇"
                    },
                    {
                        "adcode": "120111104000",
                        "name": "精武镇"
                    },
                    {
                        "adcode": "120111105000",
                        "name": "大寺镇"
                    },
                    {
                        "adcode": "120111106000",
                        "name": "王稳庄镇"
                    },
                    {
                        "adcode": "120111400000",
                        "name": "天津经济技术开发区微电子小区"
                    },
                    {
                        "adcode": "120111401000",
                        "name": "新技术产业园区"
                    },
                    {
                        "adcode": "120111450000",
                        "name": "西青区开发区"
                    }
                ]
            },
            {
                "adcode": "120101",
                "name": "和平区",
                "s": [
                    {
                        "adcode": "120101",
                        "name": "和平区"
                    },
                    {
                        "adcode": "120101001000",
                        "name": "劝业场街道"
                    },
                    {
                        "adcode": "120101002000",
                        "name": "小白楼街道"
                    },
                    {
                        "adcode": "120101003000",
                        "name": "五大道街道"
                    },
                    {
                        "adcode": "120101004000",
                        "name": "新兴街道"
                    },
                    {
                        "adcode": "120101005000",
                        "name": "南营门街道"
                    },
                    {
                        "adcode": "120101006000",
                        "name": "南市街道"
                    }
                ]
            },
            {
                "adcode": "120112",
                "name": "津南区",
                "s": [
                    {
                        "adcode": "120112",
                        "name": "津南区"
                    },
                    {
                        "adcode": "120112001000",
                        "name": "双新街道"
                    },
                    {
                        "adcode": "120112002000",
                        "name": "双林街道"
                    },
                    {
                        "adcode": "120112100000",
                        "name": "咸水沽镇"
                    },
                    {
                        "adcode": "120112101000",
                        "name": "葛沽镇"
                    },
                    {
                        "adcode": "120112102000",
                        "name": "小站镇"
                    },
                    {
                        "adcode": "120112103000",
                        "name": "双港镇"
                    },
                    {
                        "adcode": "120112104000",
                        "name": "辛庄镇"
                    },
                    {
                        "adcode": "120112106000",
                        "name": "双桥河镇"
                    },
                    {
                        "adcode": "120112107000",
                        "name": "八里台镇"
                    },
                    {
                        "adcode": "120112108000",
                        "name": "北闸口镇"
                    },
                    {
                        "adcode": "120112401000",
                        "name": "铁路十八局"
                    },
                    {
                        "adcode": "120112403000",
                        "name": "长青办事处"
                    },
                    {
                        "adcode": "120112404000",
                        "name": "津南开发区东区"
                    },
                    {
                        "adcode": "120112405000",
                        "name": "津南开发区西区"
                    },
                    {
                        "adcode": "120112407000",
                        "name": "海河教育园区"
                    },
                    {
                        "adcode": "120112501000",
                        "name": "津南国家农业园区"
                    }
                ]
            },
            {
                "adcode": "120106",
                "name": "红桥区",
                "s": [
                    {
                        "adcode": "120106",
                        "name": "红桥区"
                    },
                    {
                        "adcode": "120106001000",
                        "name": "西于庄街道"
                    },
                    {
                        "adcode": "120106002000",
                        "name": "双环村街道"
                    },
                    {
                        "adcode": "120106003000",
                        "name": "咸阳北路街道"
                    },
                    {
                        "adcode": "120106004000",
                        "name": "丁字沽街道"
                    },
                    {
                        "adcode": "120106005000",
                        "name": "西沽街道"
                    },
                    {
                        "adcode": "120106006000",
                        "name": "三条石街道"
                    },
                    {
                        "adcode": "120106008000",
                        "name": "邵公庄街道"
                    },
                    {
                        "adcode": "120106009000",
                        "name": "芥园街道"
                    },
                    {
                        "adcode": "120106010000",
                        "name": "铃铛阁街道"
                    },
                    {
                        "adcode": "120106012000",
                        "name": "和苑街道"
                    }
                ]
            },
            {
                "adcode": "120117",
                "name": "宁河区",
                "s": [
                    {
                        "adcode": "120117001000",
                        "name": "芦台街道"
                    },
                    {
                        "adcode": "120117002000",
                        "name": "桥北街道"
                    },
                    {
                        "adcode": "120117102000",
                        "name": "宁河镇"
                    },
                    {
                        "adcode": "120117103000",
                        "name": "苗庄镇"
                    },
                    {
                        "adcode": "120117104000",
                        "name": "丰台镇"
                    },
                    {
                        "adcode": "120117105000",
                        "name": "岳龙镇"
                    },
                    {
                        "adcode": "120117106000",
                        "name": "板桥镇"
                    },
                    {
                        "adcode": "120117107000",
                        "name": "潘庄镇"
                    },
                    {
                        "adcode": "120117109000",
                        "name": "造甲城镇"
                    },
                    {
                        "adcode": "120117110000",
                        "name": "七里海镇"
                    },
                    {
                        "adcode": "120117111000",
                        "name": "大北涧沽镇"
                    },
                    {
                        "adcode": "120117112000",
                        "name": "东棘坨镇"
                    },
                    {
                        "adcode": "120117113000",
                        "name": "北淮淀镇"
                    },
                    {
                        "adcode": "120117114000",
                        "name": "俵口镇"
                    },
                    {
                        "adcode": "120117115000",
                        "name": "廉庄镇"
                    },
                    {
                        "adcode": "120117400000",
                        "name": "宁河区贸易开发区"
                    },
                    {
                        "adcode": "120117401000",
                        "name": "宁河区经济开发区"
                    },
                    {
                        "adcode": "120117402000",
                        "name": "天津未来科技城天津经济技术开发区片区"
                    },
                    {
                        "adcode": "120117403000",
                        "name": "天津未来科技城滨海高新区片区"
                    },
                    {
                        "adcode": "120117451000",
                        "name": "天津未来科技城宁河片区现代产业区组团"
                    },
                    {
                        "adcode": "120117452000",
                        "name": "天津未来科技城宁河片区潘庄工业区组团"
                    },
                    {
                        "adcode": "120117453000",
                        "name": "天津未来科技城宁河片区北淮淀组团"
                    },
                    {
                        "adcode": "120117",
                        "name": "宁河区"
                    }
                ]
            },
            {
                "adcode": "120118",
                "name": "静海区",
                "s": [
                    {
                        "adcode": "120118001000",
                        "name": "华康街道"
                    },
                    {
                        "adcode": "120118100000",
                        "name": "静海镇"
                    },
                    {
                        "adcode": "120118101000",
                        "name": "唐官屯镇"
                    },
                    {
                        "adcode": "120118102000",
                        "name": "独流镇"
                    },
                    {
                        "adcode": "120118103000",
                        "name": "王口镇"
                    },
                    {
                        "adcode": "120118104000",
                        "name": "台头镇"
                    },
                    {
                        "adcode": "120118105000",
                        "name": "子牙镇"
                    },
                    {
                        "adcode": "120118106000",
                        "name": "陈官屯镇"
                    },
                    {
                        "adcode": "120118107000",
                        "name": "中旺镇"
                    },
                    {
                        "adcode": "120118108000",
                        "name": "大邱庄镇"
                    },
                    {
                        "adcode": "120118109000",
                        "name": "蔡公庄镇"
                    },
                    {
                        "adcode": "120118110000",
                        "name": "梁头镇"
                    },
                    {
                        "adcode": "120118111000",
                        "name": "团泊镇"
                    },
                    {
                        "adcode": "120118112000",
                        "name": "双塘镇"
                    },
                    {
                        "adcode": "120118113000",
                        "name": "大丰堆镇"
                    },
                    {
                        "adcode": "120118114000",
                        "name": "沿庄镇"
                    },
                    {
                        "adcode": "120118115000",
                        "name": "西翟庄镇"
                    },
                    {
                        "adcode": "120118200000",
                        "name": "良王庄乡"
                    },
                    {
                        "adcode": "120118201000",
                        "name": "杨成庄乡"
                    },
                    {
                        "adcode": "120118400000",
                        "name": "天津静海经济开发区"
                    },
                    {
                        "adcode": "120118402000",
                        "name": "天津子牙循环经济产业区"
                    },
                    {
                        "adcode": "120118403000",
                        "name": "团泊新城"
                    },
                    {
                        "adcode": "120118",
                        "name": "静海区"
                    }
                ]
            },
            {
                "adcode": "120119",
                "name": "蓟州区",
                "s": [
                    {
                        "adcode": "120119001000",
                        "name": "文昌街道"
                    },
                    {
                        "adcode": "120119100000",
                        "name": "渔阳镇"
                    },
                    {
                        "adcode": "120119101000",
                        "name": "洇溜镇"
                    },
                    {
                        "adcode": "120119102000",
                        "name": "官庄镇"
                    },
                    {
                        "adcode": "120119103000",
                        "name": "马伸桥镇"
                    },
                    {
                        "adcode": "120119104000",
                        "name": "下营镇"
                    },
                    {
                        "adcode": "120119105000",
                        "name": "邦均镇"
                    },
                    {
                        "adcode": "120119106000",
                        "name": "别山镇"
                    },
                    {
                        "adcode": "120119108000",
                        "name": "尤古庄镇"
                    },
                    {
                        "adcode": "120119109000",
                        "name": "上仓镇"
                    },
                    {
                        "adcode": "120119111000",
                        "name": "下仓镇"
                    },
                    {
                        "adcode": "120119112000",
                        "name": "罗庄子镇"
                    },
                    {
                        "adcode": "120119113000",
                        "name": "白涧镇"
                    },
                    {
                        "adcode": "120119115000",
                        "name": "侯家营镇"
                    },
                    {
                        "adcode": "120119116000",
                        "name": "桑梓镇"
                    },
                    {
                        "adcode": "120119117000",
                        "name": "东施古镇"
                    },
                    {
                        "adcode": "120119118000",
                        "name": "下窝头镇"
                    },
                    {
                        "adcode": "120119119000",
                        "name": "杨津庄镇"
                    },
                    {
                        "adcode": "120119120000",
                        "name": "出头岭镇"
                    },
                    {
                        "adcode": "120119121000",
                        "name": "西龙虎峪镇"
                    },
                    {
                        "adcode": "120119122000",
                        "name": "穿芳峪镇"
                    },
                    {
                        "adcode": "120119123000",
                        "name": "东二营镇"
                    },
                    {
                        "adcode": "120119124000",
                        "name": "许家台镇"
                    },
                    {
                        "adcode": "120119125000",
                        "name": "礼明庄镇"
                    },
                    {
                        "adcode": "120119126000",
                        "name": "东赵各庄镇"
                    },
                    {
                        "adcode": "120119127000",
                        "name": "州河湾镇"
                    },
                    {
                        "adcode": "120119203000",
                        "name": "孙各庄乡"
                    },
                    {
                        "adcode": "120119401000",
                        "name": "天津市蓟州区京津州河科技产业园管理委员会"
                    },
                    {
                        "adcode": "120119",
                        "name": "蓟州区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "51",
        "name": "四川省",
        "s": [
            {
                "adcode": "5120",
                "name": "资阳市",
                "s": [
                    {
                        "adcode": "512099",
                        "name": "资阳市市本级"
                    },
                    {
                        "adcode": "512002",
                        "name": "雁江区"
                    },
                    {
                        "adcode": "512021",
                        "name": "安岳县"
                    },
                    {
                        "adcode": "512022",
                        "name": "乐至县"
                    },
                    {
                        "adcode": "512081",
                        "name": "简阳市"
                    },
                    {
                        "adcode": "512001",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5110",
                "name": "内江市",
                "s": [
                    {
                        "adcode": "511099",
                        "name": "内江市市本级"
                    },
                    {
                        "adcode": "511002",
                        "name": "市中区"
                    },
                    {
                        "adcode": "511011",
                        "name": "东兴区"
                    },
                    {
                        "adcode": "511024",
                        "name": "威远县"
                    },
                    {
                        "adcode": "511025",
                        "name": "资中县"
                    },
                    {
                        "adcode": "511028",
                        "name": "隆昌县"
                    },
                    {
                        "adcode": "511040",
                        "name": "经济技术开发区"
                    },
                    {
                        "adcode": "511001",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "511071",
                        "name": "内江经济开发区"
                    },
                    {
                        "adcode": "511083",
                        "name": "隆昌市"
                    }
                ]
            },
            {
                "adcode": "5132",
                "name": "阿坝藏族羌族自治州",
                "s": [
                    {
                        "adcode": "513299",
                        "name": "阿坝藏族羌族自治州州本级"
                    },
                    {
                        "adcode": "513221",
                        "name": "汶川县"
                    },
                    {
                        "adcode": "513222",
                        "name": "理县"
                    },
                    {
                        "adcode": "513223",
                        "name": "茂县"
                    },
                    {
                        "adcode": "513224",
                        "name": "松潘县"
                    },
                    {
                        "adcode": "513225",
                        "name": "九寨沟县"
                    },
                    {
                        "adcode": "513226",
                        "name": "金川县"
                    },
                    {
                        "adcode": "513227",
                        "name": "小金县"
                    },
                    {
                        "adcode": "513228",
                        "name": "黑水县"
                    },
                    {
                        "adcode": "513229",
                        "name": "马尔康县"
                    },
                    {
                        "adcode": "513230",
                        "name": "壤塘县"
                    },
                    {
                        "adcode": "513231",
                        "name": "阿坝县"
                    },
                    {
                        "adcode": "513232",
                        "name": "若尔盖县"
                    },
                    {
                        "adcode": "513233",
                        "name": "红原县"
                    },
                    {
                        "adcode": "513240",
                        "name": "卧龙特区"
                    },
                    {
                        "adcode": "513201",
                        "name": "马尔康市"
                    }
                ]
            },
            {
                "adcode": "5111",
                "name": "乐山市",
                "s": [
                    {
                        "adcode": "511199",
                        "name": "乐山市市本级"
                    },
                    {
                        "adcode": "511102",
                        "name": "市中区"
                    },
                    {
                        "adcode": "511111",
                        "name": "沙湾区"
                    },
                    {
                        "adcode": "511112",
                        "name": "五通桥区"
                    },
                    {
                        "adcode": "511113",
                        "name": "金口河区"
                    },
                    {
                        "adcode": "511123",
                        "name": "犍为县"
                    },
                    {
                        "adcode": "511124",
                        "name": "井研县"
                    },
                    {
                        "adcode": "511126",
                        "name": "夹江县"
                    },
                    {
                        "adcode": "511129",
                        "name": "沐川县"
                    },
                    {
                        "adcode": "511132",
                        "name": "峨边彝族自治县"
                    },
                    {
                        "adcode": "511133",
                        "name": "马边彝族自治县"
                    },
                    {
                        "adcode": "511181",
                        "name": "峨眉山市"
                    },
                    {
                        "adcode": "511101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5133",
                "name": "甘孜藏族自治州",
                "s": [
                    {
                        "adcode": "513399",
                        "name": "甘孜藏族自治州州本级"
                    },
                    {
                        "adcode": "513321",
                        "name": "康定县"
                    },
                    {
                        "adcode": "513322",
                        "name": "泸定县"
                    },
                    {
                        "adcode": "513323",
                        "name": "丹巴县"
                    },
                    {
                        "adcode": "513324",
                        "name": "九龙县"
                    },
                    {
                        "adcode": "513325",
                        "name": "雅江县"
                    },
                    {
                        "adcode": "513326",
                        "name": "道孚县"
                    },
                    {
                        "adcode": "513327",
                        "name": "炉霍县"
                    },
                    {
                        "adcode": "513328",
                        "name": "甘孜县"
                    },
                    {
                        "adcode": "513329",
                        "name": "新龙县"
                    },
                    {
                        "adcode": "513330",
                        "name": "德格县"
                    },
                    {
                        "adcode": "513331",
                        "name": "白玉县"
                    },
                    {
                        "adcode": "513332",
                        "name": "石渠县"
                    },
                    {
                        "adcode": "513333",
                        "name": "色达县"
                    },
                    {
                        "adcode": "513334",
                        "name": "理塘县"
                    },
                    {
                        "adcode": "513335",
                        "name": "巴塘县"
                    },
                    {
                        "adcode": "513336",
                        "name": "乡城县"
                    },
                    {
                        "adcode": "513337",
                        "name": "稻城县"
                    },
                    {
                        "adcode": "513338",
                        "name": "得荣县"
                    },
                    {
                        "adcode": "513301",
                        "name": "康定市"
                    }
                ]
            },
            {
                "adcode": "5101",
                "name": "成都市",
                "s": [
                    {
                        "adcode": "510116",
                        "name": "双流区"
                    },
                    {
                        "adcode": "510117",
                        "name": "郫都区"
                    },
                    {
                        "adcode": "510104",
                        "name": "锦江区"
                    },
                    {
                        "adcode": "510105",
                        "name": "青羊区"
                    },
                    {
                        "adcode": "510106",
                        "name": "金牛区"
                    },
                    {
                        "adcode": "510107",
                        "name": "武侯区"
                    },
                    {
                        "adcode": "510108",
                        "name": "成华区"
                    },
                    {
                        "adcode": "510112",
                        "name": "龙泉驿区"
                    },
                    {
                        "adcode": "510113",
                        "name": "青白江区"
                    },
                    {
                        "adcode": "510114",
                        "name": "新都区"
                    },
                    {
                        "adcode": "510115",
                        "name": "温江区"
                    },
                    {
                        "adcode": "510121",
                        "name": "金堂县"
                    },
                    {
                        "adcode": "510122",
                        "name": "双流县"
                    },
                    {
                        "adcode": "510124",
                        "name": "郫县"
                    },
                    {
                        "adcode": "510129",
                        "name": "大邑县"
                    },
                    {
                        "adcode": "510131",
                        "name": "蒲江县"
                    },
                    {
                        "adcode": "510132",
                        "name": "新津县"
                    },
                    {
                        "adcode": "510140",
                        "name": "高新区"
                    },
                    {
                        "adcode": "510141",
                        "name": "天府新区"
                    },
                    {
                        "adcode": "510181",
                        "name": "都江堰市"
                    },
                    {
                        "adcode": "510182",
                        "name": "彭州市"
                    },
                    {
                        "adcode": "510183",
                        "name": "邛崃市"
                    },
                    {
                        "adcode": "510184",
                        "name": "崇州市"
                    },
                    {
                        "adcode": "510185",
                        "name": "简阳市"
                    },
                    {
                        "adcode": "510101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5134",
                "name": "凉山彝族自治州",
                "s": [
                    {
                        "adcode": "513499",
                        "name": "凉山彝族自治州州本级"
                    },
                    {
                        "adcode": "513401",
                        "name": "西昌市"
                    },
                    {
                        "adcode": "513422",
                        "name": "木里藏族自治县"
                    },
                    {
                        "adcode": "513423",
                        "name": "盐源县"
                    },
                    {
                        "adcode": "513424",
                        "name": "德昌县"
                    },
                    {
                        "adcode": "513425",
                        "name": "会理县"
                    },
                    {
                        "adcode": "513426",
                        "name": "会东县"
                    },
                    {
                        "adcode": "513427",
                        "name": "宁南县"
                    },
                    {
                        "adcode": "513428",
                        "name": "普格县"
                    },
                    {
                        "adcode": "513429",
                        "name": "布拖县"
                    },
                    {
                        "adcode": "513430",
                        "name": "金阳县"
                    },
                    {
                        "adcode": "513431",
                        "name": "昭觉县"
                    },
                    {
                        "adcode": "513432",
                        "name": "喜德县"
                    },
                    {
                        "adcode": "513433",
                        "name": "冕宁县"
                    },
                    {
                        "adcode": "513434",
                        "name": "越西县"
                    },
                    {
                        "adcode": "513435",
                        "name": "甘洛县"
                    },
                    {
                        "adcode": "513436",
                        "name": "美姑县"
                    },
                    {
                        "adcode": "513437",
                        "name": "雷波县"
                    }
                ]
            },
            {
                "adcode": "5113",
                "name": "南充市",
                "s": [
                    {
                        "adcode": "511399",
                        "name": "南充市市本级"
                    },
                    {
                        "adcode": "511302",
                        "name": "顺庆区"
                    },
                    {
                        "adcode": "511303",
                        "name": "高坪区"
                    },
                    {
                        "adcode": "511304",
                        "name": "嘉陵区"
                    },
                    {
                        "adcode": "511321",
                        "name": "南部县"
                    },
                    {
                        "adcode": "511322",
                        "name": "营山县"
                    },
                    {
                        "adcode": "511323",
                        "name": "蓬安县"
                    },
                    {
                        "adcode": "511324",
                        "name": "仪陇县"
                    },
                    {
                        "adcode": "511325",
                        "name": "西充县"
                    },
                    {
                        "adcode": "511381",
                        "name": "阆中市"
                    },
                    {
                        "adcode": "511301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5103",
                "name": "自贡市",
                "s": [
                    {
                        "adcode": "510399",
                        "name": "自贡市市本级"
                    },
                    {
                        "adcode": "510302",
                        "name": "自流井区"
                    },
                    {
                        "adcode": "510303",
                        "name": "贡井区"
                    },
                    {
                        "adcode": "510304",
                        "name": "大安区"
                    },
                    {
                        "adcode": "510311",
                        "name": "沿滩区"
                    },
                    {
                        "adcode": "510321",
                        "name": "荣县"
                    },
                    {
                        "adcode": "510322",
                        "name": "富顺县"
                    },
                    {
                        "adcode": "510340",
                        "name": "自贡高新技术产业开发区"
                    },
                    {
                        "adcode": "510301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5114",
                "name": "眉山市",
                "s": [
                    {
                        "adcode": "511499",
                        "name": "眉山市市本级"
                    },
                    {
                        "adcode": "511402",
                        "name": "东坡区"
                    },
                    {
                        "adcode": "511421",
                        "name": "仁寿县"
                    },
                    {
                        "adcode": "511422",
                        "name": "彭山县"
                    },
                    {
                        "adcode": "511423",
                        "name": "洪雅县"
                    },
                    {
                        "adcode": "511424",
                        "name": "丹棱县"
                    },
                    {
                        "adcode": "511425",
                        "name": "青神县"
                    },
                    {
                        "adcode": "511401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "511403",
                        "name": "彭山区"
                    }
                ]
            },
            {
                "adcode": "5104",
                "name": "攀枝花市",
                "s": [
                    {
                        "adcode": "510499",
                        "name": "攀枝花市市本级"
                    },
                    {
                        "adcode": "510402",
                        "name": "东区"
                    },
                    {
                        "adcode": "510403",
                        "name": "西区"
                    },
                    {
                        "adcode": "510411",
                        "name": "仁和区"
                    },
                    {
                        "adcode": "510421",
                        "name": "米易县"
                    },
                    {
                        "adcode": "510422",
                        "name": "盐边县"
                    },
                    {
                        "adcode": "510401",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5115",
                "name": "宜宾市",
                "s": [
                    {
                        "adcode": "511599",
                        "name": "宜宾市市本级"
                    },
                    {
                        "adcode": "511502",
                        "name": "翠屏区"
                    },
                    {
                        "adcode": "511521",
                        "name": "宜宾县"
                    },
                    {
                        "adcode": "511522",
                        "name": "南溪县"
                    },
                    {
                        "adcode": "511523",
                        "name": "江安县"
                    },
                    {
                        "adcode": "511524",
                        "name": "长宁县"
                    },
                    {
                        "adcode": "511525",
                        "name": "高县"
                    },
                    {
                        "adcode": "511526",
                        "name": "珙县"
                    },
                    {
                        "adcode": "511527",
                        "name": "筠连县"
                    },
                    {
                        "adcode": "511528",
                        "name": "兴文县"
                    },
                    {
                        "adcode": "511529",
                        "name": "屏山县"
                    },
                    {
                        "adcode": "511540",
                        "name": "临港开发区"
                    },
                    {
                        "adcode": "511501",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "511503",
                        "name": "南溪区"
                    },
                    {
                        "adcode": "511504",
                        "name": "叙州区"
                    }
                ]
            },
            {
                "adcode": "5105",
                "name": "泸州市",
                "s": [
                    {
                        "adcode": "510599",
                        "name": "泸州市市本级"
                    },
                    {
                        "adcode": "510502",
                        "name": "江阳区"
                    },
                    {
                        "adcode": "510503",
                        "name": "纳溪区"
                    },
                    {
                        "adcode": "510504",
                        "name": "龙马潭区"
                    },
                    {
                        "adcode": "510521",
                        "name": "泸县"
                    },
                    {
                        "adcode": "510522",
                        "name": "合江县"
                    },
                    {
                        "adcode": "510524",
                        "name": "叙永县"
                    },
                    {
                        "adcode": "510525",
                        "name": "古蔺县"
                    },
                    {
                        "adcode": "510501",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5116",
                "name": "广安市",
                "s": [
                    {
                        "adcode": "511699",
                        "name": "广安市市本级"
                    },
                    {
                        "adcode": "511602",
                        "name": "广安区"
                    },
                    {
                        "adcode": "511621",
                        "name": "岳池县"
                    },
                    {
                        "adcode": "511622",
                        "name": "武胜县"
                    },
                    {
                        "adcode": "511623",
                        "name": "邻水县"
                    },
                    {
                        "adcode": "511681",
                        "name": "华蓥市"
                    },
                    {
                        "adcode": "511640",
                        "name": "广安市经济技术开发区"
                    },
                    {
                        "adcode": "511641",
                        "name": "广安枣山物流商贸园区"
                    },
                    {
                        "adcode": "511642",
                        "name": "广安协兴生态文化旅游园区"
                    },
                    {
                        "adcode": "511601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "511603",
                        "name": "前锋区"
                    }
                ]
            },
            {
                "adcode": "5106",
                "name": "德阳市",
                "s": [
                    {
                        "adcode": "510699",
                        "name": "德阳市市本级"
                    },
                    {
                        "adcode": "510603",
                        "name": "旌阳区"
                    },
                    {
                        "adcode": "510623",
                        "name": "中江县"
                    },
                    {
                        "adcode": "510626",
                        "name": "罗江县"
                    },
                    {
                        "adcode": "510681",
                        "name": "广汉市"
                    },
                    {
                        "adcode": "510682",
                        "name": "什邡市"
                    },
                    {
                        "adcode": "510683",
                        "name": "绵竹市"
                    },
                    {
                        "adcode": "510601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "510604",
                        "name": "罗江区"
                    }
                ]
            },
            {
                "adcode": "5117",
                "name": "达州市",
                "s": [
                    {
                        "adcode": "511799",
                        "name": "达州市市本级"
                    },
                    {
                        "adcode": "511702",
                        "name": "通川区"
                    },
                    {
                        "adcode": "511703",
                        "name": "达川区"
                    },
                    {
                        "adcode": "511721",
                        "name": "达县"
                    },
                    {
                        "adcode": "511722",
                        "name": "宣汉县"
                    },
                    {
                        "adcode": "511723",
                        "name": "开江县"
                    },
                    {
                        "adcode": "511724",
                        "name": "大竹县"
                    },
                    {
                        "adcode": "511725",
                        "name": "渠县"
                    },
                    {
                        "adcode": "511781",
                        "name": "万源市"
                    },
                    {
                        "adcode": "511701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "511771",
                        "name": "达州经济开发区"
                    }
                ]
            },
            {
                "adcode": "5107",
                "name": "绵阳市",
                "s": [
                    {
                        "adcode": "510705",
                        "name": "安州区"
                    },
                    {
                        "adcode": "510799",
                        "name": "绵阳市市本级"
                    },
                    {
                        "adcode": "510703",
                        "name": "涪城区"
                    },
                    {
                        "adcode": "510704",
                        "name": "游仙区"
                    },
                    {
                        "adcode": "510722",
                        "name": "三台县"
                    },
                    {
                        "adcode": "510723",
                        "name": "盐亭县"
                    },
                    {
                        "adcode": "510724",
                        "name": "安县"
                    },
                    {
                        "adcode": "510725",
                        "name": "梓潼县"
                    },
                    {
                        "adcode": "510726",
                        "name": "北川羌族自治县"
                    },
                    {
                        "adcode": "510727",
                        "name": "平武县"
                    },
                    {
                        "adcode": "510740",
                        "name": "高新区"
                    },
                    {
                        "adcode": "510741",
                        "name": "绵阳科学城"
                    },
                    {
                        "adcode": "510742",
                        "name": "绵阳经济技术开发区"
                    },
                    {
                        "adcode": "510743",
                        "name": "仙海水利经济开发区"
                    },
                    {
                        "adcode": "510781",
                        "name": "江油市"
                    },
                    {
                        "adcode": "510701",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5118",
                "name": "雅安市",
                "s": [
                    {
                        "adcode": "511899",
                        "name": "雅安市市本级"
                    },
                    {
                        "adcode": "511802",
                        "name": "雨城区"
                    },
                    {
                        "adcode": "511821",
                        "name": "名山县"
                    },
                    {
                        "adcode": "511822",
                        "name": "荥经县"
                    },
                    {
                        "adcode": "511823",
                        "name": "汉源县"
                    },
                    {
                        "adcode": "511824",
                        "name": "石棉县"
                    },
                    {
                        "adcode": "511825",
                        "name": "天全县"
                    },
                    {
                        "adcode": "511826",
                        "name": "芦山县"
                    },
                    {
                        "adcode": "511827",
                        "name": "宝兴县"
                    },
                    {
                        "adcode": "511801",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "511803",
                        "name": "名山区"
                    }
                ]
            },
            {
                "adcode": "5108",
                "name": "广元市",
                "s": [
                    {
                        "adcode": "510899",
                        "name": "广元市市本级"
                    },
                    {
                        "adcode": "510802",
                        "name": "利州区"
                    },
                    {
                        "adcode": "510811",
                        "name": "昭化区"
                    },
                    {
                        "adcode": "510812",
                        "name": "朝天区"
                    },
                    {
                        "adcode": "510821",
                        "name": "旺苍县"
                    },
                    {
                        "adcode": "510822",
                        "name": "青川县"
                    },
                    {
                        "adcode": "510823",
                        "name": "剑阁县"
                    },
                    {
                        "adcode": "510824",
                        "name": "苍溪县"
                    },
                    {
                        "adcode": "510840",
                        "name": "经济技术开发区"
                    },
                    {
                        "adcode": "510801",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5119",
                "name": "巴中市",
                "s": [
                    {
                        "adcode": "511999",
                        "name": "巴中市市本级"
                    },
                    {
                        "adcode": "511902",
                        "name": "巴州区"
                    },
                    {
                        "adcode": "511903",
                        "name": "恩阳区"
                    },
                    {
                        "adcode": "511921",
                        "name": "通江县"
                    },
                    {
                        "adcode": "511922",
                        "name": "南江县"
                    },
                    {
                        "adcode": "511923",
                        "name": "平昌县"
                    },
                    {
                        "adcode": "511940",
                        "name": "巴中经济开发区"
                    },
                    {
                        "adcode": "511901",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "5109",
                "name": "遂宁市",
                "s": [
                    {
                        "adcode": "510999",
                        "name": "遂宁市市本级"
                    },
                    {
                        "adcode": "510903",
                        "name": "船山区"
                    },
                    {
                        "adcode": "510904",
                        "name": "安居区"
                    },
                    {
                        "adcode": "510921",
                        "name": "蓬溪县"
                    },
                    {
                        "adcode": "510922",
                        "name": "射洪县"
                    },
                    {
                        "adcode": "510923",
                        "name": "大英县"
                    },
                    {
                        "adcode": "510901",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "14",
        "name": "山西省",
        "s": [
            {
                "adcode": "1404",
                "name": "长治市",
                "s": [
                    {
                        "adcode": "140499",
                        "name": "长治市市本级"
                    },
                    {
                        "adcode": "140402",
                        "name": "城区"
                    },
                    {
                        "adcode": "140411",
                        "name": "郊区"
                    },
                    {
                        "adcode": "140421",
                        "name": "长治县"
                    },
                    {
                        "adcode": "140423",
                        "name": "襄垣县"
                    },
                    {
                        "adcode": "140424",
                        "name": "屯留县"
                    },
                    {
                        "adcode": "140425",
                        "name": "平顺县"
                    },
                    {
                        "adcode": "140426",
                        "name": "黎城县"
                    },
                    {
                        "adcode": "140427",
                        "name": "壶关县"
                    },
                    {
                        "adcode": "140428",
                        "name": "长子县"
                    },
                    {
                        "adcode": "140429",
                        "name": "武乡县"
                    },
                    {
                        "adcode": "140430",
                        "name": "沁县"
                    },
                    {
                        "adcode": "140431",
                        "name": "沁源县"
                    },
                    {
                        "adcode": "140440",
                        "name": "开发区"
                    },
                    {
                        "adcode": "140441",
                        "name": "高新区"
                    },
                    {
                        "adcode": "140481",
                        "name": "潞城市"
                    },
                    {
                        "adcode": "140401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "140403",
                        "name": "潞州区"
                    },
                    {
                        "adcode": "140404",
                        "name": "上党区"
                    },
                    {
                        "adcode": "140405",
                        "name": "屯留区"
                    },
                    {
                        "adcode": "140406",
                        "name": "潞城区"
                    },
                    {
                        "adcode": "140471",
                        "name": "山西长治高新技术产业园区"
                    }
                ]
            },
            {
                "adcode": "1403",
                "name": "阳泉市",
                "s": [
                    {
                        "adcode": "140399",
                        "name": "阳泉市市本级"
                    },
                    {
                        "adcode": "140302",
                        "name": "城区"
                    },
                    {
                        "adcode": "140303",
                        "name": "矿区"
                    },
                    {
                        "adcode": "140311",
                        "name": "郊区"
                    },
                    {
                        "adcode": "140321",
                        "name": "平定县"
                    },
                    {
                        "adcode": "140322",
                        "name": "盂县"
                    },
                    {
                        "adcode": "140340",
                        "name": "开发区"
                    },
                    {
                        "adcode": "140301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "1402",
                "name": "大同市",
                "s": [
                    {
                        "adcode": "140299",
                        "name": "大同市市本级"
                    },
                    {
                        "adcode": "140202",
                        "name": "城区"
                    },
                    {
                        "adcode": "140203",
                        "name": "矿区"
                    },
                    {
                        "adcode": "140211",
                        "name": "南郊区"
                    },
                    {
                        "adcode": "140212",
                        "name": "新荣区"
                    },
                    {
                        "adcode": "140221",
                        "name": "阳高县"
                    },
                    {
                        "adcode": "140222",
                        "name": "天镇县"
                    },
                    {
                        "adcode": "140223",
                        "name": "广灵县"
                    },
                    {
                        "adcode": "140224",
                        "name": "灵丘县"
                    },
                    {
                        "adcode": "140225",
                        "name": "浑源县"
                    },
                    {
                        "adcode": "140226",
                        "name": "左云县"
                    },
                    {
                        "adcode": "140227",
                        "name": "大同县"
                    },
                    {
                        "adcode": "140240",
                        "name": "开发区"
                    },
                    {
                        "adcode": "140201",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "140214",
                        "name": "云冈区"
                    },
                    {
                        "adcode": "140215",
                        "name": "云州区"
                    },
                    {
                        "adcode": "140271",
                        "name": "山西大同经济开发区"
                    },
                    {
                        "adcode": "140213",
                        "name": "平城区"
                    }
                ]
            },
            {
                "adcode": "1401",
                "name": "太原市",
                "s": [
                    {
                        "adcode": "140199",
                        "name": "太原市市本级"
                    },
                    {
                        "adcode": "140105",
                        "name": "小店区"
                    },
                    {
                        "adcode": "140106",
                        "name": "迎泽区"
                    },
                    {
                        "adcode": "140107",
                        "name": "杏花岭区"
                    },
                    {
                        "adcode": "140108",
                        "name": "尖草坪区"
                    },
                    {
                        "adcode": "140109",
                        "name": "万柏林区"
                    },
                    {
                        "adcode": "140110",
                        "name": "晋源区"
                    },
                    {
                        "adcode": "140121",
                        "name": "清徐县"
                    },
                    {
                        "adcode": "140122",
                        "name": "阳曲县"
                    },
                    {
                        "adcode": "140123",
                        "name": "娄烦县"
                    },
                    {
                        "adcode": "140140",
                        "name": "太原经济技术开发区"
                    },
                    {
                        "adcode": "140181",
                        "name": "古交市"
                    },
                    {
                        "adcode": "140101",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "140171",
                        "name": "山西转型综合改革示范区"
                    }
                ]
            },
            {
                "adcode": "1411",
                "name": "吕梁市",
                "s": [
                    {
                        "adcode": "141199",
                        "name": "吕梁市市本级"
                    },
                    {
                        "adcode": "141102",
                        "name": "离石区"
                    },
                    {
                        "adcode": "141121",
                        "name": "文水县"
                    },
                    {
                        "adcode": "141122",
                        "name": "交城县"
                    },
                    {
                        "adcode": "141123",
                        "name": "兴县"
                    },
                    {
                        "adcode": "141124",
                        "name": "临县"
                    },
                    {
                        "adcode": "141125",
                        "name": "柳林县"
                    },
                    {
                        "adcode": "141126",
                        "name": "石楼县"
                    },
                    {
                        "adcode": "141127",
                        "name": "岚县"
                    },
                    {
                        "adcode": "141128",
                        "name": "方山县"
                    },
                    {
                        "adcode": "141129",
                        "name": "中阳县"
                    },
                    {
                        "adcode": "141130",
                        "name": "交口县"
                    },
                    {
                        "adcode": "141181",
                        "name": "孝义市"
                    },
                    {
                        "adcode": "141182",
                        "name": "汾阳市"
                    },
                    {
                        "adcode": "141101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "1410",
                "name": "临汾市",
                "s": [
                    {
                        "adcode": "141099",
                        "name": "临汾市市本级"
                    },
                    {
                        "adcode": "141002",
                        "name": "尧都区"
                    },
                    {
                        "adcode": "141021",
                        "name": "曲沃县"
                    },
                    {
                        "adcode": "141022",
                        "name": "翼城县"
                    },
                    {
                        "adcode": "141023",
                        "name": "襄汾县"
                    },
                    {
                        "adcode": "141024",
                        "name": "洪洞县"
                    },
                    {
                        "adcode": "141025",
                        "name": "古县"
                    },
                    {
                        "adcode": "141026",
                        "name": "安泽县"
                    },
                    {
                        "adcode": "141027",
                        "name": "浮山县"
                    },
                    {
                        "adcode": "141028",
                        "name": "吉县"
                    },
                    {
                        "adcode": "141029",
                        "name": "乡宁县"
                    },
                    {
                        "adcode": "141030",
                        "name": "大宁县"
                    },
                    {
                        "adcode": "141031",
                        "name": "隰县"
                    },
                    {
                        "adcode": "141032",
                        "name": "永和县"
                    },
                    {
                        "adcode": "141033",
                        "name": "蒲县"
                    },
                    {
                        "adcode": "141034",
                        "name": "汾西县"
                    },
                    {
                        "adcode": "141081",
                        "name": "侯马市"
                    },
                    {
                        "adcode": "141082",
                        "name": "霍州市"
                    },
                    {
                        "adcode": "141001",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "1409",
                "name": "忻州市",
                "s": [
                    {
                        "adcode": "140999",
                        "name": "忻州市市本级"
                    },
                    {
                        "adcode": "140902",
                        "name": "忻府区"
                    },
                    {
                        "adcode": "140921",
                        "name": "定襄县"
                    },
                    {
                        "adcode": "140922",
                        "name": "五台县"
                    },
                    {
                        "adcode": "140923",
                        "name": "代县"
                    },
                    {
                        "adcode": "140924",
                        "name": "繁峙县"
                    },
                    {
                        "adcode": "140925",
                        "name": "宁武县"
                    },
                    {
                        "adcode": "140926",
                        "name": "静乐县"
                    },
                    {
                        "adcode": "140927",
                        "name": "神池县"
                    },
                    {
                        "adcode": "140928",
                        "name": "五寨县"
                    },
                    {
                        "adcode": "140929",
                        "name": "岢岚县"
                    },
                    {
                        "adcode": "140930",
                        "name": "河曲县"
                    },
                    {
                        "adcode": "140931",
                        "name": "保德县"
                    },
                    {
                        "adcode": "140932",
                        "name": "偏关县"
                    },
                    {
                        "adcode": "140940",
                        "name": "五台山风景名胜区"
                    },
                    {
                        "adcode": "140981",
                        "name": "原平市"
                    },
                    {
                        "adcode": "140901",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "1408",
                "name": "运城市",
                "s": [
                    {
                        "adcode": "140899",
                        "name": "运城市市本级"
                    },
                    {
                        "adcode": "140802",
                        "name": "盐湖区"
                    },
                    {
                        "adcode": "140821",
                        "name": "临猗县"
                    },
                    {
                        "adcode": "140822",
                        "name": "万荣县"
                    },
                    {
                        "adcode": "140823",
                        "name": "闻喜县"
                    },
                    {
                        "adcode": "140824",
                        "name": "稷山县"
                    },
                    {
                        "adcode": "140825",
                        "name": "新绛县"
                    },
                    {
                        "adcode": "140826",
                        "name": "绛县"
                    },
                    {
                        "adcode": "140827",
                        "name": "垣曲县"
                    },
                    {
                        "adcode": "140828",
                        "name": "夏县"
                    },
                    {
                        "adcode": "140829",
                        "name": "平陆县"
                    },
                    {
                        "adcode": "140830",
                        "name": "芮城县"
                    },
                    {
                        "adcode": "140881",
                        "name": "永济市"
                    },
                    {
                        "adcode": "140882",
                        "name": "河津市"
                    },
                    {
                        "adcode": "140840",
                        "name": "运城经济开发区"
                    },
                    {
                        "adcode": "140841",
                        "name": "空港经济开发区"
                    },
                    {
                        "adcode": "140842",
                        "name": "风陵渡经济开发区"
                    },
                    {
                        "adcode": "140843",
                        "name": "绛县经济开发区"
                    },
                    {
                        "adcode": "140801",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "1407",
                "name": "晋中市",
                "s": [
                    {
                        "adcode": "140799",
                        "name": "晋中市市本级"
                    },
                    {
                        "adcode": "140702",
                        "name": "榆次区"
                    },
                    {
                        "adcode": "140721",
                        "name": "榆社县"
                    },
                    {
                        "adcode": "140722",
                        "name": "左权县"
                    },
                    {
                        "adcode": "140723",
                        "name": "和顺县"
                    },
                    {
                        "adcode": "140724",
                        "name": "昔阳县"
                    },
                    {
                        "adcode": "140725",
                        "name": "寿阳县"
                    },
                    {
                        "adcode": "140726",
                        "name": "太谷县"
                    },
                    {
                        "adcode": "140727",
                        "name": "祁县"
                    },
                    {
                        "adcode": "140728",
                        "name": "平遥县"
                    },
                    {
                        "adcode": "140729",
                        "name": "灵石县"
                    },
                    {
                        "adcode": "140740",
                        "name": "榆次经济技术开发区"
                    },
                    {
                        "adcode": "140781",
                        "name": "介休市"
                    },
                    {
                        "adcode": "140701",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "1406",
                "name": "朔州市",
                "s": [
                    {
                        "adcode": "140699",
                        "name": "朔州市市本级"
                    },
                    {
                        "adcode": "140602",
                        "name": "朔城区"
                    },
                    {
                        "adcode": "140603",
                        "name": "平鲁区"
                    },
                    {
                        "adcode": "140621",
                        "name": "山阴县"
                    },
                    {
                        "adcode": "140622",
                        "name": "应县"
                    },
                    {
                        "adcode": "140623",
                        "name": "右玉县"
                    },
                    {
                        "adcode": "140624",
                        "name": "怀仁县"
                    },
                    {
                        "adcode": "140601",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "140681",
                        "name": "怀仁市"
                    },
                    {
                        "adcode": "140671",
                        "name": "山西朔州经济开发区"
                    }
                ]
            },
            {
                "adcode": "1405",
                "name": "晋城市",
                "s": [
                    {
                        "adcode": "140599",
                        "name": "晋城市市本级"
                    },
                    {
                        "adcode": "140502",
                        "name": "城区"
                    },
                    {
                        "adcode": "140521",
                        "name": "沁水县"
                    },
                    {
                        "adcode": "140522",
                        "name": "阳城县"
                    },
                    {
                        "adcode": "140524",
                        "name": "陵川县"
                    },
                    {
                        "adcode": "140525",
                        "name": "泽州县"
                    },
                    {
                        "adcode": "140540",
                        "name": "晋城经济技术开发区"
                    },
                    {
                        "adcode": "140581",
                        "name": "高平市"
                    },
                    {
                        "adcode": "140501",
                        "name": "市辖区"
                    }
                ]
            }
        ]
    },
    {
        "adcode": "61",
        "name": "陕西省",
        "s": [
            {
                "adcode": "6111",
                "name": "杨凌示范区",
                "s": [
                    {
                        "adcode": "611199",
                        "name": "杨凌示范区本级"
                    }
                ]
            },
            {
                "adcode": "6110",
                "name": "商洛市",
                "s": [
                    {
                        "adcode": "611099",
                        "name": "商洛市市本级"
                    },
                    {
                        "adcode": "611002",
                        "name": "商州区"
                    },
                    {
                        "adcode": "611021",
                        "name": "洛南县"
                    },
                    {
                        "adcode": "611022",
                        "name": "丹凤县"
                    },
                    {
                        "adcode": "611023",
                        "name": "商南县"
                    },
                    {
                        "adcode": "611024",
                        "name": "山阳县"
                    },
                    {
                        "adcode": "611025",
                        "name": "镇安县"
                    },
                    {
                        "adcode": "611026",
                        "name": "柞水县"
                    },
                    {
                        "adcode": "611001",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6102",
                "name": "铜川市",
                "s": [
                    {
                        "adcode": "610299",
                        "name": "铜川市市本级"
                    },
                    {
                        "adcode": "610202",
                        "name": "王益区"
                    },
                    {
                        "adcode": "610203",
                        "name": "印台区"
                    },
                    {
                        "adcode": "610204",
                        "name": "耀州区"
                    },
                    {
                        "adcode": "610222",
                        "name": "宜君县"
                    },
                    {
                        "adcode": "610240",
                        "name": "铜川市新区"
                    },
                    {
                        "adcode": "610201",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6101",
                "name": "西安市",
                "s": [
                    {
                        "adcode": "610199",
                        "name": "西安市市本级"
                    },
                    {
                        "adcode": "610102",
                        "name": "新城区"
                    },
                    {
                        "adcode": "610103",
                        "name": "碑林区"
                    },
                    {
                        "adcode": "610104",
                        "name": "莲湖区"
                    },
                    {
                        "adcode": "610111",
                        "name": "灞桥区"
                    },
                    {
                        "adcode": "610112",
                        "name": "未央区"
                    },
                    {
                        "adcode": "610113",
                        "name": "雁塔区"
                    },
                    {
                        "adcode": "610114",
                        "name": "阎良区"
                    },
                    {
                        "adcode": "610115",
                        "name": "临潼区"
                    },
                    {
                        "adcode": "610116",
                        "name": "长安区"
                    },
                    {
                        "adcode": "610117",
                        "name": "高陵区"
                    },
                    {
                        "adcode": "610118",
                        "name": "鄠邑区"
                    },
                    {
                        "adcode": "610122",
                        "name": "蓝田县"
                    },
                    {
                        "adcode": "610124",
                        "name": "周至县"
                    },
                    {
                        "adcode": "610125",
                        "name": "户县"
                    },
                    {
                        "adcode": "610126",
                        "name": "高陵县"
                    },
                    {
                        "adcode": "610140",
                        "name": "西安高新技术产业开发区"
                    },
                    {
                        "adcode": "610141",
                        "name": "西安经济开发区"
                    },
                    {
                        "adcode": "610142",
                        "name": "西安国家民用航天产业基地"
                    },
                    {
                        "adcode": "610143",
                        "name": "西安国际港务区"
                    },
                    {
                        "adcode": "610101",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6104",
                "name": "咸阳市",
                "s": [
                    {
                        "adcode": "610499",
                        "name": "咸阳市市本级"
                    },
                    {
                        "adcode": "610402",
                        "name": "秦都区"
                    },
                    {
                        "adcode": "610403",
                        "name": "杨凌区"
                    },
                    {
                        "adcode": "610404",
                        "name": "渭城区"
                    },
                    {
                        "adcode": "610422",
                        "name": "三原县"
                    },
                    {
                        "adcode": "610423",
                        "name": "泾阳县"
                    },
                    {
                        "adcode": "610424",
                        "name": "乾县"
                    },
                    {
                        "adcode": "610425",
                        "name": "礼泉县"
                    },
                    {
                        "adcode": "610426",
                        "name": "永寿县"
                    },
                    {
                        "adcode": "610427",
                        "name": "彬县"
                    },
                    {
                        "adcode": "610428",
                        "name": "长武县"
                    },
                    {
                        "adcode": "610429",
                        "name": "旬邑县"
                    },
                    {
                        "adcode": "610430",
                        "name": "淳化县"
                    },
                    {
                        "adcode": "610431",
                        "name": "武功县"
                    },
                    {
                        "adcode": "610481",
                        "name": "兴平市"
                    },
                    {
                        "adcode": "610401",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "610482",
                        "name": "彬州市"
                    },
                    {
                        "adcode": "610403",
                        "name": "杨陵区"
                    }
                ]
            },
            {
                "adcode": "6103",
                "name": "宝鸡市",
                "s": [
                    {
                        "adcode": "610399",
                        "name": "宝鸡市市本级"
                    },
                    {
                        "adcode": "610302",
                        "name": "渭滨区"
                    },
                    {
                        "adcode": "610303",
                        "name": "金台区"
                    },
                    {
                        "adcode": "610304",
                        "name": "陈仓区"
                    },
                    {
                        "adcode": "610322",
                        "name": "凤翔县"
                    },
                    {
                        "adcode": "610323",
                        "name": "岐山县"
                    },
                    {
                        "adcode": "610324",
                        "name": "扶风县"
                    },
                    {
                        "adcode": "610326",
                        "name": "眉县"
                    },
                    {
                        "adcode": "610327",
                        "name": "陇县"
                    },
                    {
                        "adcode": "610328",
                        "name": "千阳县"
                    },
                    {
                        "adcode": "610329",
                        "name": "麟游县"
                    },
                    {
                        "adcode": "610330",
                        "name": "凤县"
                    },
                    {
                        "adcode": "610331",
                        "name": "太白县"
                    },
                    {
                        "adcode": "610340",
                        "name": "宝鸡市高新区"
                    },
                    {
                        "adcode": "610301",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6106",
                "name": "延安市",
                "s": [
                    {
                        "adcode": "610699",
                        "name": "延安市市本级"
                    },
                    {
                        "adcode": "610602",
                        "name": "宝塔区"
                    },
                    {
                        "adcode": "610603",
                        "name": "安塞区"
                    },
                    {
                        "adcode": "610621",
                        "name": "延长县"
                    },
                    {
                        "adcode": "610622",
                        "name": "延川县"
                    },
                    {
                        "adcode": "610623",
                        "name": "子长县"
                    },
                    {
                        "adcode": "610624",
                        "name": "安塞县"
                    },
                    {
                        "adcode": "610625",
                        "name": "志丹县"
                    },
                    {
                        "adcode": "610626",
                        "name": "吴起县"
                    },
                    {
                        "adcode": "610627",
                        "name": "甘泉县"
                    },
                    {
                        "adcode": "610628",
                        "name": "富县"
                    },
                    {
                        "adcode": "610629",
                        "name": "洛川县"
                    },
                    {
                        "adcode": "610630",
                        "name": "宜川县"
                    },
                    {
                        "adcode": "610631",
                        "name": "黄龙县"
                    },
                    {
                        "adcode": "610632",
                        "name": "黄陵县"
                    },
                    {
                        "adcode": "610601",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6105",
                "name": "渭南市",
                "s": [
                    {
                        "adcode": "610599",
                        "name": "渭南市市本级"
                    },
                    {
                        "adcode": "610502",
                        "name": "临渭区"
                    },
                    {
                        "adcode": "610521",
                        "name": "华县"
                    },
                    {
                        "adcode": "610522",
                        "name": "潼关县"
                    },
                    {
                        "adcode": "610523",
                        "name": "大荔县"
                    },
                    {
                        "adcode": "610524",
                        "name": "合阳县"
                    },
                    {
                        "adcode": "610525",
                        "name": "澄城县"
                    },
                    {
                        "adcode": "610526",
                        "name": "蒲城县"
                    },
                    {
                        "adcode": "610527",
                        "name": "白水县"
                    },
                    {
                        "adcode": "610528",
                        "name": "富平县"
                    },
                    {
                        "adcode": "610540",
                        "name": "高新技术产业开发区"
                    },
                    {
                        "adcode": "610541",
                        "name": "渭南市经开区"
                    },
                    {
                        "adcode": "610581",
                        "name": "韩城市"
                    },
                    {
                        "adcode": "610582",
                        "name": "华阴市"
                    },
                    {
                        "adcode": "610501",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "610503",
                        "name": "华州区"
                    }
                ]
            },
            {
                "adcode": "6108",
                "name": "榆林市",
                "s": [
                    {
                        "adcode": "610899",
                        "name": "榆林市市本级"
                    },
                    {
                        "adcode": "610802",
                        "name": "榆阳区"
                    },
                    {
                        "adcode": "610821",
                        "name": "神木县"
                    },
                    {
                        "adcode": "610822",
                        "name": "府谷县"
                    },
                    {
                        "adcode": "610823",
                        "name": "横山县"
                    },
                    {
                        "adcode": "610824",
                        "name": "靖边县"
                    },
                    {
                        "adcode": "610825",
                        "name": "定边县"
                    },
                    {
                        "adcode": "610826",
                        "name": "绥德县"
                    },
                    {
                        "adcode": "610827",
                        "name": "米脂县"
                    },
                    {
                        "adcode": "610828",
                        "name": "佳县"
                    },
                    {
                        "adcode": "610829",
                        "name": "吴堡县"
                    },
                    {
                        "adcode": "610830",
                        "name": "清涧县"
                    },
                    {
                        "adcode": "610831",
                        "name": "子洲县"
                    },
                    {
                        "adcode": "610801",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "610803",
                        "name": "横山区"
                    },
                    {
                        "adcode": "610881",
                        "name": "神木市"
                    }
                ]
            },
            {
                "adcode": "6107",
                "name": "汉中市",
                "s": [
                    {
                        "adcode": "610799",
                        "name": "汉中市市本级"
                    },
                    {
                        "adcode": "610702",
                        "name": "汉台区"
                    },
                    {
                        "adcode": "610721",
                        "name": "南郑县"
                    },
                    {
                        "adcode": "610722",
                        "name": "城固县"
                    },
                    {
                        "adcode": "610723",
                        "name": "洋县"
                    },
                    {
                        "adcode": "610724",
                        "name": "西乡县"
                    },
                    {
                        "adcode": "610725",
                        "name": "勉县"
                    },
                    {
                        "adcode": "610726",
                        "name": "宁强县"
                    },
                    {
                        "adcode": "610727",
                        "name": "略阳县"
                    },
                    {
                        "adcode": "610728",
                        "name": "镇巴县"
                    },
                    {
                        "adcode": "610729",
                        "name": "留坝县"
                    },
                    {
                        "adcode": "610730",
                        "name": "佛坪县"
                    },
                    {
                        "adcode": "610701",
                        "name": "市辖区"
                    },
                    {
                        "adcode": "610703",
                        "name": "南郑区"
                    }
                ]
            },
            {
                "adcode": "6109",
                "name": "安康市",
                "s": [
                    {
                        "adcode": "610999",
                        "name": "安康市市本级"
                    },
                    {
                        "adcode": "610902",
                        "name": "汉滨区"
                    },
                    {
                        "adcode": "610921",
                        "name": "汉阴县"
                    },
                    {
                        "adcode": "610922",
                        "name": "石泉县"
                    },
                    {
                        "adcode": "610923",
                        "name": "宁陕县"
                    },
                    {
                        "adcode": "610924",
                        "name": "紫阳县"
                    },
                    {
                        "adcode": "610925",
                        "name": "岚皋县"
                    },
                    {
                        "adcode": "610926",
                        "name": "平利县"
                    },
                    {
                        "adcode": "610927",
                        "name": "镇坪县"
                    },
                    {
                        "adcode": "610928",
                        "name": "旬阳县"
                    },
                    {
                        "adcode": "610929",
                        "name": "白河县"
                    },
                    {
                        "adcode": "610940",
                        "name": "安康市高新区"
                    },
                    {
                        "adcode": "610901",
                        "name": "市辖区"
                    }
                ]
            },
            {
                "adcode": "6170",
                "name": "陕西省西咸新区",
                "s": [
                    {
                        "adcode": "617001",
                        "name": "陕西省西咸新区空港新城"
                    },
                    {
                        "adcode": "617002",
                        "name": "陕西省西咸新区沣东新城"
                    },
                    {
                        "adcode": "617003",
                        "name": "陕西省西咸新区秦汉新城"
                    },
                    {
                        "adcode": "617004",
                        "name": "陕西省西咸新区沣西新城"
                    },
                    {
                        "adcode": "617005",
                        "name": "陕西省西咸新区泾河新城"
                    }
                ]
            }
        ]
    }
]